[
  "Chhatrapati Shivaji Maharaj was a great warrior and the founder of the Maratha Empire in India. Chhatrapati Shivaji Maharaj was born on February 19, 1630, in Shivneri Fort. He was known for his bravery, leadership, and smart war tactics. He used guerrilla warfare and built a strong navy to protect his kingdom. Shivaji Maharaj focused on good rule, respect for all religions, and the well-being of his people. He was crowned Chhatrapati in 1674 at Raigad Fort. His inspiring life still motivates people today. His smart decisions and strong leadership made him one of India’s greatest kings, teaching courage, honesty, and patriotism.",
  "Chhatrapati Shivaji Maharaj, born on February 19, 1630, in Shivneri Fort, Maharashtra, was the son of Shahaji Bhosale and Jijabai. Raised in constant conflict, he was instilled with leadership skills and a sense of justice from a young age. At the age of 16, he captured his first fort, Torna, and soon began expanding his territory. By 1647, he had taken control of Poona, marking the beginning of his quest to establish the Maratha Empire. Known for his innovative military tactics, particularly guerrilla warfare, Shivaji captured several key forts, including Raigad, Sinhagad, and Purandhara, and expanded his influence across western India. In 1674, he was crowned Chhatrapati at Raigad Fort, solidifying his authority.",
  "Chhatrapati Shivaji Maharaj’s conquests began with the capture of Bijapur outposts and the defeat of influential allies of the sultans. His military brilliance led to several victories, including the defeat of Afzal Khan in 1659, where he lured him into the mountains and killed him. This victory earned him weapons and ammunition, solidifying his reputation as a formidable warlord.",
  "\"Escape from Agra\" is one of the most famous and dramatic episodes in the life of Chhatrapati Shivaji Maharaj. It took place in 1666, when Emperor Aurangzeb invited Shivaji Maharaj to the Mughal court in Agra under the guise of a friendly meeting. However, the situation turned perilous when Shivaji was placed under house arrest by Aurangzeb.",
  "Shivaji Maharaj Jayanti is celebrated every year on February 19 to honour the birth of Chhatrapati Shivaji Maharaj, the great Maratha warrior and founder of the Maratha Empire. Born in 1630 at Shivneri Fort, he is remembered for his bravery, military tactics, and vision of Swarajya (self-rule).",
  "Chhatrapati Shivaji Maharaj, a fearless warrior and visionary leader, inspired generations with his words of wisdom. His quotes reflect his strong sense of justice, self-governance, and bravery.",
  "1. When was Chhatrapati Shivaji Maharaj born?",
  "Chhatrapati Shivaji Maharaj was born on February 19, 1630, at Shivneri Fort in Maharashtra. His birth anniversary is celebrated as Shivaji Maharaj Jayanti every year.",
  "2. Who was Chhatrapati Shivaji Maharaj?",
  "Chhatrapati Shivaji Maharaj was a great Maratha warrior and founder of the Maratha Empire in western India. He is known for his military skills, administrative reforms, and strong navy.",
  "3. Who was Chhatrapati Shivaji Maharaj’s spouse?",
  "Chhatrapati Shivaji Maharaj passed away on April 3, 1680, at Raigad Fort due to illness. His legacy continued through his successors.",
  "10. How did Chhatrapati Shivaji Maharaj expand his empire?",
  "Chhatrapati Shivaji Maharaj Biography",
  "Chhatrapati Shivaji Maharaj: The Great Maratha Warrior Who Built an Empire",
  "Life History of Chhatrapati Shivaji Maharaj",
  "Childhood and Early Life of Chhatrapati Shivaji Maharaj",
  "Chhatrapati Shivaji Maharaj Spouse and Children",
  "Conquests of Chhatrapati Shivaji Maharaj",
  "The Rise of Chhatrapati Shivaji Maharaj",
  "FAQs on Chhatrapati Shivaji Maharaj Biography",
  "Chhatrapati Shivaji Maharaj Biography",
  "Chhatrapati Shivaji Maharaj, a renowned fighter and administrator, founded the Maratha Empire in western India. He used his drive and administrative skills to establish a powerful empire from the fading Adilshahi sultanate of Bijapur. He developed an efficient government with a disciplined military and a well-formed administrative system. Shivaji was known for his innovative military strategies, utilizing landscape and speed. On February 19, Maharashtra celebrates Chhatrapati Shivaji Maharaj Jayanti, a festival and public holiday commemorating his birth anniversary.",
  "All About Chhatrapati Shivaji Maharaj UPSC CSE",
  "Summary of Chhatrapati Shivaji Maharaj",
  "Background of Chhatrapati Shivaji Maharaj",
  "Introduction of Chhatrapati Shivaji Maharaj",
  "Conclusion for Chhatrapati Shivaji Maharaj",
  "Battle of Pratapgad, 1659 The Maratha ruler Chhatrapati Shivaji Maharaj and Adilshahi commander Afzal Khan fought at Pratapgad in Satara, Maharashtra.",
  "Battle of Surat, 1664: The battle at Surat, Gujarat, occurred between Chhatrapati Shivaji Maharaj and Mughal commander Inayat Khan."
]