[
  "Shri Narendra Modi was sworn-in as India’s Prime Minister for the third time on 9th June 2024, following another decisive victory in the 2024 Parliamentary elections. This victory marked the third consecutive term for Shri Modi, further solidifying his leadership.",
  "The first ever Prime Minister to be born after Independence, Shri Modi has previously served as the Prime Minister of India from 2014 to 2019, and from 2019 to 2024. He also has the distinction of being the longest serving Chief Minister of Gujarat with his term spanning from October 2001 to May 2014.",
  "Shri Modi’s foreign policy initiatives have realised the true potential and role of world’s largest democracy. He began his first term in office in presence of all Heads of States of SAARC Nations and invited BIMSTEC leaders at the start of the second. His address to the General Assembly of United Nations was appreciated across the world. Shri Modi became the first Indian Prime Minister to embark on a bilateral visit to Nepal after a long period of 17 years, to Australia after 28 years, to Fiji after 31 years and UAE as well as Seychelles after 34 years. Since taking over, Shri Modi attended UN, BRICS, SAARC and G-20 Summits, where India’s interventions and views on a variety of global economic and political issues were widely appreciated.",
  "Know the PM Shri Narendra Modi was sworn-in as India’s Prime Minister for the third time on 9th June 2024, following another decisive victory in the 2024 Parliamentary elections. This victory marked the third consecutive term for Shri Modi, further solidifying his leadership. The 2024 elections saw a remarkable voter turnout, with a significant portion of the electorate showing continued confidence in Shri Modi’s leadership and vision for the country. His campaign focused on a blend of economic development, national security, and social welfare programs, which resonated widely with the populace. Shri Modi’s third term is expected to build on the foundations laid during his previous tenures, with a renewed emphasis on technological innovation, infrastructure development, and international diplomacy, further positioning India as a global powerhouse. The unprecedented third term underscores Shri Modi’s enduring appeal and the trust placed in him by millions of Indians to lead the nation towards greater prosperity and stability. The first ever Prime Minister to be born after Independence, Shri Modi has previously served as the Prime Minister of India from 2014 to 2019, and from 2019 to 2024. He also has the distinction of being the longest serving Chief Minister of Gujarat with his term spanning from October 2001 to May 2014. In the 2014 and 2019 Parliamentary elections, Shri Modi led the Bharatiya Janata Party to record wins, securing absolute majority on both occasions. The last time that a political party secured such an absolute majority was in the elections of 1984. Inspired by the motto of ‘SabkaSaath, Sabka Vikas, Sabka Vishwas’, Shri Modi has ushered in a paradigm shift in governance that has led to inclusive, development-oriented and corruption-free governance. The Prime Minister has worked with speed and scale to realise the aim of Antyodaya, or ensuring last-mile delivery of schemes and services. Leading international agencies have noted that under the leadership of PM Narendra Modi, India has been eliminating poverty at record pace. According to the findings from NITI Aayog’s latest report ‘Multidimensional Poverty in India since 2005-06’, almost 25 crore people escaped multidimensional poverty in last nine years. The credit for this remarkable achievement goes to significant initiatives of the government to address all dimensions of poverty. Today, India is home to the world’s largest healthcare programme, Ayushman Bharat. Covering over 50 crore Indians, Ayushman Bharat provides top quality and affordable healthcare to the poor and neo-middle class. The Lancet, considered among the most prestigious health journals in the world has lauded Ayushman Bharat, stating that this scheme attends to the larger discontent about the health sector in India. The journal also noted PM Modi’s efforts to prioritise universal health coverage. Understanding that financial exclusion was a bane for the poor, the Prime Minister launched the Pradhan Mantri Jan Dhan Yojana, that aimed at opening bank accounts for every Indian. Now, over 51 crore Jan Dhan accounts have been opened. These accounts have not only banked the unbanked but also opened the doors for other avenues of empowerment. Going a step ahead of Jan Dhan, Shri Modi emphasised on Jan Suraksha, by giving insurance and pension cover to the most vulnerable sections of society. The JAM trinity (Jan Dhan- Aadhaar- Mobile) has led to elimination of middle men and ensured transparency and speed, powered by technology. The Pradhan Mantri Ujjwala Yojana, launched in 2016 provides free cooking gas connections to the poor. It has proven to be a major game-changer in providing smoke-free kitchens to over 10 crore beneficiaries, most of whom are women. 18,000 villages that were without electricity even after 70 long years of Independence have been electrified. Shri Modi believes that no Indian should be homeless and to realise this vision, over 4.2 crore houses were sanctionedunder the PM Awas Yojana between 2014 and 2024. In June 2024, after assuming office for the third term, one of the first decisions of the Cabinet was to assist 3 crore additional rural and urban households for the construction of houses, underscoring Shri Narendra Modi’s commitment to addressing the nation’s housing needs and ensuring dignity and a quality life for every citizen. Agriculture is a sector that is very close to Shri Narendra Modi. During the interim budget of 2019, the Government announced a monetary incentive for farmers called the PM Kisan Samman Nidhi. In almost three weeks, on 24th February 2019, the scheme was launched and instalments have been paid regularly since then. During the first Cabinet Meeting of PM Modi’s second term, it was decided to extend the PM Kisan benefits to all farmers, removing the 5 acre limit that was present earlier. As of June 2024, Shri Modi released the 17thinstalment of the PM-KISAN scheme at Varanasi in which more than 9.2 crore farmers received the benefits amounting to over Rs.20,000 crore. Shri Modi has also focused path-breaking initiatives for agriculture ranging from Soil Health Cards, E-NAM for better markets and a renewed focus on irrigation. On 30th May 2019, PM Modi fulfilled a major promise by creating a new Jal Shakti Ministry to cater to all aspects relating to water resources. On 2nd October 2014, Mahatma Gandhi’s Birth Anniversary, the PM launched ‘Swachh Bharat Mission’ a mass movement for cleanliness across the nation. The scale and impact of the movement is historic. Today, sanitation coverage has risen from 38% in 2014 to 100% in 2019. All states and Union Territories have been declared open defecation free (ODF). Substantive measures been taken for a clean Ganga. The World Health Organisation has appreciated the Swachh Bharat Mission and has opined that it would save three lakh lives. Shri Modi believes that transportation is an important means towards transformation. That is why, the Government of India has been working to create next-generation infrastructure be it in terms of more highways, railways, i-ways and waterways. The UDAN (UdeDesh Ka Aam Nagrik) Scheme has made aviation sector more people-friendly and boosted connectivity. PM Modi launched the ‘Make in India’ initiative to turn India into an international manufacturing powerhouse. This effort has led to transformative results. India has made significant strides in ‘Ease of Doing Business’, improving its ranking from 142 in 2014 to 63 in 2019. The Government of India rolled out the GST during a historic session of Parliament in 2017, which has realised the dream of ‘One Nation, One Tax.’ During his tenure, special attention has been paid to India’s rich history and culture. India is home to the world’s largest statue, the State of Unity, a fitting tribute to Sardar Patel. This Statue was built through a special mass movement where tools of farmers and soil from all states and Union Territories of India were used, signifying the spirit of ‘Ek Bharat, Shreshtha Bharat.’ PM Modi is deeply passionate about environmental causes. He has time and again called for closing of ranks to create a clean and green planet. As Chief Minister of Gujarat, Shri Modi created a separate Climate Change Department to create innovative solutions to climate change. This spirit was seen in the 2015 COP21 Summit in Paris where PM Modi played a key role in the high-level deliberations. Going a step ahead of climate change, PM Modi has talked about climate justice. In 2018, Heads of State and Government from several nations came to India for the launch of the International Solar Alliance, an innovative effort to harness solar energy for a better planet. Recognising his efforts towards environmental conservation, PM Modi was honoured with the United Nations ‘Champions of the Earth Award.’ Fully sensitive to the fact that climate change has made our planet prone to natural disasters, Shri Modi has brought a new approach to disaster management, harnessing the power of technology and the strength of human resources. As Chief Minister, he transformed Gujarat that had just been ravaged by a devastating earthquake on 26th January 2001. Likewise, he introduced new systems to combat floods and droughts in Gujarat that were internationally lauded. Through administrative reforms, Shri Modi has always given priority to justice for citizens. In Gujarat, he spearheaded the start of evening courts to ensure people’s issues are resolved. At the Centre, he began PRAGATI ((Pro-Active Governance And Timely Implementation) to expedite pending projects that were delaying growth. Shri Modi’s foreign policy initiatives have realised the true potential and role of world’s largest democracy. He began his first term in office in presence of all Heads of States of SAARC Nations and invited BIMSTEC leaders at the start of the second. His address to the General Assembly of United Nations was appreciated across the world. Shri Modi became the first Indian Prime Minister to embark on a bilateral visit to Nepal after a long period of 17 years, to Australia after 28 years, to Fiji after 31 years and UAE as well as Seychelles after 34 years. Since taking over, Shri Modi attended UN, BRICS, SAARC and G-20 Summits, where India’s interventions and views on a variety of global economic and political issues were widely appreciated. PM Modi has been conferred various honours including the highest civilian honour of Saudi Arabia Sash of King Abdulaziz. Shri Modi has been also been conferred the top awards of Russia (The Order of the Holy Apostle Andrew the First), Palestine (Grand Collar of the State of Palestine), Afghanistan (Amir Amanullah Khan Award), UAE (Order of Zayed Award), Maldives (Rule of Nishan Izzuddeen), Bahrain (King Hamad Order of the Renaissance), Bhutan (Order of the Druk Gyalpo), Papua New Guinea (Grand Companion of the Order of Logohu), Fiji (Companion of the Order of Fiji), Egypt (Order of Nile), France (Grand Cross of the Legion of Honour), and Greece (The Grand Cross of the Order of Honour). In 2018, PM received the prestigious Seoul Peace Prize for his contribution to peace and development.He has also received the Global Goalkeeper’ Award by Bill and Melinda Gates Foundation, and Global Energy and Environment Leadership Award by Cambridge Energy Research Associates. Narendra Modi’s clarion call for marking a day as ‘International Day of Yoga’ received an overwhelming response at the UN. In a first, a total of 177 Nations across the world came together and passed the resolution to declare 21st June as the ‘International Day of Yoga at the UN.’ Shri Modi was born on 17 September, 1950, in a small town in Gujarat. His family belonged to the ‘other backward class’ which is among the marginalised sections of society. He grew up in a poor but loving family ‘without a spare rupee’. The initial hardships of life not only taught the value of hard work but also exposed him to the avoidable sufferings of the common people. This inspired him from a very young age to immerse himself in service of people and the nation. In his initial years, he worked with the Rashtriya Swayamsevak Sangh (RSS), a nationalist organisation devoted to nation building and later devoted himself in politics working with the Bharatiya Janata Party organization at National and State level. Shri Modi completed his MA in political science from Gujarat University. Narendra Modi is a ‘People’s Leader’, dedicated to solving their problems and improving their well-being. Nothing is more satisfying to him than being amongst the people, sharing their joys and alleviating their sorrows. His powerful ‘personal connect’ with the people on ground is complemented by a strong online presence. He is known as India’s most techno-savvy leader, using the web to reach people and bring about change in their lives. He is very active on social media platforms including YouTube, Facebook, Twitter, Instagram, Sound Cloud, Linkedin, and other forums. Beyond politics, Narendra Modi enjoys writing. He has authored several books, including poetry. He begins his day with Yoga, which strengthens his body and mind and instills the power of calmness in an otherwise fast-paced routine. http://www.narendramodi.in/categories/timeline http://www.narendramodi.in/humble-beginnings-the-early-years http://www.narendramodi.in/the-activist http://www.narendramodi.in/organiser-par-excellence-man-with-the-midas-touch",
  "Know the PM Shri Narendra Modi was sworn-in as India’s Prime Minister for the third time on 9th June 2024, following another decisive victory in the 2024 Parliamentary elections. This victory marked the third consecutive term for Shri Modi, further solidifying his leadership. The 2024 elections saw a remarkable voter turnout, with a significant portion of the electorate showing continued confidence in Shri Modi’s leadership and vision for the country. His campaign focused on a blend of economic development, national security, and social welfare programs, which resonated widely with the populace. Shri Modi’s third term is expected to build on the foundations laid during his previous tenures, with a renewed emphasis on technological innovation, infrastructure development, and international diplomacy, further positioning India as a global powerhouse. The unprecedented third term underscores Shri Modi’s enduring appeal and the trust placed in him by millions of Indians to lead the nation towards greater prosperity and stability. The first ever Prime Minister to be born after Independence, Shri Modi has previously served as the Prime Minister of India from 2014 to 2019, and from 2019 to 2024. He also has the distinction of being the longest serving Chief Minister of Gujarat with his term spanning from October 2001 to May 2014. In the 2014 and 2019 Parliamentary elections, Shri Modi led the Bharatiya Janata Party to record wins, securing absolute majority on both occasions. The last time that a political party secured such an absolute majority was in the elections of 1984. Inspired by the motto of ‘SabkaSaath, Sabka Vikas, Sabka Vishwas’, Shri Modi has ushered in a paradigm shift in governance that has led to inclusive, development-oriented and corruption-free governance. The Prime Minister has worked with speed and scale to realise the aim of Antyodaya, or ensuring last-mile delivery of schemes and services. Leading international agencies have noted that under the leadership of PM Narendra Modi, India has been eliminating poverty at record pace. According to the findings from NITI Aayog’s latest report ‘Multidimensional Poverty in India since 2005-06’, almost 25 crore people escaped multidimensional poverty in last nine years. The credit for this remarkable achievement goes to significant initiatives of the government to address all dimensions of poverty. Today, India is home to the world’s largest healthcare programme, Ayushman Bharat. Covering over 50 crore Indians, Ayushman Bharat provides top quality and affordable healthcare to the poor and neo-middle class. The Lancet, considered among the most prestigious health journals in the world has lauded Ayushman Bharat, stating that this scheme attends to the larger discontent about the health sector in India. The journal also noted PM Modi’s efforts to prioritise universal health coverage. Understanding that financial exclusion was a bane for the poor, the Prime Minister launched the Pradhan Mantri Jan Dhan Yojana, that aimed at opening bank accounts for every Indian. Now, over 51 crore Jan Dhan accounts have been opened. These accounts have not only banked the unbanked but also opened the doors for other avenues of empowerment. Going a step ahead of Jan Dhan, Shri Modi emphasised on Jan Suraksha, by giving insurance and pension cover to the most vulnerable sections of society. The JAM trinity (Jan Dhan- Aadhaar- Mobile) has led to elimination of middle men and ensured transparency and speed, powered by technology. The Pradhan Mantri Ujjwala Yojana, launched in 2016 provides free cooking gas connections to the poor. It has proven to be a major game-changer in providing smoke-free kitchens to over 10 crore beneficiaries, most of whom are women. 18,000 villages that were without electricity even after 70 long years of Independence have been electrified. Shri Modi believes that no Indian should be homeless and to realise this vision, over 4.2 crore houses were sanctionedunder the PM Awas Yojana between 2014 and 2024. In June 2024, after assuming office for the third term, one of the first decisions of the Cabinet was to assist 3 crore additional rural and urban households for the construction of houses, underscoring Shri Narendra Modi’s commitment to addressing the nation’s housing needs and ensuring dignity and a quality life for every citizen. Agriculture is a sector that is very close to Shri Narendra Modi. During the interim budget of 2019, the Government announced a monetary incentive for farmers called the PM Kisan Samman Nidhi. In almost three weeks, on 24th February 2019, the scheme was launched and instalments have been paid regularly since then. During the first Cabinet Meeting of PM Modi’s second term, it was decided to extend the PM Kisan benefits to all farmers, removing the 5 acre limit that was present earlier. As of June 2024, Shri Modi released the 17thinstalment of the PM-KISAN scheme at Varanasi in which more than 9.2 crore farmers received the benefits amounting to over Rs.20,000 crore. Shri Modi has also focused path-breaking initiatives for agriculture ranging from Soil Health Cards, E-NAM for better markets and a renewed focus on irrigation. On 30th May 2019, PM Modi fulfilled a major promise by creating a new Jal Shakti Ministry to cater to all aspects relating to water resources. On 2nd October 2014, Mahatma Gandhi’s Birth Anniversary, the PM launched ‘Swachh Bharat Mission’ a mass movement for cleanliness across the nation. The scale and impact of the movement is historic. Today, sanitation coverage has risen from 38% in 2014 to 100% in 2019. All states and Union Territories have been declared open defecation free (ODF). Substantive measures been taken for a clean Ganga. The World Health Organisation has appreciated the Swachh Bharat Mission and has opined that it would save three lakh lives. Shri Modi believes that transportation is an important means towards transformation. That is why, the Government of India has been working to create next-generation infrastructure be it in terms of more highways, railways, i-ways and waterways. The UDAN (UdeDesh Ka Aam Nagrik) Scheme has made aviation sector more people-friendly and boosted connectivity. PM Modi launched the ‘Make in India’ initiative to turn India into an international manufacturing powerhouse. This effort has led to transformative results. India has made significant strides in ‘Ease of Doing Business’, improving its ranking from 142 in 2014 to 63 in 2019. The Government of India rolled out the GST during a historic session of Parliament in 2017, which has realised the dream of ‘One Nation, One Tax.’ During his tenure, special attention has been paid to India’s rich history and culture. India is home to the world’s largest statue, the State of Unity, a fitting tribute to Sardar Patel. This Statue was built through a special mass movement where tools of farmers and soil from all states and Union Territories of India were used, signifying the spirit of ‘Ek Bharat, Shreshtha Bharat.’ PM Modi is deeply passionate about environmental causes. He has time and again called for closing of ranks to create a clean and green planet. As Chief Minister of Gujarat, Shri Modi created a separate Climate Change Department to create innovative solutions to climate change. This spirit was seen in the 2015 COP21 Summit in Paris where PM Modi played a key role in the high-level deliberations. Going a step ahead of climate change, PM Modi has talked about climate justice. In 2018, Heads of State and Government from several nations came to India for the launch of the International Solar Alliance, an innovative effort to harness solar energy for a better planet. Recognising his efforts towards environmental conservation, PM Modi was honoured with the United Nations ‘Champions of the Earth Award.’ Fully sensitive to the fact that climate change has made our planet prone to natural disasters, Shri Modi has brought a new approach to disaster management, harnessing the power of technology and the strength of human resources. As Chief Minister, he transformed Gujarat that had just been ravaged by a devastating earthquake on 26th January 2001. Likewise, he introduced new systems to combat floods and droughts in Gujarat that were internationally lauded. Through administrative reforms, Shri Modi has always given priority to justice for citizens. In Gujarat, he spearheaded the start of evening courts to ensure people’s issues are resolved. At the Centre, he began PRAGATI ((Pro-Active Governance And Timely Implementation) to expedite pending projects that were delaying growth. Shri Modi’s foreign policy initiatives have realised the true potential and role of world’s largest democracy. He began his first term in office in presence of all Heads of States of SAARC Nations and invited BIMSTEC leaders at the start of the second. His address to the General Assembly of United Nations was appreciated across the world. Shri Modi became the first Indian Prime Minister to embark on a bilateral visit to Nepal after a long period of 17 years, to Australia after 28 years, to Fiji after 31 years and UAE as well as Seychelles after 34 years. Since taking over, Shri Modi attended UN, BRICS, SAARC and G-20 Summits, where India’s interventions and views on a variety of global economic and political issues were widely appreciated. PM Modi has been conferred various honours including the highest civilian honour of Saudi Arabia Sash of King Abdulaziz. Shri Modi has been also been conferred the top awards of Russia (The Order of the Holy Apostle Andrew the First), Palestine (Grand Collar of the State of Palestine), Afghanistan (Amir Amanullah Khan Award), UAE (Order of Zayed Award), Maldives (Rule of Nishan Izzuddeen), Bahrain (King Hamad Order of the Renaissance), Bhutan (Order of the Druk Gyalpo), Papua New Guinea (Grand Companion of the Order of Logohu), Fiji (Companion of the Order of Fiji), Egypt (Order of Nile), France (Grand Cross of the Legion of Honour), and Greece (The Grand Cross of the Order of Honour). In 2018, PM received the prestigious Seoul Peace Prize for his contribution to peace and development.He has also received the Global Goalkeeper’ Award by Bill and Melinda Gates Foundation, and Global Energy and Environment Leadership Award by Cambridge Energy Research Associates. Narendra Modi’s clarion call for marking a day as ‘International Day of Yoga’ received an overwhelming response at the UN. In a first, a total of 177 Nations across the world came together and passed the resolution to declare 21st June as the ‘International Day of Yoga at the UN.’ Shri Modi was born on 17 September, 1950, in a small town in Gujarat. His family belonged to the ‘other backward class’ which is among the marginalised sections of society. He grew up in a poor but loving family ‘without a spare rupee’. The initial hardships of life not only taught the value of hard work but also exposed him to the avoidable sufferings of the common people. This inspired him from a very young age to immerse himself in service of people and the nation. In his initial years, he worked with the Rashtriya Swayamsevak Sangh (RSS), a nationalist organisation devoted to nation building and later devoted himself in politics working with the Bharatiya Janata Party organization at National and State level. Shri Modi completed his MA in political science from Gujarat University. Narendra Modi is a ‘People’s Leader’, dedicated to solving their problems and improving their well-being. Nothing is more satisfying to him than being amongst the people, sharing their joys and alleviating their sorrows. His powerful ‘personal connect’ with the people on ground is complemented by a strong online presence. He is known as India’s most techno-savvy leader, using the web to reach people and bring about change in their lives. He is very active on social media platforms including YouTube, Facebook, Twitter, Instagram, Sound Cloud, Linkedin, and other forums. Beyond politics, Narendra Modi enjoys writing. He has authored several books, including poetry. He begins his day with Yoga, which strengthens his body and mind and instills the power of calmness in an otherwise fast-paced routine. http://www.narendramodi.in/categories/timeline http://www.narendramodi.in/humble-beginnings-the-early-years http://www.narendramodi.in/the-activist http://www.narendramodi.in/organiser-par-excellence-man-with-the-midas-touch",
  "Shri Narendra Modi was sworn-in as India’s Prime Minister for the third time on 9th June 2024, following another decisive victory in the 2024 Parliamentary elections. This victory marked the third consecutive term for Shri Modi, further solidifying his leadership.",
  "The first ever Prime Minister to be born after Independence, Shri Modi has previously served as the Prime Minister of India from 2014 to 2019, and from 2019 to 2024. He also has the distinction of being the longest serving Chief Minister of Gujarat with his term spanning from October 2001 to May 2014.",
  "Shri Modi’s foreign policy initiatives have realised the true potential and role of world’s largest democracy. He began his first term in office in presence of all Heads of States of SAARC Nations and invited BIMSTEC leaders at the start of the second. His address to the General Assembly of United Nations was appreciated across the world. Shri Modi became the first Indian Prime Minister to embark on a bilateral visit to Nepal after a long period of 17 years, to Australia after 28 years, to Fiji after 31 years and UAE as well as Seychelles after 34 years. Since taking over, Shri Modi attended UN, BRICS, SAARC and G-20 Summits, where India’s interventions and views on a variety of global economic and political issues were widely appreciated.",
  "Know the PM Shri Narendra Modi was sworn-in as India’s Prime Minister for the third time on 9th June 2024, following another decisive victory in the 2024 Parliamentary elections. This victory marked the third consecutive term for Shri Modi, further solidifying his leadership. The 2024 elections saw a remarkable voter turnout, with a significant portion of the electorate showing continued confidence in Shri Modi’s leadership and vision for the country. His campaign focused on a blend of economic development, national security, and social welfare programs, which resonated widely with the populace. Shri Modi’s third term is expected to build on the foundations laid during his previous tenures, with a renewed emphasis on technological innovation, infrastructure development, and international diplomacy, further positioning India as a global powerhouse. The unprecedented third term underscores Shri Modi’s enduring appeal and the trust placed in him by millions of Indians to lead the nation towards greater prosperity and stability. The first ever Prime Minister to be born after Independence, Shri Modi has previously served as the Prime Minister of India from 2014 to 2019, and from 2019 to 2024. He also has the distinction of being the longest serving Chief Minister of Gujarat with his term spanning from October 2001 to May 2014. In the 2014 and 2019 Parliamentary elections, Shri Modi led the Bharatiya Janata Party to record wins, securing absolute majority on both occasions. The last time that a political party secured such an absolute majority was in the elections of 1984. Inspired by the motto of ‘SabkaSaath, Sabka Vikas, Sabka Vishwas’, Shri Modi has ushered in a paradigm shift in governance that has led to inclusive, development-oriented and corruption-free governance. The Prime Minister has worked with speed and scale to realise the aim of Antyodaya, or ensuring last-mile delivery of schemes and services. Leading international agencies have noted that under the leadership of PM Narendra Modi, India has been eliminating poverty at record pace. According to the findings from NITI Aayog’s latest report ‘Multidimensional Poverty in India since 2005-06’, almost 25 crore people escaped multidimensional poverty in last nine years. The credit for this remarkable achievement goes to significant initiatives of the government to address all dimensions of poverty. Today, India is home to the world’s largest healthcare programme, Ayushman Bharat. Covering over 50 crore Indians, Ayushman Bharat provides top quality and affordable healthcare to the poor and neo-middle class. The Lancet, considered among the most prestigious health journals in the world has lauded Ayushman Bharat, stating that this scheme attends to the larger discontent about the health sector in India. The journal also noted PM Modi’s efforts to prioritise universal health coverage. Understanding that financial exclusion was a bane for the poor, the Prime Minister launched the Pradhan Mantri Jan Dhan Yojana, that aimed at opening bank accounts for every Indian. Now, over 51 crore Jan Dhan accounts have been opened. These accounts have not only banked the unbanked but also opened the doors for other avenues of empowerment. Going a step ahead of Jan Dhan, Shri Modi emphasised on Jan Suraksha, by giving insurance and pension cover to the most vulnerable sections of society. The JAM trinity (Jan Dhan- Aadhaar- Mobile) has led to elimination of middle men and ensured transparency and speed, powered by technology. The Pradhan Mantri Ujjwala Yojana, launched in 2016 provides free cooking gas connections to the poor. It has proven to be a major game-changer in providing smoke-free kitchens to over 10 crore beneficiaries, most of whom are women. 18,000 villages that were without electricity even after 70 long years of Independence have been electrified. Shri Modi believes that no Indian should be homeless and to realise this vision, over 4.2 crore houses were sanctionedunder the PM Awas Yojana between 2014 and 2024. In June 2024, after assuming office for the third term, one of the first decisions of the Cabinet was to assist 3 crore additional rural and urban households for the construction of houses, underscoring Shri Narendra Modi’s commitment to addressing the nation’s housing needs and ensuring dignity and a quality life for every citizen. Agriculture is a sector that is very close to Shri Narendra Modi. During the interim budget of 2019, the Government announced a monetary incentive for farmers called the PM Kisan Samman Nidhi. In almost three weeks, on 24th February 2019, the scheme was launched and instalments have been paid regularly since then. During the first Cabinet Meeting of PM Modi’s second term, it was decided to extend the PM Kisan benefits to all farmers, removing the 5 acre limit that was present earlier. As of June 2024, Shri Modi released the 17thinstalment of the PM-KISAN scheme at Varanasi in which more than 9.2 crore farmers received the benefits amounting to over Rs.20,000 crore. Shri Modi has also focused path-breaking initiatives for agriculture ranging from Soil Health Cards, E-NAM for better markets and a renewed focus on irrigation. On 30th May 2019, PM Modi fulfilled a major promise by creating a new Jal Shakti Ministry to cater to all aspects relating to water resources. On 2nd October 2014, Mahatma Gandhi’s Birth Anniversary, the PM launched ‘Swachh Bharat Mission’ a mass movement for cleanliness across the nation. The scale and impact of the movement is historic. Today, sanitation coverage has risen from 38% in 2014 to 100% in 2019. All states and Union Territories have been declared open defecation free (ODF). Substantive measures been taken for a clean Ganga. The World Health Organisation has appreciated the Swachh Bharat Mission and has opined that it would save three lakh lives. Shri Modi believes that transportation is an important means towards transformation. That is why, the Government of India has been working to create next-generation infrastructure be it in terms of more highways, railways, i-ways and waterways. The UDAN (UdeDesh Ka Aam Nagrik) Scheme has made aviation sector more people-friendly and boosted connectivity. PM Modi launched the ‘Make in India’ initiative to turn India into an international manufacturing powerhouse. This effort has led to transformative results. India has made significant strides in ‘Ease of Doing Business’, improving its ranking from 142 in 2014 to 63 in 2019. The Government of India rolled out the GST during a historic session of Parliament in 2017, which has realised the dream of ‘One Nation, One Tax.’ During his tenure, special attention has been paid to India’s rich history and culture. India is home to the world’s largest statue, the State of Unity, a fitting tribute to Sardar Patel. This Statue was built through a special mass movement where tools of farmers and soil from all states and Union Territories of India were used, signifying the spirit of ‘Ek Bharat, Shreshtha Bharat.’ PM Modi is deeply passionate about environmental causes. He has time and again called for closing of ranks to create a clean and green planet. As Chief Minister of Gujarat, Shri Modi created a separate Climate Change Department to create innovative solutions to climate change. This spirit was seen in the 2015 COP21 Summit in Paris where PM Modi played a key role in the high-level deliberations. Going a step ahead of climate change, PM Modi has talked about climate justice. In 2018, Heads of State and Government from several nations came to India for the launch of the International Solar Alliance, an innovative effort to harness solar energy for a better planet. Recognising his efforts towards environmental conservation, PM Modi was honoured with the United Nations ‘Champions of the Earth Award.’ Fully sensitive to the fact that climate change has made our planet prone to natural disasters, Shri Modi has brought a new approach to disaster management, harnessing the power of technology and the strength of human resources. As Chief Minister, he transformed Gujarat that had just been ravaged by a devastating earthquake on 26th January 2001. Likewise, he introduced new systems to combat floods and droughts in Gujarat that were internationally lauded. Through administrative reforms, Shri Modi has always given priority to justice for citizens. In Gujarat, he spearheaded the start of evening courts to ensure people’s issues are resolved. At the Centre, he began PRAGATI ((Pro-Active Governance And Timely Implementation) to expedite pending projects that were delaying growth. Shri Modi’s foreign policy initiatives have realised the true potential and role of world’s largest democracy. He began his first term in office in presence of all Heads of States of SAARC Nations and invited BIMSTEC leaders at the start of the second. His address to the General Assembly of United Nations was appreciated across the world. Shri Modi became the first Indian Prime Minister to embark on a bilateral visit to Nepal after a long period of 17 years, to Australia after 28 years, to Fiji after 31 years and UAE as well as Seychelles after 34 years. Since taking over, Shri Modi attended UN, BRICS, SAARC and G-20 Summits, where India’s interventions and views on a variety of global economic and political issues were widely appreciated. PM Modi has been conferred various honours including the highest civilian honour of Saudi Arabia Sash of King Abdulaziz. Shri Modi has been also been conferred the top awards of Russia (The Order of the Holy Apostle Andrew the First), Palestine (Grand Collar of the State of Palestine), Afghanistan (Amir Amanullah Khan Award), UAE (Order of Zayed Award), Maldives (Rule of Nishan Izzuddeen), Bahrain (King Hamad Order of the Renaissance), Bhutan (Order of the Druk Gyalpo), Papua New Guinea (Grand Companion of the Order of Logohu), Fiji (Companion of the Order of Fiji), Egypt (Order of Nile), France (Grand Cross of the Legion of Honour), and Greece (The Grand Cross of the Order of Honour). In 2018, PM received the prestigious Seoul Peace Prize for his contribution to peace and development.He has also received the Global Goalkeeper’ Award by Bill and Melinda Gates Foundation, and Global Energy and Environment Leadership Award by Cambridge Energy Research Associates. Narendra Modi’s clarion call for marking a day as ‘International Day of Yoga’ received an overwhelming response at the UN. In a first, a total of 177 Nations across the world came together and passed the resolution to declare 21st June as the ‘International Day of Yoga at the UN.’ Shri Modi was born on 17 September, 1950, in a small town in Gujarat. His family belonged to the ‘other backward class’ which is among the marginalised sections of society. He grew up in a poor but loving family ‘without a spare rupee’. The initial hardships of life not only taught the value of hard work but also exposed him to the avoidable sufferings of the common people. This inspired him from a very young age to immerse himself in service of people and the nation. In his initial years, he worked with the Rashtriya Swayamsevak Sangh (RSS), a nationalist organisation devoted to nation building and later devoted himself in politics working with the Bharatiya Janata Party organization at National and State level. Shri Modi completed his MA in political science from Gujarat University. Narendra Modi is a ‘People’s Leader’, dedicated to solving their problems and improving their well-being. Nothing is more satisfying to him than being amongst the people, sharing their joys and alleviating their sorrows. His powerful ‘personal connect’ with the people on ground is complemented by a strong online presence. He is known as India’s most techno-savvy leader, using the web to reach people and bring about change in their lives. He is very active on social media platforms including YouTube, Facebook, Twitter, Instagram, Sound Cloud, Linkedin, and other forums. Beyond politics, Narendra Modi enjoys writing. He has authored several books, including poetry. He begins his day with Yoga, which strengthens his body and mind and instills the power of calmness in an otherwise fast-paced routine. http://www.narendramodi.in/categories/timeline http://www.narendramodi.in/humble-beginnings-the-early-years http://www.narendramodi.in/the-activist http://www.narendramodi.in/organiser-par-excellence-man-with-the-midas-touch",
  "Know the PM Shri Narendra Modi was sworn-in as India’s Prime Minister for the third time on 9th June 2024, following another decisive victory in the 2024 Parliamentary elections. This victory marked the third consecutive term for Shri Modi, further solidifying his leadership. The 2024 elections saw a remarkable voter turnout, with a significant portion of the electorate showing continued confidence in Shri Modi’s leadership and vision for the country. His campaign focused on a blend of economic development, national security, and social welfare programs, which resonated widely with the populace. Shri Modi’s third term is expected to build on the foundations laid during his previous tenures, with a renewed emphasis on technological innovation, infrastructure development, and international diplomacy, further positioning India as a global powerhouse. The unprecedented third term underscores Shri Modi’s enduring appeal and the trust placed in him by millions of Indians to lead the nation towards greater prosperity and stability. The first ever Prime Minister to be born after Independence, Shri Modi has previously served as the Prime Minister of India from 2014 to 2019, and from 2019 to 2024. He also has the distinction of being the longest serving Chief Minister of Gujarat with his term spanning from October 2001 to May 2014. In the 2014 and 2019 Parliamentary elections, Shri Modi led the Bharatiya Janata Party to record wins, securing absolute majority on both occasions. The last time that a political party secured such an absolute majority was in the elections of 1984. Inspired by the motto of ‘SabkaSaath, Sabka Vikas, Sabka Vishwas’, Shri Modi has ushered in a paradigm shift in governance that has led to inclusive, development-oriented and corruption-free governance. The Prime Minister has worked with speed and scale to realise the aim of Antyodaya, or ensuring last-mile delivery of schemes and services. Leading international agencies have noted that under the leadership of PM Narendra Modi, India has been eliminating poverty at record pace. According to the findings from NITI Aayog’s latest report ‘Multidimensional Poverty in India since 2005-06’, almost 25 crore people escaped multidimensional poverty in last nine years. The credit for this remarkable achievement goes to significant initiatives of the government to address all dimensions of poverty. Today, India is home to the world’s largest healthcare programme, Ayushman Bharat. Covering over 50 crore Indians, Ayushman Bharat provides top quality and affordable healthcare to the poor and neo-middle class. The Lancet, considered among the most prestigious health journals in the world has lauded Ayushman Bharat, stating that this scheme attends to the larger discontent about the health sector in India. The journal also noted PM Modi’s efforts to prioritise universal health coverage. Understanding that financial exclusion was a bane for the poor, the Prime Minister launched the Pradhan Mantri Jan Dhan Yojana, that aimed at opening bank accounts for every Indian. Now, over 51 crore Jan Dhan accounts have been opened. These accounts have not only banked the unbanked but also opened the doors for other avenues of empowerment. Going a step ahead of Jan Dhan, Shri Modi emphasised on Jan Suraksha, by giving insurance and pension cover to the most vulnerable sections of society. The JAM trinity (Jan Dhan- Aadhaar- Mobile) has led to elimination of middle men and ensured transparency and speed, powered by technology. The Pradhan Mantri Ujjwala Yojana, launched in 2016 provides free cooking gas connections to the poor. It has proven to be a major game-changer in providing smoke-free kitchens to over 10 crore beneficiaries, most of whom are women. 18,000 villages that were without electricity even after 70 long years of Independence have been electrified. Shri Modi believes that no Indian should be homeless and to realise this vision, over 4.2 crore houses were sanctionedunder the PM Awas Yojana between 2014 and 2024. In June 2024, after assuming office for the third term, one of the first decisions of the Cabinet was to assist 3 crore additional rural and urban households for the construction of houses, underscoring Shri Narendra Modi’s commitment to addressing the nation’s housing needs and ensuring dignity and a quality life for every citizen. Agriculture is a sector that is very close to Shri Narendra Modi. During the interim budget of 2019, the Government announced a monetary incentive for farmers called the PM Kisan Samman Nidhi. In almost three weeks, on 24th February 2019, the scheme was launched and instalments have been paid regularly since then. During the first Cabinet Meeting of PM Modi’s second term, it was decided to extend the PM Kisan benefits to all farmers, removing the 5 acre limit that was present earlier. As of June 2024, Shri Modi released the 17thinstalment of the PM-KISAN scheme at Varanasi in which more than 9.2 crore farmers received the benefits amounting to over Rs.20,000 crore. Shri Modi has also focused path-breaking initiatives for agriculture ranging from Soil Health Cards, E-NAM for better markets and a renewed focus on irrigation. On 30th May 2019, PM Modi fulfilled a major promise by creating a new Jal Shakti Ministry to cater to all aspects relating to water resources. On 2nd October 2014, Mahatma Gandhi’s Birth Anniversary, the PM launched ‘Swachh Bharat Mission’ a mass movement for cleanliness across the nation. The scale and impact of the movement is historic. Today, sanitation coverage has risen from 38% in 2014 to 100% in 2019. All states and Union Territories have been declared open defecation free (ODF). Substantive measures been taken for a clean Ganga. The World Health Organisation has appreciated the Swachh Bharat Mission and has opined that it would save three lakh lives. Shri Modi believes that transportation is an important means towards transformation. That is why, the Government of India has been working to create next-generation infrastructure be it in terms of more highways, railways, i-ways and waterways. The UDAN (UdeDesh Ka Aam Nagrik) Scheme has made aviation sector more people-friendly and boosted connectivity. PM Modi launched the ‘Make in India’ initiative to turn India into an international manufacturing powerhouse. This effort has led to transformative results. India has made significant strides in ‘Ease of Doing Business’, improving its ranking from 142 in 2014 to 63 in 2019. The Government of India rolled out the GST during a historic session of Parliament in 2017, which has realised the dream of ‘One Nation, One Tax.’ During his tenure, special attention has been paid to India’s rich history and culture. India is home to the world’s largest statue, the State of Unity, a fitting tribute to Sardar Patel. This Statue was built through a special mass movement where tools of farmers and soil from all states and Union Territories of India were used, signifying the spirit of ‘Ek Bharat, Shreshtha Bharat.’ PM Modi is deeply passionate about environmental causes. He has time and again called for closing of ranks to create a clean and green planet. As Chief Minister of Gujarat, Shri Modi created a separate Climate Change Department to create innovative solutions to climate change. This spirit was seen in the 2015 COP21 Summit in Paris where PM Modi played a key role in the high-level deliberations. Going a step ahead of climate change, PM Modi has talked about climate justice. In 2018, Heads of State and Government from several nations came to India for the launch of the International Solar Alliance, an innovative effort to harness solar energy for a better planet. Recognising his efforts towards environmental conservation, PM Modi was honoured with the United Nations ‘Champions of the Earth Award.’ Fully sensitive to the fact that climate change has made our planet prone to natural disasters, Shri Modi has brought a new approach to disaster management, harnessing the power of technology and the strength of human resources. As Chief Minister, he transformed Gujarat that had just been ravaged by a devastating earthquake on 26th January 2001. Likewise, he introduced new systems to combat floods and droughts in Gujarat that were internationally lauded. Through administrative reforms, Shri Modi has always given priority to justice for citizens. In Gujarat, he spearheaded the start of evening courts to ensure people’s issues are resolved. At the Centre, he began PRAGATI ((Pro-Active Governance And Timely Implementation) to expedite pending projects that were delaying growth. Shri Modi’s foreign policy initiatives have realised the true potential and role of world’s largest democracy. He began his first term in office in presence of all Heads of States of SAARC Nations and invited BIMSTEC leaders at the start of the second. His address to the General Assembly of United Nations was appreciated across the world. Shri Modi became the first Indian Prime Minister to embark on a bilateral visit to Nepal after a long period of 17 years, to Australia after 28 years, to Fiji after 31 years and UAE as well as Seychelles after 34 years. Since taking over, Shri Modi attended UN, BRICS, SAARC and G-20 Summits, where India’s interventions and views on a variety of global economic and political issues were widely appreciated. PM Modi has been conferred various honours including the highest civilian honour of Saudi Arabia Sash of King Abdulaziz. Shri Modi has been also been conferred the top awards of Russia (The Order of the Holy Apostle Andrew the First), Palestine (Grand Collar of the State of Palestine), Afghanistan (Amir Amanullah Khan Award), UAE (Order of Zayed Award), Maldives (Rule of Nishan Izzuddeen), Bahrain (King Hamad Order of the Renaissance), Bhutan (Order of the Druk Gyalpo), Papua New Guinea (Grand Companion of the Order of Logohu), Fiji (Companion of the Order of Fiji), Egypt (Order of Nile), France (Grand Cross of the Legion of Honour), and Greece (The Grand Cross of the Order of Honour). In 2018, PM received the prestigious Seoul Peace Prize for his contribution to peace and development.He has also received the Global Goalkeeper’ Award by Bill and Melinda Gates Foundation, and Global Energy and Environment Leadership Award by Cambridge Energy Research Associates. Narendra Modi’s clarion call for marking a day as ‘International Day of Yoga’ received an overwhelming response at the UN. In a first, a total of 177 Nations across the world came together and passed the resolution to declare 21st June as the ‘International Day of Yoga at the UN.’ Shri Modi was born on 17 September, 1950, in a small town in Gujarat. His family belonged to the ‘other backward class’ which is among the marginalised sections of society. He grew up in a poor but loving family ‘without a spare rupee’. The initial hardships of life not only taught the value of hard work but also exposed him to the avoidable sufferings of the common people. This inspired him from a very young age to immerse himself in service of people and the nation. In his initial years, he worked with the Rashtriya Swayamsevak Sangh (RSS), a nationalist organisation devoted to nation building and later devoted himself in politics working with the Bharatiya Janata Party organization at National and State level. Shri Modi completed his MA in political science from Gujarat University. Narendra Modi is a ‘People’s Leader’, dedicated to solving their problems and improving their well-being. Nothing is more satisfying to him than being amongst the people, sharing their joys and alleviating their sorrows. His powerful ‘personal connect’ with the people on ground is complemented by a strong online presence. He is known as India’s most techno-savvy leader, using the web to reach people and bring about change in their lives. He is very active on social media platforms including YouTube, Facebook, Twitter, Instagram, Sound Cloud, Linkedin, and other forums. Beyond politics, Narendra Modi enjoys writing. He has authored several books, including poetry. He begins his day with Yoga, which strengthens his body and mind and instills the power of calmness in an otherwise fast-paced routine. http://www.narendramodi.in/categories/timeline http://www.narendramodi.in/humble-beginnings-the-early-years http://www.narendramodi.in/the-activist http://www.narendramodi.in/organiser-par-excellence-man-with-the-midas-touch",
  "Shri Narendra Modi was sworn-in as India’s Prime Minister for the third time on 9th June 2024, following another decisive victory in the 2024 Parliamentary elections. This victory marked the third consecutive term for Shri Modi, further solidifying his leadership. The 2024 elections saw a remarkable voter turnout, with a significant portion of the electorate showing continued confidence in Shri Modi’s leadership and vision for the country. His campaign focused on a blend of economic development, national security, and social welfare programs, which resonated widely with the populace. Shri Modi's third term is expected to build on the foundations laid during his ...",
  "PM's Profile Shri Narendra Modi was sworn-in as India’s Prime Minister for the third time on 9th June 2024, following another decisive victory in the 2024 Parliamentary elections. This victory marked the third consecutive term for Shri Modi, further solidifying his leadership. The 2024 elections saw a remarkable voter turnout, with a significant portion of the electorate showing continued confidence in Shri Modi’s leadership and vision for the country. His campaign focused on a blend of economic development, national security, and social welfare programs, which resonated widely with the populace. Shri Modi's third term is expected to build on the foundations laid during his ... View More",
  "Shri Narendra Modi was sworn-in as India’s Prime Minister for the third time on 9th June 2024, following another decisive victory in the 2024 Parliamentary elections. This victory marked the third consecutive term for Shri Modi, further solidifying his leadership. The 2024 elections saw a remarkable voter turnout, with a significant portion of the electorate showing continued confidence in Shri Modi’s leadership and vision for the country. His campaign focused on a blend of economic development, national security, and social welfare programs, which resonated widely with the populace. Shri Modi's third term is expected to build on the foundations laid during his ...",
  "PM's Profile Shri Narendra Modi was sworn-in as India’s Prime Minister for the third time on 9th June 2024, following another decisive victory in the 2024 Parliamentary elections. This victory marked the third consecutive term for Shri Modi, further solidifying his leadership. The 2024 elections saw a remarkable voter turnout, with a significant portion of the electorate showing continued confidence in Shri Modi’s leadership and vision for the country. His campaign focused on a blend of economic development, national security, and social welfare programs, which resonated widely with the populace. Shri Modi's third term is expected to build on the foundations laid during his ... View More",
  "Shri Narendra Modi was sworn-in as India’s Prime Minister for the third time on 9th June 2024, following another decisive victory in the 2024 Parliamentary elections. This victory marked the third consecutive term for Shri Modi, further solidifying his leadership. The 2024 elections saw a remarkable voter turnout, with a significant portion of the electorate showing continued confidence in Shri Modi’s leadership and vision for the country. His campaign focused on a blend of economic development, national security, and social welfare programs, which resonated widely with the populace. Shri Modi's third term is expected to build on the foundations laid during his ...",
  "PM's Profile Shri Narendra Modi was sworn-in as India’s Prime Minister for the third time on 9th June 2024, following another decisive victory in the 2024 Parliamentary elections. This victory marked the third consecutive term for Shri Modi, further solidifying his leadership. The 2024 elections saw a remarkable voter turnout, with a significant portion of the electorate showing continued confidence in Shri Modi’s leadership and vision for the country. His campaign focused on a blend of economic development, national security, and social welfare programs, which resonated widely with the populace. Shri Modi's third term is expected to build on the foundations laid during his ... View More",
  "The Prime Minister, Shri Narendra Modi today lauded India’s young innovators for their pivotal role in advancing technology and driving the nation’s self-reliance.",
  "Prime Minister Shri Narendra Modi marked a significant milestone in India's growth journey, celebrating 11 Years of Infrastructure Revolution, a decade-plus of transformative infrastructure development that has propelled the nation forward.",
  "Prime Minister Shri Narendra Modi met the members of various delegations who represented India in different countries at his official residence in New Delhi today.",
  "PM hails India’s Youth-Led Tech Innovation as Nation Strengthens Self-Reliance 12 Jun, 2025 The Prime Minister, Shri Narendra Modi today lauded India’s young innovators for their pivotal role in advancing technology and driving the nation’s self-reliance.",
  "PM highlights 11 Years of Infrastructure Revolution in India 11 Jun, 2025 Prime Minister Shri Narendra Modi marked a significant milestone in India's growth journey, celebrating 11 Years of Infrastructure Revolution, a decade-plus of transformative infrastructure development that has propelled the nation forward.",
  "PM meets members of various delegations who represented India in various countries 10 Jun, 2025 Prime Minister Shri Narendra Modi met the members of various delegations who represented India in different countries at his official residence in New Delhi today.",
  "PM condoles the passing of former Gujarat Chief Minister Shri Vijay Rupani 13 Jun, 2025 Prime Minister Shri Narendra Modi today condoled the passing of former Gujarat Chief Minister Shri Vijay Rupani, who tragically lost his life in the recent Ahmedabad air disaster. PM meets injured in the aftermath of tragic plane crash in Ahmedabad 13 Jun, 2025 Prime Minister Shri Narendra Modi visited Ahmedabad today in the wake of the tragic plane crash that claimed numerous lives. PM condoles the loss of lives in Ahmedabad Air Tragedy 13 Jun, 2025 Prime Minister Shri Narendra Modi today condoled the loss of numerous lives in the tragic air accident in Ahmedabad. PM expresses grief over Ahmedabad tragedy, assures swift and effective assistance 12 Jun, 2025 The Prime Minister Shri Narendra Modi has expressed profound grief and shock over the tragic incident in Ahmedabad today. He stated that the tragedy has stunned and saddened the nation and described it as heartbreaking beyond words. PM hails India’s Youth-Led Tech Innovation as Nation Strengthens Self-Reliance 12 Jun, 2025 The Prime Minister, Shri Narendra Modi today lauded India’s young innovators for their pivotal role in advancing technology and driving the nation’s self-reliance. PM reaffirms commitment to Welfare-driven development 11 Jun, 2025 The Prime Minister Shri Narendra Modi today reaffirmed the Government’s unwavering dedication to welfare-driven development, ensuring that various pro-people schemes reach maximum number of citizens. PM shares an article highlighting 11 Years of Inclusive Growth and National Empowerment 11 Jun, 2025 The Prime Minister Shri Narendra Modi today shared an article emphasizing the transformative impact of 11 years of inclusive growth, a journey that has empowered, uplifted, and propelled the nation forward in remarkable ways. PM pays tribute to Sant Kabir Das on his birth anniversary 11 Jun, 2025 Prime Minister Shri Narendra Modi paid heartfelt tributes to Sant Kabir Das on his birth anniversary today, acknowledging his lifelong dedication to social harmony and reform. PM highlights 11 Years of Infrastructure Revolution in India 11 Jun, 2025 Prime Minister Shri Narendra Modi marked a significant milestone in India's growth journey, celebrating 11 Years of Infrastructure Revolution, a decade-plus of transformative infrastructure development that has propelled the nation forward. PM meets members of various delegations who represented India in various countries 10 Jun, 2025 Prime Minister Shri Narendra Modi met the members of various delegations who represented India in different countries at his official residence in New Delhi today. Loading...",
  "List of all Prime Ministers of India: Did you know that Jawaharlal Nehru, India’s first Prime Minister, served for 17 years, the longest by any PM? The Prime Minister of India is the head of the government and plays a key role in running the country.",
  "They are in charge of forming the cabinet, making important decisions, and representing India in the world. The Prime Minister leads the country’s policies and ensures that the government works smoothly.",
  "Currently, Narendra Modi is the Prime Minister of India, having been in office since 2014. He is the 14th Prime Minister of India who had three consecutive terms on the post. He took the Prime Minister's Oath on June 9, 2024.",
  "This article provides a complete list of all the Prime Ministers of India from 1947 to 2025, along with their contributions to the country’s growth. The list reflects India's democratic resilience and its leaders' varied contributions to the nation's progress.",
  "Manmohan Singh, India's 13th Prime Minister, was born on September 26, 1932, in Gah, Punjab (now in Pakistan). He was a distinguished economist and statesman.",
  "India has been governed by 14 prime ministers over the years. Currently, Narendra Modi is serving his third term as Prime Minister in 2024, continuing his leadership journey that started in 2014.",
  "In India, there is no constitutionally mandated retirement age for the Prime Minister. The Indian Constitution does not specify a maximum age limit for holding the office of Prime Minister. Instead, the tenure and eligibility criteria are governed by constitutional provisions and parliamentary procedures.",
  "Throughout India's history, several Prime Ministers have served well beyond the age of 70, including:",
  "What's Next| At What Age Does India’s Prime Minister Retire? Key Details and Facts Here",
  "Check the list of all Prime Ministers of India from 1947 to 2025, including their terms, ages, and durations. Learn about the role of the Prime Minister, their powers, and responsibilities. Get insights into India's democratic history and the leaders who shaped the nation's progress",
  "Dr. Manmohan Singh: Former Prime Minister of India Passed Away At 92",
  "List of all the Prime Ministers of India: Important Points",
  "List of all the Prime Ministers of India: Important Facts",
  "What is the Retirement Age of Prime Minister in India?",
  "Significance: Former Prime Minister of India (2004-2014), celebrated economist, and architect of India's economic liberalisation.",
  "Article 75 of the Indian Constitution envisages that there will be a Prime Minister who shall be appointed by the President of India.",
  "Article 78 of the Indian Constitution specifies the duties of the Prime Minister of India. He acts as a link between the President and Cabinet while discharging his duties.",
  "The Prime Minister of India determines the dates of its meetings and programmes for the Parliament session. He also decides when the House has to be prorogued or dissolved.",
  "Jawaharlal Nehru is recognised as the architect of modern India. He was the first Prime Minister of India and holds the record for the longest tenure, with 16 years and 286 days in office.",
  "Who served for the shortest tenure as the Prime Minister of India? +Atal Bihari Vajpayee served for the shortest tenure as the Prime Minister of India.",
  "Who is the current Prime Minister of India? +Narendra Modi is the current Prime Minister of India.",
  "Who is the longest-serving Prime Minister of India?+Pt. Jawaharlal Nehru is the longest-serving Prime Minister of India. He served from 15 August 1947 to 27 May 1964.",
  "Who was the first female Prime Minister of India? +Indira Gandhi was the first and only female Prime Minister of India.",
  "Who was the first Prime Minister of India?+Pt. Jawaharlal Nehru was the first Prime Minister of India.",
  "is there a strawberry moon tonight",
  "Atal Bihari Vajpayee served for the shortest tenure as the Prime Minister of India.",
  "Atal Bihari Vajpayee served for the shortest tenure as the Prime Minister of India.",
  "Narendra Modi is the current Prime Minister of India.",
  "Narendra Modi is the current Prime Minister of India.",
  "Indira Gandhi was the first and only female Prime Minister of India.",
  "Indira Gandhi was the first and only female Prime Minister of India.",
  "Pt. Jawaharlal Nehru was the first Prime Minister of India.",
  "Pt. Jawaharlal Nehru was the first Prime Minister of India.",
  "Is the hall ticket required to check the Board results?+Yes, when checking the board exam results students are required to enter the hall ticket/ registration number which is mentioned on the board exam admit card.",
  "is there a strawberry moon tonight",
  "is there a strawberry moon tonight",
  "is there a strawberry moon tonight",
  "is there a strawberry moon tonight",
  "The prime minister of India (ISO: Bhārata kē Pradhānamantrī) is the head of government[2] of the Republic of India. Executive authority is vested in the prime minister and his chosen Council of Ministers,[3][4][5] despite the president of India being the nominal head of the executive.[6][7][8][9] The prime minister has to be a member of one of the houses of bicameral Parliament of India, alongside heading the respective house.[10] The prime minister and the cabinet are at all times responsible to the Lok Sabha.[11][12]",
  "The prime minister is appointed by the president of India; however, the prime minister has to enjoy the confidence of the majority of Lok Sabha members, who are directly elected every five years, lest the prime minister shall resign. The prime minister can be a member of the Lok Sabha or the Rajya Sabha, the upper house of the parliament. The prime minister controls the selection and dismissal of members of the Union Council of Ministers; and allocation of posts to members within the government.",
  "The longest-serving prime minister was Jawaharlal Nehru, also the first prime minister, whose tenure lasted 16 years and 286 days. His premiership was followed by Lal Bahadur Shastri's short tenure and Indira Gandhi's 11- and 4-year-long tenures, both politicians belonging to the Indian National Congress. After Indira Gandhi's assassination, her son Rajiv Gandhi took charge until 1989, when a decade with five unstable governments began. This was followed by the full terms of P. V. Narasimha Rao, Atal Bihari Vajpayee, Manmohan Singh, and Narendra Modi. Modi is the current prime minister of India, serving since 26 May 2014 and the first to win three consecutive elections to secure a third successive term, 2014, 2019, 2024.",
  "India follows a parliamentary system in which the prime minister is the presiding head of the government and chief of the executive of the government. In such systems, the head of state, or, the head of state's official representative (i.e., the monarch, president, or governor-general) usually holds a purely ceremonial position and acts—on most matters—only on the advice of the prime minister.",
  "Since 1947, there have been 14 different prime ministers.[a] The first few decades after 1947 saw the Indian National Congress' (INC) near complete domination over the political map of India. India's first prime minister—Jawaharlal Nehru—took oath on 15 August 1947. Nehru went on to serve as prime minister for 17 consecutive years, winning four general elections in the process. His tenure ended in May 1964, on his death.[13][14] After the death of Nehru, Lal Bahadur Shastri—a former home minister and a leader of the Congress party—ascended to the position of prime minister. Shastri's tenure saw the Indo-Pakistani War of 1965. Shashtri subsequently died of a reported heart attack in Tashkent, after signing the Tashkent Declaration.[15]",
  "After Shastri, Indira Gandhi—Nehru's daughter—was elected as the country's third prime minister. The first—and to date, the only—woman to hold the post, Indira's first term in office lasted 11 years, in which she took steps such as nationalisation of banks;[16] end of allowances and political posts, which were received by members of the royal families of the erstwhile princely states of the British Indian Empire.[17][18] In addition, events such as the Indo-Pakistani War of 1971;[19] the establishment of a sovereign Bangladesh;[20] accession of Sikkim to India, through a referendum in 1975;[21] and India's first nuclear test in Pokhran occurred during Indira's first term. In 1975, amid growing unrest and a court order declaring Indira's election to the Lok Sabha void, President Fakhruddin Ali Ahmed—on Indira's advice—imposed a state of emergency, therefore bestowing the government with the power to rule by decree; this period is known for human rights violations such as mass sterilisation and the imprisonment of Indira's political opponents.[22][23]",
  "After widespread protests, the emergency was lifted in 1977, and a general election was held. All of the political parties of the opposition—after the conclusion of the emergency—fought together against the Congress, under the umbrella of the Janata Party, in the general election of 1977, and were successful in defeating the Congress. Subsequently, Morarji Desai—a former deputy prime minister—became the first non-Congress prime minister of India. Desai's government was composed of groups with opposite ideologies, in which unity and coordination were difficult to maintain. Ultimately, after two and a half years as PM; on 28 July 1979, Desai tendered his resignation to the president; and his government fell. Thereafter, Charan Singh—a deputy prime minister in Desai's cabinet—with outside, conditional support from Congress, proved a majority in Lok Sabha and took oath as Prime Minister.[24][25] However, Congress pulled its support shortly after, and Singh had to resign; he had a tenure of 5 months, the shortest in the history of the office.",
  "After Indira, Rajiv—her eldest son and 40 years old at the time—was sworn in on the evening of 31 October 1984, becoming the youngest person ever to hold the office of prime minister. Rajiv immediately called for a general election. In the subsequent general election, the Congress secured a supermajority, winning 401 of 552 seats in the Lok Sabha, the maximum number received by any party in the history of India.[29][30] Vishwanath Pratap Singh—first finance minister and then later defence minister in Gandhi's cabinet—uncovered irregularities, in what became known as the Bofors scandal, during his stint at the Ministry of Defence; Singh was subsequently expelled from Congress and formed the Janata Dal and—with the help of several anti-Congress parties—also formed the National Front, a coalition of many political parties.[31]",
  "Rajiv Gandhi was assassinated on the campaign trail for the general election of 1991, and the Congress—under the leadership of P. V. Narasimha Rao—rode a sympathy wave to form a minority government; Rao became the first PM of South Indian origin.[39] After the dissolution of the Soviet Union, India was on the brink of bankruptcy, so, Rao took steps to liberalise the economy, and appointed Manmohan Singh—an economist and a former governor of the Reserve Bank of India—as finance minister.[39] Rao and Singh then took various steps to liberalise the economy,[39] these resulted in unprecedented economic growth in India.[40] His premiership, however, was also a witness to the demolition of the Babri Masjid, which resulted in the death of about 2,000 people.[41] Rao, however, did complete five continuous years in office, becoming the first prime minister outside of the Nehru—Gandhi family to do so.[39]",
  "After the end of Rao's tenure in May 1996, the nation saw four prime ministers in a span of three years, viz., two tenures of Atal Bihari Vajpayee; one tenure of H. D. Deve Gowda from 1 June 1996 to 21 April 1997; and one tenure of I. K. Gujral from 21 April 1997 to 19 March 1998. The government of Prime Minister Vajpayee—elected in 1998—took some concrete steps; in May 1998—after a month in power—the government announced the conduct of five underground nuclear explosions in Pokhran.[42] In response to these tests, many western countries, including the United States, imposed economic sanctions on India,[43] but, due to the support received from Russia, France, the Gulf countries and some other nations, the sanctions—were largely—not considered successful.[44][45] A few months later in response to the Indian nuclear tests, Pakistan also conducted nuclear tests.[46] Given the deteriorating situation between the two countries, the governments tried to improve bilateral relations. In February 1999, India and Pakistan signed the Lahore Declaration, in which the two countries announced their intention to annul mutual enmity, increase trade and use their nuclear capabilities for peaceful purposes.[47]",
  "In the 2004 election, the Congress emerged as the largest party in a hung parliament; Congress-led United Progressive Alliance (UPA)—with outside support from the Left Front, the Samajwadi Party (SP) and Bahujan Samaj Party (BSP) among others—proved a majority in the Lok Sabha,[54] and Manmohan Singh was elected prime minister; becoming the first Sikh prime minister of the nation.[54] During his tenure, the country retained the economic momentum gained during Prime Minister Vajpayee's tenure.[55] Apart from this, the government succeeded in getting the National Rural Employment Guarantee Act, 2005, and the Right to Information Act, 2005 passed in the parliament.[56][57] Further, the government strengthened India's relations with nations like Afghanistan;[58][59] Russia;[60] the Gulf states; and the United States, culminating with the ratification of India–United States Civil Nuclear Agreement near the end of Singh's first term.[61][62][63] At the same time, the November 2008 Mumbai terrorist attacks also happened during Singh's first term in office.[64][65] In the general election of 2009, the mandate of UPA increased.[66][67] Prime Minister Singh's second term, however, was surrounded by accusations of high-level scandals and corruption.[68][69] Singh resigned as prime minister on 17 May 2014, after Congress' defeat in the 2014 general election.[70][71][72]",
  "In the general election of 2014, the BJP-led NDA got an absolute majority, winning 336 out of 543 Lok Sabha seats; the BJP itself became the first party since 1984 to get a majority in the Lok Sabha. Narendra Modi—the Chief Minister of Gujarat—was elected prime minister, becoming the first prime minister to have been born in an independent India.[73]",
  "The Constitution envisions a scheme of affairs in which the president of India is the head of state; in terms of Article 53 with office of the prime minister being the head of Council of Ministers to assist and advise the president in the discharge of their constitutional functions. To quote, Article 53, 74 and 75 provide as under:",
  "Like most parliamentary democracies, the president's duties are mostly ceremonial as long as the constitution and the rule of law is obeyed by the cabinet and the legislature. The prime minister of India is the head of government and has the responsibility for executive power. The president's constitutional duty is to preserve, protect and defend the Constitution and the law per article 60. In the constitution of India, the prime minister is mentioned in only four of its articles (articles 74, 75, 78 and 366). The prime minister plays a crucial role in the government of India by enjoying majority in the Lok Sabha.",
  "According to Article 84 of the Constitution of India, which sets the principle qualification for member of Parliament, and Article 75 of the Constitution of India, which sets the qualifications for the minister in the Union Council of Ministers, and the argument that the position of prime minister has been described as primus inter pares (the first among equals),[75] A prime minister must:",
  "The prime minister is required to make and subscribe in the presence of the President of India before entering office, the oath of office and secrecy, as per the Third Schedule of the Constitution of India.",
  "I, <name>, do swear in the name of God/solemnly affirm that I will bear true faith and allegiance to the Constitution of India as by law established, that I will uphold the sovereignty and integrity of India, that I will faithfully and conscientiously discharge my duties as Prime Minister for the Union and that I will do right to all manner of people in accordance with the Constitution and the law, without fear or favour, affection or ill-will.",
  "The prime minister serves at 'the pleasure of the president', hence, a prime minister may remain in office indefinitely, so long as the president has confidence in him/her. However, a prime minister must have the confidence of Lok Sabha, the lower house of the Parliament of India.",
  "The prime minister leads the functioning and exercise of authority of the government of India. The president of India—subject to eligibility—invites a person who is commanding support of majority members of Lok Sabha to form the government of India—also known as the central government or Union government—at the national level and exercise its powers.[78] In practice the prime minister nominates the members of their council of ministers to the president.[79][80][81] He also works upon to decide a core group of ministers (known as the cabinet),[79] as in charge of the important functions and ministries of the government of India.",
  "The prime minister is responsible for aiding and advising the president in distribution of work of the government to various ministries and offices and in terms of the Government of India (Allocation of Business) Rules, 1961.[82] The co-ordinating work is generally allocated to the Cabinet Secretariat.[83] While the work of the government is generally divided into various ministries, the prime minister may retain certain portfolios if he is not allocated to any member of the cabinet.",
  "The prime minister—in consultation with the cabinet—schedules and attends the sessions of the houses of parliament and is required to answer the question from the Members of Parliament to them as the in-charge of the portfolios in the capacity as prime minister of India.[84]",
  "Per Article 78 of the Constitution of India, the union cabinet and the president officially communicate through the prime minister. Otherwise, the Constitution recognises the prime minister as a member of the union cabinet only outside the sphere of union cabinet.",
  "Unlike most other countries, the prime minister does not have much influence over the selection of judges, that is done by a collegium of judges consisting of the Chief Justice of India, four senior most judges of the Supreme Court of India and the chief justice—or the senior-most judge—of the concerned state high court.[97][98] The executive as a whole, however, has the right to send back a recommended name to the collegium for reconsideration,[99] this, however, is not a full Veto power, and the collegium can still put forward rejected name.[100][101]",
  "Article 75 of the Constitution of India confers the Parliament with the power to decide the remuneration and other benefits of the prime minister and other ministers are to be decided by the Parliament.[104] and is renewed from time to time. The original remunerations for the prime minister and other ministers were specified in the Part B of the second schedule of the constitution, which was later removed by an amendment.",
  "The 7, Lok Kalyan Marg—previously called 7, Race Course Road—in New Delhi, currently serves as the official place of residence for the prime minister of India.[108]",
  "For air travel, Boeing 777-300ERs designated by the call sign Air India One (AI-1 or AIC001) and maintained by the Indian Air Force are used.[111][112] There are several helicopters, such as Mi-8, used for carrying the prime minister over short distances. These aircraft are operated by the Indian Air Force.",
  "The Prime Minister's Office (PMO) acts as the principal workplace of the prime minister. The office is located at South Block, and is a 20-room complex, and has the Cabinet Secretariat, the Ministry of Defence and the Ministry of External Affairs adjacent to it. The office is headed by the Principal Secretary to the Prime Minister of India, generally a former civil servant, mostly from the Indian Administrative Service (IAS) and rarely from the Indian Foreign Service (IFS).",
  "Several institutions are named after prime ministers of India. The birth date of Jawaharlal Nehru is celebrated as children's day while the birth date of Charan Singh is celebrated as farmer's day in India. Prime ministers are also commemorated on the postage stamps of several countries.",
  "The post of deputy prime minister of India is not technically a constitutional post, nor is there any mention of it in an Act of Parliament.[131] But historically, on various occasions, different governments have assigned one of their senior ministers as the deputy prime minister. There is neither constitutional requirement for filling the post of deputy PM, nor does the post provide any kind of special powers.[131] Typically, senior cabinet ministers like the finance minister or the home minister are appointed as deputy prime minister. The post is considered to be the senior most in the cabinet after the prime minister and represents the government in their absence. Generally, deputy prime ministers have been appointed to strengthen the coalition governments.",
  "Prime Minister Administrative Structure of India",
  "4 Role and power of the prime minister Toggle Role and power of the prime minister subsection 4.1 Prime Minister Administrative Structure of India 4.2 Executive powers 4.2.1 Administrative and appointment powers 4.3 Legislative powers",
  "4.1 Prime Minister Administrative Structure of India",
  "List of prime ministers of India",
  "Deputy Prime Minister of India",
  "^ Majeed, Akhtar (2005), \"Republic of India\", in Kincaid, John; Tarr, G. Alan (eds.), Constitutional Origins, Structure, and Change in Federal Countries, A Global Dialogue on Federalism, Volume I, Montreal & Kingston: McGill-Queen's University Press for Forum of Federation and International Association of Centers for Federal Studies, pp. 180–207, 185, ISBN 0-7735-2849-0, ...the executive authority is vested in the prime minister and in his Council of Ministers. (p. 185)",
  "^ Britannica, Eds. Encycl. (20 February 2020), \"List of prime ministers of India\", Encyclopaedia Britannica, Encyclopædia Britannica, Inc., retrieved 2 April 2022, Effective executive power rests with the Council of Ministers, headed by the prime minister",
  "^ \"National Defence Fund\". Prime Minister of India, Government of India. Retrieved 10 April 2018.",
  "^ \"PM National Relief Fund\". Prime Minister of India, Government of India. Retrieved 10 April 2018.",
  "Union government Union Council of Ministers Prime Minister (list) Deputy Prime Minister Civil services All India Services Central Civil Services Cabinet Secretary Secretaries Defence Finance Foreign Home) Attorney General Solicitor General"
]