{
  "url": "https://en.wikipedia.org/wiki/Anna_Chandy",
  "title": "Anna Chandy",
  "paragraph_count": 5,
  "paragraphs": [
    "Justice Anna Chandy (1905–1996), also known as Anna Chandi , was the first female judge (1937) and then High Court judge (1959) in India. She was one of the first female judges in the British Empire .",
    "Anna Chandy was born in 1905, in the erstwhile kingdom of Travancore and raised in Trivandrum . She was an Anglican Syrian Christian who embraced Catholicism , in later life. After obtaining a post-graduate degree from Government Law College, Thiruvananthapuram in 1926, she became the first woman in her state to get a law degree. She was called to the bar and practiced as a barrister from 1929 onwards. In 1931–32, she contested elections to the legislative assembly of Travancore princely state and was elected; she served as a legislator during the period 1932–34.",
    "In 1937, Chandy was appointed as a munsif in Travancore by the Maharaja upon the advice of his Dewan (First Minister), Sir C.P. Ramaswami Iyer . This made Chandy the first female judge in India. In 1948, she was raised to the position of District Judge . She became the first female judge in an Indian high court when she was appointed to the Kerala High Court on 9 February 1959. She remained in that office until her retirement on 5 April 1967. In her retirement, Chandy served on the Law Commission of India and also wrote an autobiography titled Atmakatha (1973). She died   in 1996.",
    "Throughout her career as a lawyer, politician, and judge, Chandy simultaneously promoted the cause of women's rights, most notably through, a woman's magazine that she founded and edited. Often described as a \"first generation feminist\", Chandy campaigned for election to the Shree Mulam Popular Assembly in 1931. She met with hostility from both her competition and newspapers but was elected for the period 1932–34.",
    "((1. https://web.archive.org/web/20120304222528/http://keralawomen.gov.in/view_page.php?type=11&id=262 ))"
  ],
  "scraped_at": "2025-06-11 06:36:14 UTC"
}