{
  "url": "https://en.wikipedia.org/wiki/Dhirubhai_Ambani",
  "title": "Dhirubhai Ambani",
  "paragraph_count": 15,
  "paragraphs": [
    "Dhirajlal Hirachand \"Dhirubhai\" Ambani (28 December 1932 – 6 July 2002) was an Indian  billionaire businessman who founded Reliance Industries in 1958. Ambani took Reliance public in 1977. In 2016, he was honoured posthumously with the Padma Vibhushan , India's second-highest civilian honour for his contributions to trade and industry. Ambani faced numerous accusations of market manipulation , tax evasion , and cronyism .",
    "Dhirubhai Ambani was one of the sons of Hirachand Gordhanbhai Ambani, a village school teacher belonging to the Modh vaniya ( Baniya ) community and Jamnaben Ambani and was born in Chorwad, Malia Taluka, Junagadh district , Gujarat on 28 December 1932. He did his studies from Bahadur Khanji school. He returned from Aden in 1958 to try his hand at his own business in India in the textile market. It is also said that he has worked at a gas station as a petrol vendor.",
    "Ambani returned to India and started \"Majin\" in partnership with Champaklal Damani, his second cousin, who lived with him in Yemen. Majin was to import polyester yarn and export spices to Yemen.",
    "The first office of the Reliance Commercial Corporation was set up at the Narsinatha Street in Masjid Bunder . It was a 350 sq ft (33 m 2 ) room with a telephone, one table and three chairs. Initially, they had two assistants to help them with their business.",
    "During this period, Ambani and his family stayed in a two-bedroom apartment at the Jai Hind Estate in Bhuleshwar , Mumbai. In 1965, Champaklal Damani and Dhirubhai Ambani ended their partnership and Ambani started on his own. It is believed that both had different temperaments and different takes on how to conduct business.",
    "In 1988, Reliance Industries came up against a rights issue regarding partly convertible debentures. It was rumoured that the company was making all efforts to ensure that their stock prices did not slide an inch. Sensing an opportunity, The Bear Cartel, a group of stock brokers from Calcutta , started to short sell the shares of Reliance. To counter this, a group of stock brokers until recently referred to as \"Friends of Reliance\" started to buy the short-sold shares of Reliance Industries on the Bombay Stock Exchange .",
    "To find a solution to this situation, the Bombay Stock Exchange was closed for three business days. Authorities from the Bombay Stock Exchange (BSE) intervened in the matter and brought down the \"Unbadla\" rate to ₹ 2 with a stipulation that the Bear Cartel had to deliver the shares within the next few days. The Bear Cartel bought shares of Reliance from the market at higher price levels and it was also learnt that Dhirubhai Ambani himself supplied those shares to the Bear Cartel and earned a healthy profit out of The Bear Cartel's adventure.",
    "After this incident, many questions were raised by his detractors and the press. Not many people were able to understand how a yarn trader until a few years ago was able to get in such a huge amount of cash flow during a crisis period. The answer to this was provided by the then finance minister, Pranab Mukherjee in the Parliament. He informed the house that a Non-Resident Indian had invested up to ₹ 220 million in Reliance during 1982–83. These investments were routed through many companies like Crocodile, Lota and Fiasco. These companies were primarily registered in Isle of Man . All the promoters or owners of these companies had a common surname Shah . An investigation by the Reserve Bank of India in the incident did not find any unethical or illegal acts or transactions committed by Reliance or its promoters.",
    "Ambani was admitted to the Breach Candy Hospital in Mumbai on 24 June 2002 after he suffered a major stroke. It was his second stroke, the first had occurred in February 1986 and had paralyzed his right hand. He was in a coma for more than a week and a number of doctors were consulted. He died on 6 July 2002 at the age of 69.",
    "The country has lost iconic proof of what an ordinary Indian fired by the spirit of enterprise and driven by determination can achieve in his own lifetime.",
    "This new star, which rose on the horizon of the Indian industry three decades ago, remained on the top until the end by virtue of his ability to dream big and translate it into reality through the strength of his tenacity and perseverance.\nI join the people of Maharashtra in paying my tribute to the memory of Ambani and convey my heartfelt condolences to the bereaved family.",
    "Following his first stroke in 1986, Ambani handed over control of Reliance to his sons, Mukesh and Anil . In November 2004, Mukesh in an interview admitted to having differences with Anil over ownership issues. He also said that the differences \"are in the private domain\". After the death of Dhirubhai Ambani, the group was split into Reliance Industries Limited headed by Mukesh, and Reliance Anil Dhirubhai Ambani Group headed by Anil. So finally Mukesh Ambani was elected as the CEO and Anil Ambani was elected as the chairperson.",
    "As of 2017, the company had more than 250,000 employees. In 2012, Reliance Industries was one of the two Indian companies to be ranked among the top 100 in the Fortune 500 list of the world's largest companies by revenue.",
    "In 1988 an unauthorized biography of Dhirubhai Ambani, by Hamish McDonald with the title The Polyester Prince , outlined all his political and business conquests. The book was not published in India because the Ambanis threatened legal action; an updated version went on sale under the title Ambani and Sons in 2010, and there has been no action against the publisher so far.",
    "A Bollywood movie Guru , directed by filmmaker Mani Ratnam , is said to be set on the life of Dhirubhai Ambani due to similarities between the plot and Ambani's life. However, Ratnam has denied that is a biography but has said it draws the \"essence of the character\" from real life."
  ],
  "scraped_at": "2025-06-11 06:35:29 UTC"
}