{
  "url": "https://en.wikipedia.org/wiki/Dhyan_Chand",
  "title": "Dhyan Chand",
  "paragraph_count": 52,
  "paragraphs": [
    "Major Dhyan Chand (29 August 1905 – 3 December 1979) was an Indian field hockey player. He is widely regarded as the greatest field hockey player in history . He was known for his extraordinary ball control and goal-scoring feats, in addition to earning three Olympic gold medals , in 1928, 1932 and 1936, during an era where India dominated field hockey. Dhyan Chand's influence extended beyond these victories, as India won the field hockey event in seven out of eight Olympics from 1928 to 1964.",
    "Known as The Wizard or The Magician of hockey for his superb ball control, Chand played internationally from 1926 to 1949, where he scored 570 goals in 185 matches according to his autobiography, Goal, and over 1,000 goals in his entire domestic and international career. BBC called him the \"hockey's equivalent of Muhammad Ali \". The Government of India awarded Chand India's third highest civilian honour, the Padma Bhushan in 1956. His birthday, 29 August, is celebrated as National Sports Day in India every year. India's highest sporting honour, Major Dhyan Chand Khel Ratna Award is named after him.",
    "Chand was born in Allahabad on 29 August 1905 in a Rajput family to Sharadha Singh [ citation needed ] and Sameshwar Singh. Chand's father was enlisted in the British Indian Army , where he played hockey for the army. He had two brothers – Mool Singh and Roop Singh , the latter was also a hockey player. Because of his father's numerous army transfers, the family had to move to different cities, and as such Chand had to terminate his education after only six years of schooling. The family finally settled in Jhansi , Uttar Pradesh , India.",
    "Chand studied at the Aligarh Muslim University , Aligarh and finally graduated from Victoria College , Gwalior in 1932. Being in the military, his father got a small piece of land for a house.",
    "Young Chand had no serious inclination towards sports though he loved wrestling. He stated that he did not remember whether he played any hockey worth mentioning before he joined the Army, though he said that he occasionally indulged in casual games in Jhansi with his friends.",
    "On 29 August 1922 – his 17th birthday – Chand enlisted in the 1st Brahmans of the British Indian Army as a sepoy (private). A reorganisation of the army that year resulted in the 1st Brahmans becoming the 1/ 1st Punjab Regiment . Between 1922 and 1926, Chand exclusively played army hockey tournaments and regimental games. Chand was ultimately selected for the Indian Army team which was to tour New Zealand. The team won 18 matches, drew two and lost only one, receiving praise from all spectators. Following this, in the two Test matches against the New Zealand squad, the team won the first and narrowly lost the second. Returning to India, Chand was promoted to Lance Naik in 1927.",
    "After successfully lobbying for reintroducing field hockey in the Olympics , the newly formed Indian Hockey Federation (IHF) made preparations to send its best possible team for the 1928 Amsterdam Olympics. In 1928, an Inter-Provincial Tournament was held to select the team members. Five teams participated in the inaugural nationals – United Provinces (UP), Punjab , Bengal , Rajputana and Central Provinces . Chand got permission from the Army to play for the United Provinces team.",
    "In its first game in the tournament, Dhyan Chand as the centre-forward , and Marthins, their inside-right, performed very well together. Chand attracted much attention with his clever stick-work. His penetrating runs and judicious passes seemed to assure him a position in the team that was to take part in the Olympic Games . Early in the game, it became evident that Chand was at his best. He took the ball away to the right and Marthins did well to give him a good pass. Quick as lightning, Dhyan Chand shot a goal. The ball struck one of the defenders' stick and went into the net, giving goalkeeper Collie no chance. A goal within 3 minutes of the start was more than what the most optimistic of the UP supporters could expect. At the interval, UP led by three goals to nil.",
    "On their part, Rajputana put every ounce of their efforts to score. The UP goal had more than one narrow escape but were the winners of a fine exhibition match (3–1).",
    "Buoyed by the success of the tournament, it was decided that it would be held every two years. After two more trial matches between various hopefuls, the Olympic team (including Chand as center-forward) was announced and assembled in Bombay . Center-half Broome Eric Pinniger was selected as the vice-captain. The IHF was initially low on funds since the provinces of Bombay, Madras, and Burma had turned a deaf ear to their financial appeal, but they managed to scrape enough money. The Olympic team then played a match against the Bombay XI, and amazingly lost 3–2, even though Singh scored both his team's goals. With a quiet send-off, the team left for England on 10 March, to play 11 matches against local sides as well in the London Folkestone Festival in 1927, winning all. It was also said that Great Britain did not send a team in 1928 to the Amsterdam Olympics after their national team was defeated by the Indian team at Folkestone.\nThis is best cited in Kapur's book Romance of Hockey where a despatch of H. Sutherland Stark, London representative of 'Sports', a magazine of Lahore, tells the story better than any other comment: \"For reasons it is difficult to understand the English Hockey Association have taken up a very stiff attitude towards Indian Hockey in recent years and have repeatedly been twitted about it by even their own supporters. The editor of a leading sports newspaper described them to me as an intensely conservative body, but there seems to be something more than conservative behind their unwillingness apparently ever to meet India in a full international encounter\". Finally, on 24 April, the team arrived in Amsterdam to embark on a tour of the Low Countries. In all the pre-Olympic matches against local Dutch, German and Belgian teams, the Indian team won by large margins.",
    "In the 1928 Amsterdam Summer Olympics, the Indian team was put in the division A table, with Austria, Belgium , Denmark and Switzerland. On 17 May the Indian national hockey team made its Olympic debut against Austria, winning 6–0, with Chand scoring 3 goals. The next day India defeated Belgium 9–0; however, Chand only scored once. On 20 May, Denmark lost to India 5–0, with Chand netting three. Two days later, he scored 4 goals when India defeated Switzerland 6–0.",
    "The final match took place on 26 May, with India facing the home team of the Netherlands. The Indian team's better players Feroze Khan , Ali Shaukat and Kehar Singh Gill were on the sick list and Chand himself was ill. However, even with a skeletal side, India managed to defeat the hosts 3–0 (with Singh scoring 2), and the Indian team won its country's first Olympic gold medal. Chand was the top scorer of the tournament, with 14 goals in five matches. A newspaper report about India's triumph said:",
    "This is not a game of hockey, but magic. Dhyan Chand is in fact the magician of hockey.",
    "Later, the authorities in the Netherlands in fact broke Chand's hockey stick to check if there was any magnet inside owing to his superb ball control ability. An elderly woman asked him to play with her walking cane and he continued to score goals with it.",
    "On returning to India, the team was received by thousands of people at the Bombay harbour, compared to the three people who had seen them off.",
    "Posted in Waziristan in the North-West Frontier Province (now in Pakistan) with his new 2/14 Punjab Regiment , Chand, by now a naik ( corporal ) was cut off from the IHF, which was by now controlled by civilians. The Inter-Provincial Tournament was being held to select the new Olympic team; the IHF wrote to the Army Sports Control Board to grant Singh leaves to participate in the nationals. His platoon refused. Chand received news that he had been selected by the IHF for the Olympic team without any formalities. The rest of his teammates, however, had to prove their skills in the Inter-Provincial Tournament, which was won by Punjab. As such, seven players from Punjab were selected for the Olympic team. Apart from Chand, Broome Eric Pinnigar, Leslie Hammond and Richard Allen were the other 1928 Olympians retained in the team. Chand's brother Roop Singh was also included in the squad as a left-in. Lal Shah Bokhari was selected as captain.",
    "The Olympic team then played practice matches in India before heading for Colombo. In two matches in Ceylon , the Olympic team beat the All Ceylon XI 20–0 and 10–0. Wrote one newspaper on the first match, \"Perfection is perilous, for it tempts the gods. For once, this was proved wrong for even the god of weather paid tribute to the genius of the Indian players. Rain clouds, which had threatened to ruin the game, vanished into the blue, and thousands of spectators spent a happy hour marveling at the incomparable artistry of the Indian team.\"",
    "The India team set sail for San Francisco on 30 May and arrived on 6 July. They reached Los Angeles three weeks before the opening ceremony of the Olympics , which took place on 30 July. On 4 August 1932, India played its first match against Japan and won 11–1. Chand, Roop Singh, Gurmit Singh each scored thrice, and Dickie Carr once. In the final on 11 August, India played against hosts USA . India won 24–1, a world record at that time (until it was broken in 2003), and once again clinched the gold medal. Chand scored eight times, Roop Singh 10, Gurmit Singh five, and Pinniger once. In fact, Chand along with his brother Roop scored 25 out of the 35 goals scored by India. This led to them being dubbed the 'hockey twins'.",
    "One Los Angeles newspaper wrote, \"The All-India field hockey team which G. D. Sondhi brought to Los Angeles to defend their 1928 Olympic title, was like a typhoon out of the east. They trampled under their feet and all but shoved out of the Olympic stadium the eleven players representing the United States.\"",
    "The team then embarked on a tour of the United States. They played a match on 20 August against a United States XI, almost the same team that they had faced in Los Angeles. Even after loaning its second keeper Arthur Hind, for a half, the team won 24–1.",
    "After setting sail from New York, the team arrived in England. They then embarked on a hectic tour, playing nine matches in various countries in a fortnight, commencing on 2 September.  They played four internationals against the Netherlands, Germany, Czechoslovakia, and Hungary. The team then reached Sri Lanka and India, playing a number of matches to pay for their expenses.  At the end of the tour, India had played 37 matches, winning 34, drawing two, with one abandoned. Chand scored 133 of the 338 Indian goals.",
    "In India, he is often referred to as Hockey ka Jaadugar which translates to \"Magician of the game of Hockey\".",
    "In 1933, Chand's home team, the Jhansi Heroes, participated in and won the Beighton Cup , which he considered the most prestigious of India men's national field hockey team tournaments. Later, he would state:",
    "If anybody asked me which was the best match that I played in, I will unhesitatingly say that it was the 1933 Beighton Cup final between Calcutta Customs and Jhansi Heroes. Calcutta Customs was a great side those days; they had Shaukat Ali, Asad Ali, Claude Deefholts, Seaman, Mohsin, and many others who were then in the first flight of Indian hockey.",
    "I had a very young side. Besides my brother Roop Singh, and Ismail, who played for the Great Indian Peninsular Railway in Mumbai, I had no other really great player in the team. But I had a team which was determined to do or die.",
    "It was a great match, full of thrills, and it was just opportunism that gave us the victory. Customs were pressing hard and our goal was at their mercy. Suddenly I broke through and from midfield gave a long through pass to Ismail, who ran with Jesse Owens ' speed half the length of the ground. A misunderstanding occurred between the Customs left-half and the goalkeeper, and Ismail, taking every advantage of it, cut through and netted the only goal of the match. We felt very proud of our triumph.",
    "In Kolkata, the Heroes also won the Lakshmibilas Cup tournament, which was open only to Indian teams. In 1935, they successfully defended their Beighton Cup title, though lost the subsequent year.",
    "In December 1934, the IHF decided to send a team to New Zealand in the new year. Chand and his brother were immediately selected. When Moinuddin Khanji, the Nawab of Manavadar declined to play, Chand was appointed captain. On this tour, the team played a total of 48 matches, with 28 in New Zealand and the remainder in India, Ceylon, and Australia. India won every match, scoring 584 goals and conceding only 40. Of these 48 matches, Chand played 23 and scored a total of 201 goals.",
    "Upon returning to India, Chand resumed his duties in the barracks. In December 1935, the IHF decided to stage the Inter-Provincial tournament to select the Olympic team. Chand was again denied permission to leave his platoon, though once again he was selected without formalities. The final team assembled in Delhi on 16 June and played against the Delhi Hockey XI. Incredibly, they lost 4–1. After this inauspicious start, the team went on a successful tour of the subcontinent, finally departing for Marseille on 27 June. They arrived on 10 July, and after an uncomfortable journey in third-class compartments, reached Berlin on 13 July. On 17 July, the Indian team played a practice match against Germany and lost 4–1. As such, manager Pankaj Gupta informed the IHF that Ali Dara had to be sent immediately to replace the out of form Mirza Masood .",
    "On 5 August, India won its first match against Hungary 4–0. India won the rest of the group matches against the USA (7–0, with Chand scoring 2 goals) and Japan (9–0, with Chand scoring 4). On 10 August, Ali Dara arrived. Their fourth match was the semi-final against France, whom they defeated 10–0, with Chand scoring 4 goals. Meanwhile, Germany had beaten Denmark 6–0, beaten Afghanistan 4–1, and in the play-offs, had defeated the Netherlands 3–0. Thus, India and Germany were to clash in the 1936 Berlin Olympics field hockey final on 19 August.",
    "On the morning of the final, the entire team was nervous since they had been defeated the last time they had faced Germany. In the locker room, Pankaj Gupta produced a Congress tricolour . Reverently the team saluted it, prayed and marched onto the field. The German team was successful in restricting the India side to a single goal until the first interval. After the interval, the Indian team launched an all-out attack, easily defeating Germany 8–1, incidentally the only goal scored against India in that Olympic tournament. Newspaper reports for the match stated that Dhyan Chand scored four goals, while he claimed he scored three, in his autobiography Goal , with Ali Dara scoring two, and Roop Singh, Carlyle Tapsell and Sayed Jaffar with one goal each. Describing the game, the Special Correspondent of The Hindu wrote:",
    "Every member of the team was feeling the strain of the defeat to the Germans in the practice match, and no one was in his usual self. I never saw a hockey team from India, where the game is definitely of a superior standard compared to the rest of the world, being so obsessed on the eve of the match. The players were nervous as to what the result of the match would be, which was heightened by the feeling that the burden of the country's honour was on their shoulders.",
    "The game was played at a fast pace and was packed with thrilling incidents. The Germans undercut and lifted the ball, but the Indian team countered with brilliant half-volleying and amazing long shots. Twice Dara attempted to score but was declared offside. Dhyan Chand discarded his spiked shoes and stockings and played with bare legs and rubber soles and became speedier in the second half.",
    "The vigorous German attacks were brilliantly saved by Allen and Tapsell. The goal scored by Weiss of Germany was the only goal scored against the Indians throughout the tournament. The whole Indian team put up a splendid display. Dhyan Chand and Dara impressed by their combination, Tapsell by his reliability and Jaffar by his tremendous bursts of speed.",
    "There have been many erroneous media reports over the years claiming that Dhyan Chand scored 6 goals in India's 8–1 victory over Germany in the 1936 Olympic final. In his autobiography Goal! Chand wrote:",
    "“When Germany was four goals down, a ball hit Allen's pad and rebounded. The Germans took full advantage of this and made a rush, netting the ball before we could stop it. That was the only goal Germany would score in the match against our eight, and incidentally the only goal scored against India in the entire Olympic tournament. India's goal-getters were Roop Singh, Tapsell and Jaffar with one each, Dara two and myself three.”",
    "The International Hockey Federation records also attribute only three of the eight goals to Chand in the final. The final was included in the Leni Riefenstahl film on the 1936 Olympics, Olympia . Overall, in three Olympic tournaments, Chand had scored 37 goals in 12 matches.",
    "It is reported that the German leader Adolf Hitler was so impressed with Chand's skills that he offered him German citizenship and a position of Colonel in the German Army, which Dhyan Chand refused.",
    "After returning from Berlin, Chand joined his regiment. Between 1936 and the commencement of the War in 1939, he largely confined himself to army hockey, with one visit to Kolkata to take part in the Beighton Cup tournament in 1937. Before the Beighton Cup, Chand spent four months in a military camp in Pachmarhi to attend military classes. On 16 March 1938, he was made a Viceroy's Commissioned Officer (VCO; the equivalent of the present-day junior commissioned officer ) with the rank of jemadar (now termed naib subedar ). With the increasing need for qualified officers during wartime, he was promoted to acting subedar by July 1942 and to the war-substantive rank by early 1943. On 9 April 1943, Chand received an emergency commission as a second lieutenant in the 14th Punjab Regiment, with the war-substantive rank of lieutenant from the same date.",
    "Towards the closing phases of the war, Chand led an army hockey team which toured around the battlefields in Manipur, Burma, the Far East and Ceylon. When the war ended in 1945, Chand decided that the Indian hockey team needed new young players. In 1947, the IHF was requested by the Asian Sports Association (ASA) of East Africa to send a team to play a series of matches. The ASA made a condition that Chand should be included in the team. Once again, Chand was chosen as captain.",
    "The team which assembled in Bombay on 23 November 1947, reached Mombasa on 15 December and played 9 matches in British East Africa winning all. Chand, though now in his forties, still managed to score 61 goals in 22 matches.",
    "After returning from the East African tour in early 1948, Chand decided to gradually phase out his involvement in 'serious hockey'. He played exhibition matches, leading a Rest of India side against state teams and the 1948 Olympic team which defeated Chand's side 2–1, even though an aging Chand scored his side's lone goal. Chand's last match was leading the Rest of India team against the Bengal side. The match ended in a draw after which the Bengal Hockey Association organized a public function to honor Chand's services to Indian hockey.",
    "Chand continued to hold his emergency commission in the Indian Army post-Independence, with the service number IEC 3526, but was apparently not granted a regular commission. In 1951 he was honored at India's National Stadium with the inaugural Dhyan Chand Tournament, which he attended to the admiration of the spectators.",
    "After 34 years of service, Chand retired from the Indian Army on 29 August 1956 as a lieutenant (acting captain ). The Government of India honoured him the same year by conferring him the Padma Bhushan , India's third highest civilian honour.",
    "After retirement, he taught at coaching camps at Mount Abu , Rajasthan . Later, he accepted the position of Chief Hockey Coach at the National Institute of Sports , Patiala , a post he held from 1961 to 1969. Chand spent his last days in his hometown of Jhansi , Uttar Pradesh , India.",
    "Chand died on 3 December 1979 from liver cancer at the All India Institute of Medical Sciences , Delhi . He was cremated at the Jhansi Heroes ground in his hometown, after some initial problems in getting clearance. His regiment, the Punjab Regiment , accorded him full military honours.",
    "Dhyan Chand remains a legendary figure in Indian and world hockey. His skills have been glorified in various apocryphal stories and anecdotes. A number of these revolve around the fact that Singh had extraordinary control over dribbling the ball. Chand's birthday, 29 August, is celebrated as National Sports Day in India since 1995. The President gives away sports-related awards such as the Major Dhyanchand Khel Ratna , Arjuna Award and Dronacharya Award on this day at the Rashtrapati Bhavan , India. [ citation needed ]",
    "The 20th National Award, 2012, the Gem of India, awarded by the Union Minister of India, was given to Dhyan Chand. The award was received by Dhyan Chand's son, Ashok Dhyan Chand (a hockey Olympian in his own right), on behalf of his deceased father. The award was given by Journalist Association of India under the flagship of Journalists Federation of India, Sirifort Auditorium , New Delhi , India, on 22 September 2012.",
    "In 1995, Chand's nine-foot statue was unveiled in the National Stadium, Delhi , on the occasion of his 90th birth anniversary. The stadium was renamed Dhyan Chand National Stadium in 2002 in his honour. In the same year, India's highest award for lifetime achievement in sports, the Dhyan Chand Award was instituted. It has been awarded annually since, to sporting figures who not only contribute through their performances but also contribute to their sport even after retirement.",
    "A hostel at Aligarh Muslim University , of which he was an alumnus, has been named after him. He scored over 1,000 goals in his entire domestic and international career, from 1926 to 1948, making him the highest goal scorer in hockey history. BBC called him the \"hockey's equivalent of Muhammad Ali \".",
    "An Astroturf hockey pitch, at the Indian Gymkhana Club in London, has been named after Indian hockey legend Dhyan Chand. The Government of India has issued a commemorative postage stamp and a First Day Cover in honour of Dhyan Chand. He remains the only Indian hockey player to have a stamp in his honour. Chand was among the nominees considered for India's highest civilian award, Bharat Ratna , for 2014 and there was support for it. The award was then given to Sachin Tendulkar and C. N. R. Rao . The family members of Dhyan Chand were disappointed with the government's decision. An RTI was filed which suggested that the Prime Minister's Office had ignored the recommendation from sports ministry on giving the award to Sachin Tendulkar.",
    "A lesson on Dhyan Chand written by author K. Arumugam from chapter titled 'The Wizard' in his book, 'The Great Indian Olympians', was included in the Class 9 text books by NCERT in the year 2002-2003."
  ],
  "scraped_at": "2025-06-11 06:39:49 UTC"
}