{
  "url": "https://en.wikipedia.org/wiki/E._Sreedharan",
  "title": "E. Sreedharan",
  "paragraph_count": 21,
  "paragraphs": [
    "Elattuvalapil Sreedharan (born 12 June 1932) is an Indian engineer and politician from the Indian state of Kerala . He is credited with changing the face of public transport in India with his leadership in building the Konkan Railway and the Delhi Metro while he served as the managing director of Delhi Metro Rail Corporation (DMRC) between 1995 and 2012. Known as the Metro Man , he was awarded the Padma Shri by the Government of India in 2001, the Padma Vibhushan in 2008, the Chevalier de la Legion of Honour in 2005 by the Government of France and was named one of Asia's Heroes by Time magazine in 2003. Sreedharan was appointed by the former UN Secretary General Ban Ki-moon to serve on the United Nations's High Level Advisory Group on Sustainable Transport (HLAG-ST) for a period of three years in 2015. He is a member of Mata Vaishno Devi Shrine Board . He briefly served as a national executive council member of Bharatiya Janata Party, but later quit active politics in December 2021. He also worked as an advisor of Dhaka Metro authority which is called Dhaka Mass Transit Company Limited under the Railway Ministry of Bangladesh .",
    "E. Sreedharan was born on 12 June 1932 in present-day Karukaputhur , Palakkad District , Kerala , India into a Hindu Malayali family to Keezhveettil Neelakandan Moosath and Ammaluamma.",
    "Sreedharan's primary education was from Government Lower Primary School Chathannur near Pattambi in Palakkad district. He completed his education at the Basel Evangelical Mission Higher Secondary School and then went to the Victoria College in Palghat . He later-on completed his Civil Engineering degree from the Government Engineering College , Kakinada , Andhra Pradesh, presently known as Jawaharlal Nehru Technological University .",
    "E. Sreedharan and T. N. Seshan were classmates at BEM High School and Victoria College in Palakkad. Both of them were selected for Engineering in JNTU Kakinada, a university in a port town in Andhra Pradesh, however, E. Sreedharan decided to pursue it, while T. N. Seshan decided to join Madras Christian College (MCC).",
    "For a short period, Sreedharan worked as a lecturer in Civil engineering at the Government Polytechnic, Kozhikode and a year at the Bombay Port Trust as an apprentice. He subsequently joined the Indian Railway Service of Engineers (IRSE), after clearing the Indian Engineering Services Exam in 1953 conducted by the UPSC. His first assignment was in the Southern Railway as a Probationary Assistant Engineer in December 1954. [ citation needed ]",
    "In December 1964 , a cyclone washed away parts of Pamban Bridge that connected Rameswaram to mainland Tamil Nadu . The Railways set a target of six months for the bridge to be repaired while Sreedharan's boss, under whose jurisdiction the bridge came, reduced it to three months. Sreedharan was put in-charge of the execution, and he restored the bridge in just 46 days. The Railway minister's Award was given to him in recognition of this achievement.",
    "In 1970, as the deputy chief engineer, he was put in charge of the implementation, planning and design of the Calcutta Metro , the first ever metro in India. Sreedharan not only completed this much heralded project but also laid down the foundation of modern infrastructure engineering in India. He was taken off this post in 1975.",
    "When Sreedharan joined the Cochin Shipyard in October 1979, it was undergoing a phase of unproductivity. The production of its first ship MV Rani Padmini had been delayed for a long period. When Sreedharan took over, he turned the fortunes of the shipyard around and made sure its first ship was built while he was its chairman and managing director (CMD). In 1981, under Sreedharan's leadership, the shipyard launched its first ship, the MV Rani Padmini .",
    "He was promoted as general manager, Western Railway in July 1987, and in July 1989 elevated to the post of Member Engineering, Railway Board and ex-officio Secretary to the Government of India. On his retirement in June 1990, the Government made it clear it still needed his services and he was appointed the CMD of Konkan Railway on contract in 1990 by the then railway minister, George Fernandes . Under his stewardship, the company executed its mandate in seven years. The project was unique in many respects. It was the first major project in India to be undertaken on a BOT (Build-Operate-Transfer) basis; the organisation structure was different from that of a typical Indian Railway set-up; the project had 93 tunnels along a length of 82 km and involved tunnelling through soft soil. The total project covered 760 km and had over 150 bridges. That a public sector project could be completed without significant cost and time overruns was considered an achievement by many. [ who? ] [ citation needed ] Konkan Railway has been covered in the Extreme Railways program by Chris Tarrant as one of the most difficult railway projects to have been constructed in the world.",
    "He was made the managing director of Delhi Metro Rail Corporation by then Delhi Chief Minister Sahib Singh Verma and by mid 1997 all the scheduled sections were completed by their target date or before, and within their respective budgets. Sreedharan was given the sobriquet of Metro Man by the media for his grand success in executing the completion of the Delhi Metro. His stint in the Delhi Metro has been considered so successful and crucial to India that in 2005, he was awarded the Chevalier de la Légion d'honneur (Knight of the Legion of Honour) by the government of France, and the Padma Vibhushan by the government of India in 2008. There were also demands by prominent political figures that Sreedharan be awarded the Bharat Ratna , the most prestigious civilian award in India. He was particularly known for isolating his projects from political pressures and influences and winning political commitments for fast execution of projects. He had announced that he would retire by the end of 2005, but his tenure was further extended to oversee the completion of the second phase of Delhi Metro. After 16 years of service with the Delhi Metro, Sreedharan retired from service on 31 December 2011.",
    "After his retirement from DMRC, Sreedharan has been appointed as Principal Advisor of the Kochi Metro Rail Project. Initially, the project faced hurdles when a controversy broke out with the government announcing a global tender process for Kochi Metro, rather than letting DMRC handle the consultancy and project execution as Sreedharan and DMRC had initially asked for. Vested interests in the government have been alleged in this decision. However, several political parties came out in opposition of the move, and backed Sreedharan's decision in enforcing DMRC's role in the Kochi Metro, after which the government reversed its stance. Kochi metro was finally unveiled on 17 June 2017 amidst much celebrations. The unveiling of the metro was considered a landmark event in India in terms of completion time, control systems used and initiatives such as employing transgender people, vertical gardening, respecting migrant labourers, and use of solar power.",
    "Sreedharan has also been appointed as Chief Advisor for the Lucknow Metro As per E. Sreedharan, Kochi metro was built in four years whereas Lucknow Metro will be completed in a period of two years and nine months, and that would be the fastest in India and the world till now.",
    "He has been advising for the Jaipur Metro as well as DMRC has undertaken its implementation. He has also been appointed as advisor for a proposed Metro rail system in Andhra Pradesh in the Visakhapatnam and Vijayawada (VGTM) areas, under the leadership of the Chief Minister Chandrababu Naidu . He has also been advisor for Coimbatore Metro .",
    "Before joining politics, he commented on various political issues. Ahead of the 2014 Indian general election he endorsed Narendra Modi as Prime Minister and praised him for his quick decision making as Chief Minister of Gujarat . When the Aam Aadmi Party government in Delhi announced to give free travel facility only to women passengers on buses and Metro trains, he opposed the decision and wrote to Prime Minister Narendra Modi for his \"personal intervention\". He opposed Kerala Government over a legislation which facilitate student organisational activities in all educational institutions, including private self-financing colleges. He in statement said \"campus politics is being encouraged by politicians and even by government leading to disruption of classes, student clashes, criminal activities such as murders, stabbing incidents etc. Unfortunately, some teachers with political leaning give mute support to such activities\".",
    "He suggested that the KMRL must reduce fare prices and called outside consultants for Kochi metro's Pettah-Thripunithura extension a \"foolish act\". He suggested the Indian Railways to stop borrowing capital for its operations and raise fare prices.",
    "Sreedharan called India's Mumbai-Ahmedabad high-speed train project as a \"highly expensive\" undertaking that caters only to the elites.",
    "On 18 February 2021, Sreedharan joined the Bharatiya Janata Party . He contested in 2021 Kerala Legislative Assembly election from Palakkad assembly constituency and got 35.34% of votes polled, losing to the incumbent Shafi Parambil of the Indian National Congress , who got 38.06% of votes. However, Sreedharan quit active politics on 17 December 2021.",
    "Sreedharan has said he strongly opposes Hindu and Christian girls being tricked in marriage\", calling it love jihad ; he has also said that because he is a vegetarian, he opposes any consumption of meat. In a 2021 interview to The Economic Times , he stated that Narendra Modi \"is probably the best PM India has had so far\".",
    "A Book on Sreedharan's life is 'Karmayogi: E. Sreedharante Jeevitha Katha' (Translated: Karmayogi : The story of E. Sreedharan's life) is an authentic biography by M. S. Asokan. A short biography on E. Sreedharan was penned by P.V. Alby, named 'Jeevithavijayathinte Paadapusthakam' (translated: A Textbook on success in life). Both these books were top sellers in Kerala during the time Sreedharan took up his post on the Kochi Metro project as Delhi Metro Rail Corporation 's principal advisor. Another book on Sreedharan is \"India's Railway Man - A biography of Dr. E Sreedharan\" by Rajendra B Aklekar.",
    "In another international book \"マダム、これが俺たちのメトロだ\" (Trans: Madam, this is our Metro) written by a female Japanese Civil Engineer Abe Reiko, who was closely associate with the DMRC project, praised Sreedharan for his far-farsightedness and strong determination. [ citation needed ]",
    "Sreedharan's wife is Radha Sreedharan. His daughter is Shanthi Menon, principal of the Deens Academy, Bangalore."
  ],
  "scraped_at": "2025-06-11 06:33:27 UTC"
}