{
  "url": "https://en.wikipedia.org/wiki/Kabir",
  "title": "Kabir",
  "paragraph_count": 48,
  "paragraphs": [
    "Traditional",
    "Kabir ( fl. 15th century) was a well-known Indian devotional mystic poet and sant . His writings influenced Hinduism's Bhakti movement , and his verses are found in Sikhism's scripture Guru Granth Sahib , the Satguru Granth Sahib of Saint Garib Das , and Kabir Sagar of Dharamdas . Today, Kabir is an important figure in Hinduism , Sikhism and in Sufism . He was a disciple of Ramananda , the founder of the Ramanandi Sampradaya .",
    "Born in the city of Varanasi in what is now Uttar Pradesh , he is known for being critical of organised religions. He questioned what he regarded to be the meaningless and unethical practices of all religions, primarily what he considered to be the wrong practices in Hinduism and Islam. During his lifetime, he was threatened by both Hindus and Muslims for his views. When he died, several Hindus and the Muslims he had inspired claimed him as theirs.",
    "Kabir suggested that \"truth\" is with the person who is on the path of righteousness, who considers everything, living and non living, as divine, and who is passively detached from the affairs of the world. To know the truth, suggested Kabir, drop the \"I\", or the ego. Kabir's legacy survives and continues through the Kabir panth (\"Path of Kabir\"), Sant Mat sect that recognises Kabir as its founder. Its members are known as Kabir panthis .",
    "The years of Kabir's birth and death are uncertain. Some historians favour 1398–1448 as the period Kabir lived, while others favour 1440–1518. Generally, Kabir is believed to have been born in 1398 (Samvat 1455) , on the full moon day of Jyeshtha month (according to the historical Hindu calendar Vikram Samvat ) at the time of Brahmamuharta . There is a considerable scholarly debate on the circumstances surrounding Kabir's birth. Many followers of Kabir believe that he came from Satloka by assuming the body of light, and incarnated on a lotus flower and claim that the rishi Ashtanand was the direct witness of this incident, who himself appeared on a lotus flower in the Lahartara Pond .",
    "A few accounts mention that Kabir, in the form of in infant, was found at Lahartara Lake by a Muslim weaver named Niru and his wife Nima, who raised him as their child.",
    "Kabir is believed to have become one of the many disciples of the Bhakti poet-saint Swami Ramananda in Varanasi, known for devotional Vaishnavism with a strong bent to monist Advaita philosophy teaching that God was inside every person and everything. Early texts about his life place him with Vaishnava tradition of Hinduism as well as the Sufi tradition of Islam. According to Irfan Habib, the two manuscript versions of the Persian text Dabestan-e Mazaheb are the earliest known texts with biographical information about Kabir. The Dabestan-e-Mazaheb states Kabir is a \"Bairagi\" (Vaishnava yogi) and states he is a disciple of Ramanand (the text refers to him repeatedly as \"Gang\").",
    "Kabir's family is believed to have lived in the locality of Kabir Chaura in Varanasi (Banaras) . Kabīr maṭha ( कबीरमठ ), a maṭha located in the back alleys of Kabir Chaura, celebrates his life and times. Accompanying the property is a house named Nīrūṭīlā ( नीरू टीला ) which houses Niru and Nima graves.",
    "Kabir's poems were in Sadhukkadi , also known as Panchmel Khichri, borrowing from various dialects including Khadi boli , Braj , Bhojpuri , Marwari and Awadhi . Kabir also wrote in pure Bhojpuri, for instance his poems like mor hīrā herāïl bā kichaṛe me is written in pure Bhojpuri. They cover various aspects of life and call for a loving devotion for God. Kabir composed his verses with simple words. Most of his work was concerned with devotion, mysticism and discipline.",
    "Where spring, the lord of seasons reigneth, there the unstruck music sounds of itself, There the streams of light flow in all directions, few are the men who can cross to that shore! There, where millions of Krishnas stand with hands folded, Where millions of Vishnus bow their heads, where millions of Brahmas are reading the Vedas, Where millions of Shivas are lost in contemplation, where millions of Indras dwell in the sky, Where the demi-gods and the munis are unnumbered, where millions of Saraswatis , goddess of music play the vina, There is my Lord self-revealed, and the scent of sandal and flowers dwells in those deeps.",
    "Kabir and his followers named his verbally composed poems of wisdom as \"bāņīs\" (utterances). These include songs and couplets, called variously dohe , śalokā (Sanskrit: ślokā), or sākhī (Sanskrit: sākṣī). The latter term means \"witness\", implying the poems to be evidence of the Truth.",
    "Literary works with compositions attributed to Kabir include Kabir Bijak , Kabir Parachai , Sakhi Granth , Adi Granth (Sikh), and Kabir Granthawali (Rajasthan). However, except for Adi Granth, significantly different versions of these texts exist and it is unclear which one is more original; for example, Kabir Bijak exists in two major recensions. The most in depth scholarly analysis of various versions and translations are credited to Charlotte Vaudeville, the 20th century French scholar on Kabir.",
    "There are 82 works attributed to Kabir as mentioned in Kabir and the Kabir panth by Westcott. Shyamsundar Das himself brought to light two marked manuscripts which he published in 1928. One of these manuscripts carried the date 1504 and the other 1824. [ citation needed ]",
    "Kabir's poems were verbally composed in the 15th century and transmitted viva voce through the 17th century. Kabir Bijak was compiled and written down for the first time in the 17th century. Scholars state that this form of transmission, over geography and across generations bred change, interpolation and corruption of the poems. Furthermore, whole songs were creatively fabricated and new couplets inserted by unknown authors and attributed to Kabir, not because of dishonesty but out of respect for him and the creative exuberance of anonymous oral tradition found in Indian literary works. Scholars have sought to establish poetry that truly came from Kabir and its historicity value.",
    "Kabir's poems can be found in a wide variety of publications and websites, but the discussion of authenticity is ongoing. It seems certain that minor changes will have occurred through the centuries and it is also possible that poems written by others have been attributed to Kabir.",
    "Rabindranath Tagore 's English translation and compilation, Songs of Kabir , was first published in 1915 and has been a classic reprinted and circulated particularly in the West. One critic (V.C. Mishra) has gone so far as to suggest that only six of its hundred poems are authentic and also raises the question of whether the translator projected theological perspectives of the early 20th century onto Kabir. The same essay adds that the presumed unauthentic poems nevertheless belong to the Bhakti movement in medieval India and may have been composed by admirers of Kabir who lived later.",
    "According to Linda Hess, \"Some modern commentators have tried to present Kabir as a synthesizer of Hinduism and Islam; but the picture is a false one. While drawing on various traditions as he saw fit, Kabir emphatically declared his independence from both the major religions of his countrymen, vigorously attacked what he considered the follies of these religions, and tried to kindle the fire of a similar autonomy and courage in those who claimed to be his disciples. He adopted their terminology and concepts, but vigorously criticised them both. He questioned the need for any holy book, as stated in Kabir Granthavali as follows:",
    "Reading book after book the whole world died, and none ever became learned! But understanding the root matter is what made them gain the knowledge!",
    "Many scholars interpret Kabir's philosophy to be questioning the need for religion, rather than attempting to propose either Hindu–Muslim unity or an independent synthesis of a new religious tradition. Kabir rejected the hypocrisy and misguided rituals evident in various religious practices of his day, including those in Islam and Hinduism.",
    "Saints I've seen both ways. Hindus and Muslims don't want discipline, they want tasty food. The Hindu keeps the eleventh-day fast, eating chestnuts and milk. He curbs his grain but not his brain, and breaks his fast with meat. The Turk [Muslim] prays daily, fasts once a year, and crows \"God!, God!\" like a cock. What heaven is reserved for people who kill chickens in the dark? Instead of kindness and compassion, they've cast out all desire. One kills with a chop, one lets the blood drop, in both houses burns the same fire. Turks and Hindus have one way, the guru's made it clear. Don't say Ram, don't say Khuda [Allah], so says Kabir.",
    "In Bijak , Kabir mocks the practice of praying to avatars such as Buddha of Buddhism, by asserting \"don't call the master Buddha, he didn't put down devils\". Kabir urged people to look within and consider all human beings as manifestation of God's living forms:",
    "If God be within the mosque, then to whom does this world belong? If Ram be within the image which you find upon your pilgrimage, then who is there to know what happens without? Hari is in the East, Allah is in the West. Look within your heart, for there you will find both Karim and Ram; All the men and women of the world are His living forms. Kabir is the child of Allah and of Ram: He is my Guru, He is my Pir.",
    "Charlotte Vaudeville states that the philosophy of Kabir and other sants of the Bhakti movement is the seeking of the Absolute. The notion of this Absolute is nirguna which, writes Vaudeville, is same as \"the Upanishadic concept of the Brahman-Atman and the monistic Advaita interpretation of the Vedantic tradition, which denies any distinction between the soul [within a human being] and God, and urges man to recognize within himself his true divine nature\". Vaudeville notes that this philosophy of Kabir and other Bhakti sants is self-contradictory, because if God is within, then that would be a call to abolish all external bhakti . This inconsistency in Kabir's teaching may have been differentiating \"union with God\" from the concept of \"merging into God, or Oneness in all beings\". Alternatively, states Vaudeville, the saguna prema-bhakti (tender devotion) may have been prepositioned as the journey towards self-realization of the nirguna Brahman, a universality beyond monotheism.",
    "David N. Lorenzen and Adrián Muñoz trace these ideas of God in Kabir's philosophy as nirguna Brahman to those in Adi Shankara 's theories on Advaita Vedanta school of Hinduism, albeit with some differences.",
    "Lorenzen in his review of Kabir's philosophy and poetry writes, \"the extent to which Kabir borrowed elements from Islam is controversial. Many recent scholars have argued that he simply rejected Islam and took almost all his ideas and beliefs from the Hindu tradition. Contemporary Kabir Panth sadhus make roughly the same argument. Most of the vocabulary used in his songs and verses are borrowed directly from the Hindu tradition. \nSome scholars state that the sexual imagery in some of Kabir's poems reflect a mystic Sufi Islam influence, wherein Kabir inverts the traditional Sufi representation of a God-woman and devotee-man longing for a union, and instead uses the imagery of Lord-husband and devotee-bride. Other scholars, in contrast, state that it is unclear if Sufi ideas influenced Bhakti sants like Kabir or it was vice versa, suggesting that they probably co-developed through mutual interaction.",
    "Kabir left Islam, states Ronald McGregor. Kabir, nevertheless, criticised practices such as killing and eating cows by Muslims, in a manner Hindus criticised those practices:",
    "We have searched the turaki Dharam ( Turk's religion , Islam), these teachers throw many thunderbolts, Recklessly they display boundless pride while explaining their own aims, they kill cows. How can they kill the mother, whose milk they drink like that of a wet nurse? The young and the old drink milk pudding, but these fools eat the cow's body. These morons know nothing, they wander about in ignorance, Without looking into one's heart, how can one reach paradise?",
    "Kabir's couplets suggest he was persecuted for his views, while he was alive. He stated, for example,",
    "Saints I see the world is mad. If I tell the truth they rush to beat me, if I lie they trust me.",
    "Kabir response to persecution and slander was to welcome it. He called the slanderer a friend, expressed gratefulness for the slander, for it brought him closer to his God. Winand Callewaert translates a poem attributed to Kabir in the warrior-ascetic Dadupanthi tradition within Hinduism, as follows:",
    "Keep the slanderer near you, build him a hut in your courtyard — For, without soap or water, he will scrub your character clean.",
    "The legends about Kabir describe him as the underdog who nevertheless is victorious in trials by a Sultan , a Brahmin , a Qazi , a merchant , a god or a goddess. The ideological messages in the legends appealed to the poor and oppressed. According to David Lorenzen, legends about Kabir reflect a \"protest against social discrimination and economic exploitation\", they present the perspective of the poor and powerless, not the rich and powerful. However, many scholars doubt that these legends of persecution are authentic, point to the lack of any corroborating evidence, consider it unlikely that a Muslim Sultan would take orders from Hindu Brahmins or Kabir's own mother demanded that the Sultan punish Kabir, and question the historicity of the legends on Kabir.",
    "Kabir literature legacy was promoted by two of his disciples, Bhāgodās and Dharamdas . Songs of Kabir were collected by Kshitimohan Sen from mendicants across India, these were then translated to English by Rabindranath Tagore .",
    "New English translations of Songs of Kabir is done by Arvind Krishna Mehrotra . August Kleinzahler writes about this: \"It is Mehrotra who has succeeded in capturing the ferocity and improvisational energy of Kabir’s poetry\".",
    "Kabir's legacy continues to be carried forward by the Kabir panth (\"Path of Kabir\"), a religious community that recognises him as its founder and is one of the Sant Mat sects. This community was founded centuries after Kabir died, in various parts of India, over the seventeenth and eighteenth centuries. Its members, known as Kabir panthis , are estimated to be around 9.6 million. They are spread over north and central India, as well as dispersed with the Indian diaspora across the world, up from 843,171 in the 1901 census.",
    "There are two temples dedicated to Kabir located in Benares . One of them is maintained by Hindus , while the other by Muslims. Both the temples practise similar forms of worship where his songs are sung daily. Other rituals of aarti and distributing prasad are similar to other Hindu temples . The followers of Kabir are vegetarians and abstain from alcohol.",
    "Kabir's verses were incorporated into Adi Granth , the scripture of Sikhism , with verses attributed to Kabir constituting the largest non-Sikh contribution.",
    "Some scholars state Kabir's ideas were one of the many influences on Guru Nanak , who went on to found Sikhism in the fifteenth century. Other Sikh scholars disagree, stating there are differences between the views and practices of Kabir and Nanak.",
    "Harpreet Singh, quoting Hew McLeod, states, \"In its earliest stage Sikhism was clearly a movement within the Hindu tradition; Nanak was raised a Hindu and eventually belonged to the Sant tradition of northern India, a movement associated with the noted poet and mystic Kabir.\" Surjit Singh Gandhi disagrees, and writes, \"Guru Nanak in his thought pattern as well as in action model was fundamentally different from Kabir and for that matter other radical Bhaktas or saints (saint has been erroneously used for such Bhaktas by McLeod). Hence to consider Kabir as an influence on Guru Nanak is wrong, both historically and theologically\".",
    "McLeod places Guru Nanak in the Sant tradition that included Kabir and states that their fundamental doctrines were reproduced by Guru Nanak. JS Grewal contests this view and states that McLeod's approach is limiting in its scope because, \"McLeod takes into account only concepts, ignores practices altogether, he concentrates on similarities and ignores all differences\".",
    "Neeraj Arya's Kabir Cafe marries Kabir's couplets with contemporary music adding elements of rock, Karnatic, and folk. Popular renderings include 'Halke Gaadi Haanko', Chadariya Jhini and Chor Awega. Kabir Cafe claims that living their lives just as Kabir suggests has led to them experiencing some of these truths and it reflects in their performances.",
    "Noted classical singer, late Kumar Gandharva , is well recognised for his renderings of Kabir's poetry.",
    "Documentary filmmaker Shabnam Virmani , from the Kabir Project , has produced a series of documentaries and books tracing Kabir's philosophy, music and poetry in present-day India and Pakistan. The documentaries feature Indian folk singers such as Prahlad Tipanya, Mukhtiyar Ali and the Pakistani Qawwal Fareed Ayaz . Kabir festival was organised in Mumbai , India in 2017.",
    "The album No Stranger Here by Shubha Mudgal , Ursula Rucker draws heavily from Kabir's poetry. Kabir's poetry has appeared prominently in filmmaker Anand Gandhi 's films Right Here Right Now (2003) and Continuum. Pakistani Sufi singer Abida Parveen has sung Kabir in a full album. [ citation needed ]",
    "A music album titled Kabeera - The Thinker, by Indo-Canadian Vandana Vishwas features some of the selected Kundaliyaan and rare poems penned by Kabeer Das in a contemporary musical arrangement.",
    "Kabir has been criticised for his depiction of women. Nikky-Guninder Kaur Singh states, \"Kabir's opinion of women is contemptuous and derogatory\". Wendy Doniger concludes Kabir had a misogynist bias. Schomer states that for Kabir, woman is \" kali nagini (a black cobra), kunda naraka ka (the pit of hell), juthani jagata ki (the refuse of the world)\". According to Kabir, a woman prevents man's spiritual progress.",
    "Woman ruins everything when she comes near man; Devotion, liberation, and divine knowledge no longer enter his soul.",
    "In contrast to Singh's interpretation of Kabir's gender views, Dass interprets Rag Asa section of Adi Granth as Kabir asking a young married woman to stop veiling her face, and not to adopt such social habits. Dass adds that Kabir's poetry can be interpreted in two ways, one literally where the woman refers to human female, another allegorically where woman is symbolism for his own soul and Rama is the Lord-husband."
  ],
  "scraped_at": "2025-06-11 06:38:55 UTC"
}