{
  "url": "https://en.wikipedia.org/wiki/Mary_Kom",
  "title": "Mary Kom",
  "paragraph_count": 35,
  "paragraphs": [
    "Mangte Chungneijang \"Mary\" Kom (born 24 November 1982) is an Indian Olympic boxer , politician, and former Member of Rajya Sabha . She is the only woman to win the World Amateur Boxing Championship six times, the only female boxer to have won a medal in each one of the first seven World Championships, and the only boxer (male or female) to win eight World Championship medals. Nicknamed Magnificent Mary , she was the only Indian female boxer to have qualified for the 2012 Summer Olympics , where she competed in the flyweight (51 kg) category and won a bronze medal. She had also been ranked as the world's No. 1 female light-flyweight by the International Boxing Association (amateur) (AIBA). She became the first Indian female boxer to win a gold medal in the Asian Games in 2014 at Incheon , South Korea and is the first Indian female boxer to win gold at the 2018 Commonwealth Games . She is also the only boxer to become Asian Amateur Boxing Champion for a record six times. Mary Kom won the 51kg gold in President's Cup in Indonesia.",
    "On 25 April 2016, the President of India nominated Kom as a member of the Rajya Sabha , the upper house of the Indian parliament . In March 2017, the Ministry of Youth Affairs and Sports , Government of India, appointed Mary Kom along with Akhil Kumar as national observers for boxing.",
    "After her sixth world title in 2018, the Government of Manipur conferred on her the title \"Meethoi Leima\", loosely translated as great or exceptional lady in a felicitation ceremony held in Imphal on 11 December 2018. Mary Kom became the most successful boxer at world championships in 2019. At the function, the then Chief Minister of Manipur also declared that the stretch of road leading to the National Games village in Imphal West district , where Kom currently resides, would be named as MC Mary Kom Road . She was awarded the Padma Vibhushan , India's second highest civilian award, in 2020.",
    "Kom was born in Kagathei village, Moirang Lamkhai in the Churachandpur district of rural Manipur in India. She came from a poor Kom family. Her parents, Mangte Tonpa Kom and Mangte Akham Kom were tenant farmers who worked in jhum fields. They named her Chungneijang. Kom grew up in humble surroundings, helping her parents with farm-related chores, going to school, and learning athletics initially and later boxing simultaneously. Kom's father was a keen wrestler in his younger days. She is the eldest of three children – she has a younger sister and a brother. She hails from a Christian Baptist family.",
    "Kom studied at the Loktak Christian Model High School in Moirang up to her sixth standard and thereafter attended St. Xavier Catholic School, Moirang, up to class 8. During this time, she took a good amount of interest in athletics, especially javelin and 400 meters running . It was at this juncture, Dingko Singh , a fellow Manipuri returned from the 1998 Bangkok Asian games with a gold medal. Kom recollects that this had inspired many youngsters in Manipur to try boxing, and she too thought of giving it a try.",
    "After completing class 8, Kom moved to Adimjati High School, Imphal , for her schooling for classes 9 and 10, but was unable to pass the matriculation exam. Not wishing to reappear for them, she quit her school and took her examination from NIOS, Imphal, and graduated from Churachandpur College.",
    "Kom participated in sports in school, including volleyball, football, and athletics. It was the success of Dingko Singh that inspired her to switch from athletics to boxing in 2000. She started her training under her first coach K. Kosana Meitei in Imphal. When she was 15, she decided to leave her hometown to study at the Imphal Sports Academy. In an interview with the BBC , Meitei remembered her as a dedicated hardworking girl with a strong will power, who picked up the basics of boxing quickly. Thereafter, she trained under the Manipur state boxing coach M. Narjit Singh at Khuman Lampak. Kom kept her interest in boxing a secret from her father, himself an ex-wrestler, as he was concerned that boxing would hurt Kom's face and spoil her chances of marriage. However, he learned of it when Kom's photo appeared in a newspaper after she won the state boxing championship in 2000. After three years, her father began to support Kom's pursuits in boxing as he grew convinced of her love of boxing.",
    "After her marriage, Kom took a short hiatus from boxing. After giving birth to her twins in 2007, Kom started training once again. She won a silver medal at the 2008 Asian Women's Boxing Championship in India and a fourth successive gold medal at the 2008 AIBA Women's World Boxing Championships in China, followed by a gold medal at the 2009 Asian Indoor Games in Vietnam.",
    "In 2010, Kom won the gold medal at the Asian Women's Boxing Championship in Kazakhstan, and at the 2010 AIBA Women's World Boxing Championships in Barbados, her fifth consecutive gold at the championship. She competed in Barbados in the 48 kg weight category, after AIBA had stopped using the 46 kg class. In the 2010 Asian Games , she competed in the 51 kg class and won a bronze medal. In 2011, she won gold in the 48 kg class at the Asian Women's Cup in China.",
    "On 3 October 2010 she, along with Sanjay and Harshit Jain, had the honour of bearing the Queen's Baton in the opening ceremony run in the stadium for the 2010 Commonwealth Games in Delhi. She did not compete, however, as women's boxing was not included in the Commonwealth Games .",
    "Kom, who had previously fought in the 46 and 48 kg categories, shifted to the 51 kg category after the world body decided to allow women's boxing in only three weight categories eliminating the lower weight classes.",
    "At the 2012 AIBA Women's World Boxing Championship , Kom was competing not just for the championship itself but also for a place at the 2012 London Olympics in London, the first time women's boxing had featured as an Olympic sport. She was defeated in the 51 kg quarter-finals by Nicola Adams of the UK. She was the only Indian woman to qualify for the Olympic boxing event, with Laishram Sarita Devi narrowly missing a place in the 60 kg class.",
    "Kom was accompanied to London by her mother. Kom's coach Charles Atkinson could not join her at the Olympic Village as he didn't possess an International Boxing Association (AIBA) 3 Star Certification, which is mandatory for accreditation. She had all her luggage and passport stolen on the way to the selection camp in Bangkok, Thailand for her first Asian Women's Boxing Championships. The first Olympic round was held on 5 August 2012, with Kom defeating Karolina Michalczuk of Poland 19–14 in the third women's boxing match ever to be fought at the Olympics. In the quarter-final, the following day, she defeated Maroua Rahali of Tunisia with a score of 15–6. She faced Nicola Adams of UK in the semi-final on 8 August 2012 and lost the bout 6 points to 11. However, she stood third in the competition and garnered an Olympic bronze medal. In recognition, the Manipur Government awarded her Rs 50 lakhs and two acres of land in a cabinet meeting held on 9 August 2012.",
    "Though keen on representing India at the 2016 Rio Olympics , Kom was not able to qualify for the event. Kom has said that the 2020 Tokyo Olympics will be her last appearance at the Summer Games.",
    "In 2020 Summer Olympics she fought against the Rio Olympics bronze medalist Colombian boxer Ingrit Valencia . As the match ended, the commentator announced the winner on points by split decision. A brief momentarily pause was followed by \"in red,\" another short pause, but by this time Mary Kom, in the blue corner, had put up her fist in celebration and did not follow the rest of the commentary that mentioned \"Ingrit Valencia\". \"I had beaten this girl twice in the past. I couldn't believe that her hand was raised by the referee. I swear, it hadn't struck me that I lost, I was so sure,\" she said in an interview.",
    "On 1 October 2014, Kom won her first gold medal in the boxing at the 2014 Asian Games , held in Incheon , South Korea , by beating Kazakhstan 's Zhaina Shekerbekova in the flyweight (51 kg) summit clash.",
    "On 8 November 2017, she received an unprecedented fifth gold medal (48 kg) at the Asian Boxing Confederation (ASBC) women's boxing championships held at Ho Chi Minh in Vietnam .",
    "The only major international event that she had not won a medal in was the Commonwealth Games, as her category Light flyweight was not included until the 2018 Commonwealth Games . There, Kom won the gold medal in the women's light flyweight 48 kg on 14 April 2018.",
    "On 24 November 2018, she became the first woman to win 6 World Championships, achieving this feat at the 10th AIBA Women's World Boxing Championships held in New Delhi, India.",
    "In October 2019, the International Olympic Committee (IOC) named Kom as a female representative of boxing's athlete ambassadors group for the 2020 Summer Olympics in Tokyo.",
    "In May 2021, Mary Kom won her 7th medal at the Asian Championships but lost the women's 51kg final on Sunday to Nazym Kazaibay . Kom won her first medal at the tournament in 2003 .",
    "In the Asian Boxing Olympic Qualifying rounds held in August 2021, Kom lost to China's Chang Yuan in a semi-final.",
    "Kom appeared on the final episode of the Super Fight League 's mixed martial arts reality show – SFL Challengers. During this time Kom was in talks with owners Raj Kundra and Sanjay Dutt to work with the SFL in some manner other than being a fighter.",
    "On 24 September 2012, the Super Fight League announced that Kom would serve as the SFL's brand ambassador.",
    "Mary Kom  was a set a new standard in amateur boxing without ever competing in professional boxing. In 2015, Kom became the first amateur to surpass several professional athletes in India in earnings, endorsements and awards. She is the first amateur athlete to win the Padma Bhushan.",
    "Her autobiography, Unbreakable , was co-authored by Dina Serto and published by HarperCollins in late 2013. An excerpt from this biography has been given as a prose lesson in Samacheer Kalvi English textbook for 11th standard. [ citation needed ]",
    "Priyanka Chopra portrayed Kom in Mary Kom , a 2014 Hindi language biographical film about her life. The movie is directed by Omung Kumar and was released on 5 September 2014.",
    "The Good Night Stories for Rebel Girls , a children's book which features short stories about female role models to children, includes an entry on Mary Kom.",
    "Kom also features in the 2016 documentary With This Ring , which follows the experiences of India's women's boxing team across a span of six years, from 2006 to 2012.",
    "Kom was married to the footballer Karung Onkholer (Onler). Kom first met her husband in 2000 after her luggage was stolen while travelling by train to Bangalore. In New Delhi while on her way to the National Games in Punjab she met Onkholer who was studying law at Delhi University . Onkholer was the president of the North East students body and helped Kom. They became friends and thereafter began dating each other. After four years they were married in 2005.",
    "Together they have three sons, twins born in 2007, and another son born in 2013. In 2018, Kom and her husband adopted a girl named Merilyn.",
    "They were divorced in December 2023.",
    "Kom is an animal rights activist, and supporter of People for the Ethical Treatment of Animals (PETA) India, starring in an ad to call for an end to the use of elephants in circuses. \"Circuses are cruel places for animals where they are beaten and tortured. As a mother, I can imagine what animals go through when their children are taken away from them to forcefully perform in circuses. It's sad,\" Kom has been quoted in the media.",
    "Kom has also backed PETA India's humane education campaign, Compassionate Citizen. She has written a letter to the education ministers of states and union territories across India requesting that the programme be incorporated into official school curriculums.",
    "In an interview in the Times of India she was quoted as saying, \"One of the best ways to knock out cruelty to animals is to teach compassion to young people. Animals need us in their corner. With violence seemingly all around us, it is more important than ever that we teach lessons of respect and kindness in the classroom.\""
  ],
  "scraped_at": "2025-06-11 06:39:40 UTC"
}