{
  "url": "https://en.wikipedia.org/wiki/Medha_Patkar",
  "title": "Medha Patkar",
  "paragraph_count": 30,
  "paragraphs": [
    "Medha Patkar (born 1 December 1954) is an Indian Social activist working on social issues for tribals , dalits , farmers, labourers and women facing injustice in India. She is an alumna of TISS , a premier institute of social science research in India.",
    "Patkar is a founding member of Narmada Bachao Andolan with Afroz Ahmad in Madhya Pradesh , Maharashtra and Gujarat . She is also one of the founders of the National Alliance of People's Movements (NAPM), an alliance of hundreds of progressive people's organizations. In addition to the above, Patkar was a commissioner on the World Commission on Dams , which did thorough research on the environmental, social, political and economic aspects and impacts of the development of large dams globally and their alternatives. She was the national co-ordinator and then convenor of National Alliance of People's Movements for many years and now continues to be an advisor to NAPM. Under the banner of NAPM, she has participated in and supported various mass struggles across India against inequity, non-sustainability, displacement, and injustice in the name of development. She challenges Casteism , Communalism , and all forms of discrimination in her work. She has been a part of numerous teams and panels that work on initiating and formulating various national policies and enactments including those related to land acquisition, unorganized sector workers, hawkers , slum-dwellers and forest-dweller Adivasis. NAPM filed several public interest litigations including those against Adarsh society, Lavasa Megacity, Hiranandani ( Powai ) and as well as other builders.",
    "In 2000, Medha Patkar was included in the 100 heroes of the 20th century by Time. However, noted Economist Swaminathan has criticized Medha Patkar in hindsight, saying she was wrong on the Narmada project. The Then Prime Minister Modi said that Medha Patkar and her “urban Naxal” friends had opposed and delayed the Narmada project that had greatly benefited Gujarat.” Expansion of the project in subsequent years has further brought further benefits from the dam, with irrigation water now available throughout the year to farmers across the states of Madhya Pradesh, Gujarat, Maharashtra, and Rajasthan.",
    "In July 2024, Medha Patkar was sentenced to five months jail and was ordered to pay 10 lakh rupees compensation in a defamation case filed by the then Lieutenant Governor of Delhi Vinai Kumar Saxena by a Delhi court. The sentence was also suspended by the court for one month.",
    "Medha Patkar was born as Medha Khanolkar on 1 December 1954 in Mumbai, Maharashtra, the daughter of Vasant Khanolkar, a freedom fighter, and labour union leader, and his wife Indumati Khanolkar, a gazetted officer in the Post and Telegraphs Department. She has one brother, Mahesh Khanolkar, an architect.",
    "Medha Khanolkar earned an MA in Social Work from Tata Institute of Social Sciences . She was married for seven years (hence her surname Patkar) but the marriage ended in divorce.",
    "Medha Patkar worked with voluntary organizations in Mumbai 's slums for 5 years and tribal districts of North-East districts of Gujarat for three years. She worked as a member of the faculty at Tata Institute of Social Sciences but left her position to take up the fieldwork. She was a Ph.D. scholar at TISS, studying Economics development and its impact on traditional societies. After working up to M.Phil. level she left her unfinished Ph.D. when she became immersed in her work with the tribal and peasant communities in the Narmada valley spread over three states.",
    "Narmada Bachao Andolan (NBA) is a social movement protesting against the dam on river Narmada which began in 1985 consisting of Adivasis, farmers, fish workers, labourers, and others in the Narmada valley along with the intellectuals including environmentalists, human rights activists, Scientists, academics, artists who stand for just and sustainable development. Sardar Sarovar Dam in Gujarat is one of the biggest dams on Narmada where the non-violent people's struggle has questioned social and environmental costs, undemocratic planning, and unjust distribution of benefits. The struggle is still on in the Sardar Sarovar affected areas and also other large and medium dams on Narmada and its tributaries. It has led to thousands of project-affected families receiving land-based rehabilitation and continues to fight against submergence and displacement without rehabilitation of more than 40,000 families residing in these submergence areas of Sardar Sarovar to date. Few of the claims and critique on economic, social, and environmental aspects of the Sardar Sarovar and Narmada valley development project stand vindicated today. Patkar has also questioned the wisdom of the currently popular developmental strategy of linking rivers in India as a means to address issues of water shortage.",
    "NBA has been running Jeevan shalas- schools of life, since 1992. NBA also successfully established and managed a micro-hydro projects which got submerged due to the flood in the Narmada Valley .",
    "Critics argue that dam's benefits include provision of drinking water, power generation and irrigation facilities. However, it is believed that the campaign, led by the NBA activists, has held up the project's completion, and NBA supporters have attacked on local people who accepted compensation for moving. Others have argued that the Narmada Dam protesters are little more than environmental extremists, who use pseudoscientific agitprop to scuttle the development of the region and that the dam will provide agricultural benefits to millions of poor in India. There had also been instances of the NBA activists turning violent and attacking rehabilitation officer from Narmada Valley Development Authority (NVDA), which caused damage to the contractor's machinery.",
    "The NBA has been accused of lying under oath in court about land ownership in areas affected by the dam. The Supreme Court has mulled perjury charges against the group.",
    "It is a struggle for housing rights in Mumbai, started in 2005, and continues to fight for the rights of slum-dwellers and those created by the builders in various rehabilitation and re-development projects. It all began when the government of Maharashtra demolished 75,000 houses of the poor in 2005, against its promises before the election. Strong people's movement was founded by Medha Patkar and others when she gave the slogan in a large public meeting at Azaad Maidaan Mumbai. It was through mass action that the communities were rebuilt on the same sites and continued to assert and attain their right to shelter water, electricity, sanitation, and livelihood. As members of working-class GBGBA respect the slum-dwellers for contribution to the life of the city and involve them inequitable and inclusive planning for urban development.",
    "The National Alliance of People's Movements (NAPM) is an alliance of people's movements in India, with the stated aim of working on a range of issues related to socio-economic justice, political justice, and equity. Medha Patkar founded the National Alliance of People's Movements with the objective of \"facilitating unity and providing strength to peoples' movements in India, fighting against oppression, further questioning the current development model to work towards a just alternative\". She is the national convener of the NAPM.",
    "Tata Motors started constructing a factory to manufacture their $2,500 car, the Tata Nano at Singur. She protested against the setting up of the plant at Singur , West Bengal. Patkar's convoy was assaulted, allegedly by CPI(M) activists, at Kapaseberia in East Midnapore district while on her way to strife-torn Nandigram. At the height of the agitation, Ratan Tata had made remarks questioning the source of funds of the agitators. In October 2008 Tata announced that the factory would not be completed and that the production of the Nano will be set up in Sanand , Gujarat.",
    "She participated in and initiated various supportive actions including a fast during Diwali in Kolkata, mass-mobilization, complaints at various national fora, and building support of intellectuals and various citizens across the country. The battle was ultimately won in favor of the local people who had to lay their lives in large numbers during state violence.",
    "Lavasa is a project by Hindustan Construction Corporation, in Maharashtra. It is a yet-to-be-completed city. Lavasa Project is criticized by P. Sainath for unjust use of water in a worst-hit farmer suicide state. Medha Patkar with villagers of Lavasa protested for the environmental damage in Nagpur . She also filed a PIL in Supreme Court against the Lavasa project.",
    "Demolition took place on 2 and 3 April 2013 in the Golibar area, Mumbai, Maharashtra evicting 43 houses and displacing more than 200 people. the whole project is to displace thousands of families and 50–100 years old communities that are demanding in-situ and participatory housing rights. Medha Patkar with more than 500 slum dwellers set on indefinite fast to protest against any further demolition until the inquiry into the matter is completed. Patkar has alleged corruption and \"atrocities\" by builders in the city's slum rehabilitation scheme and called for the halting of six projects by the Slum Rehabilitation Authority until a proper inquiry is conducted. The inquiry was conducted giving partial solutions hence communities continue with their struggle.",
    "To save the Sugar-Cooperative sector in Maharashtra from falling into the hands of politicians including tens of ministers in the Maharashtra cabinet till 2014, Medha Patkar organized protests. She explained that \"the politicians are interested in the prime plots of land, old equipment, and machinery,\" of sugar co-operatives and accused the state government of selling assets of the industry at throw-away rates. A case against Girna Sugar factory at Malegaon, Nasik, Maharashtra and members of Chhagan Bhujbal Family pending before the Supreme court of India and the unused land of the factory is re-occupied and cultivated by the local farmers who were the donors of the cooperative that was privatized by the former minister purchasing it at a throwaway price.",
    "Medha Patkar along with other activists registered in PIL in the High Court of Mumbai, alleging violations by property tycoon Niranjan Hiranandani in building luxury flats instead of affordable houses. Hiranandani had signed a lease for the 230 acres of land in 1986 at a rate of Re 1 per hectare in a tripartite agreement with the state and Mumbai Metropolitan Region Development Authority. Responding to PIL Maharashtra High Court judges say that\" we appreciate the elegance of the construction and the intent on creating an architectural marvel for the city of Mumbai, we see the specific intent of wholly ignoring the most vital, and perhaps the only, condition in tripartite agreement (to create affordable houses of 40 and 80 sq m)\". If calculated according to the current market price, the quantum of the scam will be around Rs. 450  billion. The judgment of 2012 directed Hirandani to build 3,144 houses for the low-income groups before any other construction at Hiranandani gardens which is yet to happen. The case is at the stage of final hearing at HC of Mumbai as of March 2021.",
    "Patkar expressed strong opposition to the land acquisition in Kovvada of Ranasthalam Mandal in Srikakulam district, Andhra Pradesh saying that the nuclear plant would be a disaster for ecology as well as people of the region.",
    "Patkar said what the state needed was development not destruction. She was speaking at a protest meet against the CPM-led Kerala government's ambitious SilverLine semi high speed rail corridor project on 24 March 2022. \"This has become an internal war. This is not Ukraine, this is Kerala. This is to save our country from the high speed development tragedy,\" she said.",
    "Patkar has been opposing the JSW steel project in Odisha citing environmental reasons. However in June 2022, when she tried to meet her aide at Dhinsukia village in Odisha, the villagers opposed her presence and protested following which police intervened and Patkar had to go back.",
    "In January 2004 during the World Social Forum held in Mumbai . Medha Patkar and other members of National Alliance of People's Movement initiated a Political Party 'People's Political Front ' also called as 'Lok Rajniti Manch'. However, Medha did not participate as an active politician but adhered herself to creating an atmosphere and environment by organizing a fifteen days Maharashtra state-level campaign. She was accompanied by two young activists, Maju Varghese and journalist Jaspal Singh Naol (Jal). Meetings were organized under her leadership in each district of Maharashtra . Most of the members had asked Patkar to stand for election, but she denied it.",
    "In January 2014, Medha Patkar joined the Aam Aadmi Party , a political party led by Arvind Kejriwal . She and her organization, National Alliance of People's Movement, provided support to the Aam Aadmi Party during the Lok Sabha campaign.",
    "Patkar also contested the 2014 Lok Sabha election for the Mumbai North East Mumbai constituency as an Aam Aadmi Party candidate. She lost, receiving 8.9% of the vote cast in North East Mumbai constituency, trailing at third position behind Kirit Somaiya (BJP candidate, winner) and Sanjay Patil (NCP candidate). She resigned from Aam Aadmi Party's primary membership on 28 March 2015.",
    "On 16 November 2022, she participated in the Bharat Jodo Yatra led by Congress party leader Rahul Gandhi in Washim , Maharashtra.",
    "On 1 July 2024, a Delhi court sentenced Patkar to five months of imprisonment in a criminal defamation case lodged over two decades ago by the Lieutenant Governor of Delhi , Vinai Kumar Saxena . The case stemmed from an incident in 2001 when Saxena, then president of the National Council for Civil Liberties (NCCL) , filed a defamation suit against Patkar.",
    "In 2000, the NCCL published an advertisement criticizing Patkar's opposition to the construction of a dam on the Narmada River. In response, In response, Patkar issued a press statement in which she made derogatory remarks about Saxena. She also approached the court alleging that Saxena published newspaper advertisement against her and Narmada Bachao Andolan . Feeling aggrieved by Patkar's comments, Saxena filed a criminal defamation suit against her in a local court in Ahmedabad, which later transferred the case to the Saket Court in Delhi in 2003 following a Supreme Court order.",
    "On 24 May 2024, Metropolitan Magistrate Raghav Sharma of the Saket Court convicted Patkar of criminal defamation under Section 500 of the Indian Penal Code . The court ruled that Patkar's actions were deliberate and malicious , asserting that her statements directly attacked Saxena's personal character and loyalty to the nation. The court also noted that Patkar had failed to provide evidence countering the claims of intended or foreseeable harm caused by her imputations.",
    "Despite rejecting Patkar's request for release on probation, the court considered her age and health conditions and chose not to impose the maximum punishment of one to two years of imprisonment. Instead, Patkar was sentenced to five months of simple imprisonment and mandated Patkar to pay ₹10 lakh in compensation to Saxena."
  ],
  "scraped_at": "2025-06-11 06:41:44 UTC"
}