{
  "url": "https://en.wikipedia.org/wiki/Mirabai",
  "title": "Mirabai",
  "paragraph_count": 34,
  "paragraphs": [
    "Meera , better known as Mirabai , and venerated as Sant Meerabai , was a 16th-century Hindu mystic poet and devotee of Krishna . She is a celebrated Bhakti saint, particularly in the North Indian Hindu tradition. She is mentioned in Bhaktamal , confirming that she was widely known and a cherished figure in the Bhakti movement by about 1600. In her poems, she had madhurya bhava towards Krishna.",
    "Most legends about Mirabai mention her fearless disregard for social and family conventions, her devotion to Krishna, and her persecution by her in-laws for her religious devotion. Her in-laws never liked her passion for music, through which she expressed her devotion, and they considered it an insult of the upper caste people. It is said that amongst her in-laws, her husband was the only one to love and support her in her Bhakti , while some believed him to have opposed it. She has been the subject of numerous folk tales and hagiographic legends, which are inconsistent or widely different in details. According to a legend, when her in-laws attempted to murder her with poison, Mirabai tied a thread on Krishna's idol, trusting in his divine protection, through which she was saved by Krishna through divine intervention . This legend is sometimes cited as the origin of the ritual of tying rakhi to God's idol.",
    "Millions of devotional hymns in passionate praise of Krishna are attributed to Mirabai in the Indian tradition, but just a few hundred are believed to be authentic by scholars, and the earliest written records suggest that except for two hymns, most were first written down in the 18th century. Many poems attributed to Mirabai were likely composed later by others who admired Mirabai. These hymns are a type of Bhajan , and are very famous across India.",
    "Some Hindu temples, such as Chittor Fort , are dedicated to Mirabai's memory. Legends about Mirabai's life, of contested authenticity, have been the subject of movies, films, comic strips and other popular literature in modern times.",
    "Primary records about Meera are not available, and scholars have attempted to establish Meera's biography from secondary literature that mentions her.",
    "Mirabai was born into a Rathore Rajput royal family in Kudki (modern-day Beawar district of Rajasthan ), and spent her childhood in Merta . She was the daughter of Ratan Singh Rathore and grand daughter of Rao Dudaji of Merta.",
    "Meera unwillingly married Bhoj Raj , the crown prince of Mewar , in 1516. Her husband was wounded in one of the ongoing wars with the Delhi Sultanate in 1518, and he died from battle wounds in 1521. Both her father and father-in-law ( Rana Sanga ) died a few days after their defeat in the Battle of Khanwa against Babur , the first Mughal Emperor .",
    "After the death of Rana Sanga, Vikram Singh became the ruler of Mewar. According to a popular legend, her in-laws tried to assassinate her multiple times. These attempts included sending Meera a glass of poison and telling her it was nectar, and sending her a basket with a snake instead of flowers. According to hagiographic legends, she was not harmed in either case, with the snake miraculously becoming, depending on the version, a Krishna idol or a garland of flowers. In another version of these legends, she is asked by Vikram Singh to drown herself. When she attempts to do so, she merely floats on the water. Yet another legend states that the third Mughal emperor, Akbar , came with Tansen to visit Meera and presented her with a pearl necklace. Scholars doubt this happened, as Tansen joined Akbar's court in 1562, 15 years after Meera's death. Similarly, some stories state that Ravidas was her guru (teacher), but there is no corroborating historical evidence for this.",
    "As of 2014, the three oldest records that mention Meera are all from the 17th century and written within 150 years of Meera's death. Neither mentions anything about her childhood, the circumstances of her marriage to Bhojraj or that the people who persecuted her were her in-laws or from some Rajput royal family. Nancy Martin-Kershaw states that to the extent that Meera was challenged and persecuted, religious or social conventions were unlikely to have been the cause, rather the likely cause was political chaos and military conflicts between the Rajput kingdom and the Mughal Empire.",
    "Other stories state that Mira Bai left the kingdom of Mewar and went on pilgrimages. In her last years, Meera lived in Dwarka or Vrindavan , where legends state she miraculously disappeared by merging into an idol of Krishna after being poisoned by her brother-in-law in 1547. While miracles are contested by scholars for the lack of historical evidence, it is widely acknowledged that Meera dedicated her life to Krishna, composing songs of devotion, and was one of the most important poet-saints of the Bhakti movement period.",
    "A number of compositions by Meera Bai continue to be sung today in India, mostly as devotional songs ( bhajans ) towards Krishna , though nearly all of them have a philosophical connotation. Her poems describe her love, salutation, and separation from Krishna, and her dissatisfaction with the world. One of her most popular compositions remains \" Payoji maine Ram Ratan dhan payo \" (पायो जी मैंने राम रतन धन पायो।, \"I have been given the richness of God's name blessing\"). Meera's poems are lyrical padas (metric verses) in the Rajasthani language . Several meters are used within her padas , but the most common meter found is mātric (syllabic) poetic line. Rāgas or melodies are attributed to these padas , allowing them to be sung. While thousands of verses are attributed to her, scholars are divided as to how many of them were actually penned by Meera herself. There are no surviving manuscripts of her poetry from her time, and the earliest records with two poems credited to her are from the early 18th century, more than 150 years after her legendary disappearance in 1547.",
    "The most extensive collection of Meera's poems exists in manuscripts from the 19th century. To establish the authenticity of the poems, scholars have looked at various factors such as the mention of Meera in other manuscripts, as well as the style, language, and form of the poems. John Stratton Hawley cautions, \"When one speaks of the poetry of Mirabai, then, there is always an element of enigma. [...] There must always remain a question about whether there is any real relation between the poems we cite and a historical Mira.\"",
    "In her poems, Krishna is a yogi and lover, and she herself is a yogini ready to take her place by his side in a spiritual marital bliss. Meera's style combines impassioned mood, defiance, longing, anticipation, joy and ecstasy of union, always centred on Krishna.",
    "My Dark One has gone to an alien land. He has left me behind, he's never returned, he's never sent me a single word. So I've stripped off my ornaments, jewels, and adornments, and cut my hair from my head. And put on holy garments, all on his account, seeking him in all four directions. Mira: unless she meets the Dark One, her God, she doesn't even want to live.",
    "Meera speaks of a personal relationship with Krishna as her lover, God and mountain lifter. The characteristic of her poetry is complete surrender.",
    "After making me fall for you so hard, where are you going? Until the day I see you, no repose: my life, like a fish washed on shore, flails in agony. For your sake I'll make myself a yogini, I'll hurl myself to death on the saw of Kashi. Mira's God is the clever Mountain Lifter, and I am his, a slave to his lotus feet.",
    "Meera is often classed with the northern Sant bhaktis, who spoke of Krishna.",
    "There is a small chhatri (pavilion) in front of Meera's temple in Chittorgarh district of Rajasthan which bears Ravidas' engraved foot print. Legends link him as the guru of Mirabai, another major Bhakti movement poet.",
    "Queen Mira Bai composed a song dedicated to Guru Ravidas where she mentioned him as her Guru.",
    "Sadguru sant mile Ravidas Mira devaki kare vandana aas Jin chetan kahya dhann Bhagavan Ravidas",
    "--  \"I got a guru in the form of Sant Ravidas, there by obtaining life's fulfillment.\"",
    "When the Adi Granth was compiled in 1604, a copy of the text was given to a Sikh named Bhai Banno who was instructed by Guru Arjan to travel to Lahore to get it bound. While doing so, he made a copy of the codex, which included compositions of Mirabai. These unauthorized additions were not included in the standardized edition of the scripture by the Sikh gurus, who rejected their inclusion.",
    "Prem Ambodh Pothi , a text attributed to Guru Gobind Singh and completed in 1693 CE, includes poetry of Mira Bai as one of sixteen historic bhakti saints important to Sikhism .",
    "Scholars acknowledge that Meera was one of the central poet-saints of the Bhakti movement, a period in Indian history rife with religious conflicts. Yet, they simultaneously question the extent to which Meera was a canonical projection of social imagination that followed, where she became a symbol of people's suffering and a desire for an alternative. Dirk Wiemann, quoting Parita Mukta, states,",
    "If one accepts that someone very akin to the Mira legend [about persecution and her devotion] existed as an actual social being, the power of her convictions broke the brutal feudal relationships that existed at that time. The Mira Bai of the popular imagination, then, is an intensely anachronistic figure by virtue of that anticipatory radical democracy which propels Meera out of the historicity that remains nonetheless ascribed to her. She goes beyond the shadowy realms of the past to inhabit the very core of a future which is embodied within the suffering of a people who seek an alternative.",
    "The continued influence of Meera, in part, has been her message of freedom, her resolve and right to pursue her devotion to Krishna and her spiritual beliefs as she felt drawn to despite her persecution. Her appeal and influence in Indian culture, writes Edwin Bryant, is from her emerging, through her legends and poems, as a person \"who stands up for what is right and suffers bitterly for holding fast to her convictions, as other men and women have\", yet she does so with a language of love, with words painting the \"full range of emotions that mark love, whether between human beings or between human and divine\".",
    "English translations of Meera's poems titled Mystic Songs of Meera and The Devotional Poems of Mirabai have been written by A.J. Alston and V.K. Subramanian respectively. Some bhajans of Meera have been rendered into English by Robert Bly and Jane Hirshfield as Mirabai: Ecstatic Poems . Schelling and Landes-Levi have offered anthologies in the USA. Snell has presented parallel translations in his collection The Hindi Classical Tradition . Sethi has selected poems which Meera composed presumably after she came in contact with Ravidas .",
    "Composer John Harbison adapted Bly's translations for his Mirabai Songs.",
    "The 1997 novel Cuckold , by Kiran Nagarkar , features her as one of the central characters.",
    "In 2002, Indian film director Anjali Panjabi released a documentary film about Meera, titled A Few Things I Know About Her .",
    "In 2009, Meera Bai's life was interpreted as a musical story in Meera—The Lover… , a music album based on original compositions for some well known bhajans attributed to her. James , a Bangladeshi musician, dedicated his song \"Mirabai\" to her.",
    "The Meera Mahal in Merta is a museum dedicated to telling the story of Mirabai through sculptures, paintings, displays, and a shaded garden.",
    "Two well-known films of her life have been made in India: Meera (1945), a Tamil language film starring M. S. Subbulakshmi , and Meera (1979), a Hindi film by Gulzar , in which she is portrayed by actress Hema Malini . Other Indian films about her include: Meerabai (1921) by Kanjibhai Rathod , Sant Mirabai (1929) by Dhundiraj Govind Phalke , Rajrani Meera / Meerabai (1933) by Debaki Bose , Meerabai (1936) by T. C. Vadivelu Naicker and A. Narayanan, Sadhvi Meerabai (1937) by Baburao Painter , Bhakta Meera (1938) by Y. V. Rao , Meerabai (1940) by Narasimha Rao Bhimavarapu, Meera (1947) by Ellis Dungan , Matwali Meera (1947) by Baburao Patel , Meerabai (1947) by W. Z. Ahmed , Meerabai (1947) by Nanabhai Bhatt , Girdhar Gopal Ki Mira (1949) by Prafulla Roy, Raj Rani Meera (1956) by G. P. Pawar, Meera Shyam (1976), Meera Ke Girdhar (1992) by Vijay Deep.",
    "Mirabai, a 26-episode series based on her life, starring Mrinal Kulkarni, was produced by UTV in 1997. Meera , a 2009 Indian television series based on her life, aired on NDTV Imagine . Shree Krishna Bhakto Meera , a 2021 Indian Bengali mythological television series based on her life, aired on Star Jalsha . Her life was also chronicled in the longest running mythological show, Vighnaharta Ganesh , where Lord Ganesh narrates her story to one of Lord Shiva 's gana, Pushpadanta. Mira was portrayed by Lavina Tandon , while Krishna's role was essayed by Hitanshu Jinsi."
  ],
  "scraped_at": "2025-06-11 06:38:46 UTC"
}