{
  "url": "https://en.wikipedia.org/wiki/Narendra_Modi",
  "title": "Narendra Modi",
  "paragraph_count": 92,
  "paragraphs": [
    "Narendra Damodardas Modi (born 17 September 1950) is an Indian politician who has served as the prime minister of India since 2014. Modi was the chief minister of Gujarat from 2001 to 2014 and is the member of parliament (MP) for Varanasi . He is a member of the Bharatiya Janata Party (BJP) and of the Rashtriya Swayamsevak Sangh (RSS), a right-wing Hindutva paramilitary volunteer organisation. He is the longest-serving prime minister outside the Indian National Congress .",
    "Modi was born and raised in Vadnagar , Bombay State (present-day Gujarat ), where he completed his secondary education. He was introduced to the RSS at the age of eight. Modi became a full-time worker for the RSS in Gujarat in 1971. The RSS assigned him to the BJP in 1985 and he rose through the party hierarchy, becoming general secretary in 1998. In 2001, Modi was appointed chief minister of Gujarat and elected to the legislative assembly soon after. His administration is considered complicit in the 2002 Gujarat riots , and has been criticised for its management of the crisis. According to official records, a little over 1,000 people were killed, three-quarters of whom were Muslim; independent sources estimated 2,000 deaths, mostly Muslim. A Special Investigation Team appointed by the Supreme Court of India in 2012 found no evidence to initiate prosecution proceedings against him. While his policies as chief minister were credited for encouraging economic growth, his administration was criticised for failing to significantly improve health, poverty and education indices in the state.",
    "In the 2014 Indian general election , Modi led the BJP to a parliamentary majority, the first for a party since 1984 . His administration increased direct foreign investment , and reduced spending on healthcare, education, and social-welfare programmes. Modi began a high-profile sanitation campaign , and weakened or abolished environmental and labour laws. His demonetisation of banknotes in 2016 and introduction of the Goods and Services Tax in 2017 sparked controversy. Modi's administration launched the 2019 Balakot airstrike against an alleged terrorist training camp in Pakistan. The airstrike failed, but the action had nationalist appeal. Modi's party won the 2019 general election which followed. In its second term, his administration revoked the special status of Jammu and Kashmir , and introduced the Citizenship Amendment Act , prompting widespread protests , and spurring the 2020 Delhi riots in which Muslims were brutalised and killed by Hindu mobs. Three controversial farm laws led to sit-ins by farmers across the country, eventually causing their formal repeal. Modi oversaw India's response to the COVID-19 pandemic , during which, according to the World Health Organization 's estimates, 4.7 million Indians died. In the 2024 general election , Modi's party lost its majority in the lower house of Parliament and formed a government leading the National Democratic Alliance coalition. Modi presided over the 2025 India–Pakistan conflict, which resulted in a ceasefire.",
    "Under Modi's tenure, India has experienced democratic backsliding and shifted towards an authoritarian style of government with a personality cult. As prime minister, he has received consistently high approval ratings within India. Modi has been described as engineering a political realignment towards right-wing politics . He remains a highly controversial figure domestically and internationally, over his Hindu nationalist beliefs and handling of the Gujarat riots, which have been cited as evidence of a majoritarian and exclusionary social agenda.",
    "Narendra Damodardas Modi was born on 17 September 1950 to a Gujarati family of Other Backward Class (OBC) background and Hindu faith in Vadnagar , Mehsana district , Bombay State (present-day Gujarat ). He was the third of six children born to Damodardas Mulchand Modi ( c. 1915–1989 ) and Hiraben Modi (1923–2022). According to Modi and his neighbours, he worked infrequently worked in his father's tea stall in the Vadnagar railway station .",
    "Modi completed his higher secondary education in Vadnagar in 1967; his teachers described him as an average student and a keen, gifted debater with an interest in theatre. He preferred playing larger-than-life characters in theatrical productions, which has influenced his political image.",
    "When Modi was eight years old, he was introduced to the Rashtriya Swayamsevak Sangh (RSS) and began attending its local shakhas (training sessions). There, he met Lakshmanrao Inamdar , who inducted Modi as a balswayamsevak (junior cadet) in the RSS and became his political mentor. While Modi was training with the RSS, he also met Vasant Gajendragadkar and Nathalal Jaghda, Bharatiya Jana Sangh leaders who in 1980 helped found the BJP's Gujarat unit. As a teenager, he was enrolled in the National Cadet Corps .",
    "In a custom traditional to Narendra Modi's caste, his family arranged a betrothal to Jashodaben Chimanlal Modi , leading to their marriage when she was 17 and he was 18. Soon afterwards, he abandoned his wife, and left home. The couple never divorced but the marriage was not in his public pronouncements for many decades. In April 2014, shortly before the national election in which he gained power, Modi publicly affirmed he was married and that his spouse was Jashodaben. A Modi biographer wrote that Modi kept the marriage a secret because he would not have been able to become a pracharak in the RSS, for which celibacy had once been a requirement.",
    "Modi spent the following two years travelling across northern and north-eastern India. In mid 1968, Modi reached Belur Math but was turned away, after which he visited Calcutta , West Bengal and Assam , stopping in Siliguri and Guwahati . He then went to the Ramakrishna Ashram in Almora , where he was again rejected, before returning to Gujarat via Delhi and Rajasthan in 1968 to 1969. In either late 1969 or early 1970, he returned to Vadnagar for a brief visit before leaving again for Ahmedabad , where he lived with his uncle and worked in his uncle's canteen at Gujarat State Road Transport Corporation . Vivekananda has had a large influence in Modi's life.",
    "In Ahmedabad, Modi renewed his acquaintance with Inamdar. Modi's first-known political activity as an adult was in 1971 when he joined a Jana Sangh Satyagraha in Delhi led by Atal Bihari Vajpayee to enlist to fight in the Bangladesh Liberation War . The Indira Gandhi -led central government prohibited open support for the Mukti Bahini ; according to Modi, he was briefly held in Tihar Jail . After the Indo-Pakistani War of 1971 , Modi left his uncle's employment and became a full-time pracharak (campaigner) for the RSS, working under Inamdar. Shortly before the war, Modi took part in a non-violent protest in New Delhi against the Indian government, for which he was arrested; because of this arrest, Inamdar decided to mentor Modi. According to Modi, he was part of a Satyagraha that led to a political war.",
    "In 1978, Modi received a Bachelor of Arts (BA) degree in political science from the School of Open Learning at the Delhi University . In 1983, he received a Master of Arts (MA) degree in political science from Gujarat University , graduating with a first class as an external distance learning student. There is a controversy surrounding the authenticity of his BA and MA degrees.",
    "In June 1975, Prime Minister Indira Gandhi declared a state of emergency in India that lasted until 1977. During this period, known as \"the Emergency\", many of her political opponents were jailed and opposition groups were banned. Modi was appointed general secretary of the \"Gujarat Lok Sangharsh Samiti\", an RSS committee coordinating opposition to the Emergency in Gujarat. Shortly afterwards, the RSS was banned. Modi was forced to go underground in Gujarat and frequently travelled in disguise to avoid arrest, once dressing as a monk and once as a Sikh . He became involved in the printing of pamphlets opposing the government, sending them to Delhi and organising demonstrations. He was also involved with creating a network of safe houses for individuals who were wanted by the government, and in raising funds for political refugees and activists. During this period, Modi wrote a Gujarati-language book titled Sangharsh Ma Gujarat ( In the Struggles of Gujarat ), which describes events during the Emergency. While in this role, Modi met trade unionist and socialist activist George Fernandes and several other national political figures.",
    "Modi became an RSS sambhag pracharak (regional organiser) in 1978, overseeing activities in Surat and Vadodara , and in 1979, he went to work for the RSS in Delhi, where he researched and wrote the RSS's history of the Emergency. Shortly after, he returned to Gujarat and in 1985, the RSS assigned him to the BJP. In 1987, Modi helped organise the BJP's campaign in the Ahmedabad municipal election, which the party won comfortably; according to biographers, Modi's planning was responsible for the win. After L. K. Advani became president of the BJP in 1986, the RSS decided to place its members in important positions within the party; Modi's work during the Ahmedabad election led to his selection for this role. Modi was elected organising secretary of the BJP's Gujarat unit later in 1987.",
    "Modi rose within the party and was named a member of its National Election Committee in 1990, helping organise Advani's Ram Rath Yatra in 1990 and Murli Manohar Joshi 's 1991–1992 Ekta Yatra (Journey for Unity). Modi took a brief break from politics in 1992 to establish a school in Ahmedabad, and due to friction with Shankersinh Vaghela , a BJP MP from Gujarat. Modi returned to electoral politics in 1994, partly at the insistence of Advani; as party secretary, Modi's electoral strategy was considered central to the BJP victory in the 1995 state assembly election . In November of that year, Modi was appointed BJP national secretary and transferred to New Delhi, where he assumed responsibility for party activities in Haryana and Himachal Pradesh . The following year, Shankersinh Vaghela, a prominent BJP leader from Gujarat, defected to the Indian National Congress after losing his parliamentary seat in the Lok Sabha election. Modi, who was on the selection committee for the 1998 Gujarat Legislative Assembly election , favoured supporters of BJP leader Keshubhai Patel over those supporting Vaghela to end factional division in the party. His strategy was credited as central to the BJP winning an overall majority in the 1998 election, and Modi was promoted to BJP general secretary (organisation) in May of that year.",
    "In 2001, Keshubhai Patel 's health was failing, and the BJP lost a few state assembly seats in by-elections . Allegations of abuse of power, corruption and poor administration were made, and Patel's standing had been damaged by his administration's handling of the earthquake in Bhuj in 2001 . The BJP national leadership sought a new candidate for the chief ministership, and Modi, who had expressed misgivings about Patel's administration, was chosen as a replacement. Advani did not want to ostracise Patel and was concerned about Modi's lack of experience in government. Modi declined an offer to become Patel's deputy chief minister , telling Advani and Atal Bihari Vajpayee he was \"going to be fully responsible for Gujarat or not at all\". On 3 October 2001, Modi replaced Patel as Chief Minister of Gujarat with the responsibility of preparing the BJP for the upcoming December 2002 election. On 7 October, Modi was sworn in and he entered the Gujarat state legislature on 24 February 2002 after winning a by-election in Rajkot II constituency, defeating Ashwin Mehta of the INC.",
    "On 27 February 2002, a train with several hundred passengers burned near Godhra , killing approximately 60 people. The train carried a large number of Hindu pilgrims who were returning from Ayodhya after a religious ceremony at the site of the demolished Babri Masjid . In a public statement, Modi said local Muslims were responsible for the incident. The next day, the Vishwa Hindu Parishad called for a bandh (general strike) across the state. Riots began during the bandh and anti-Muslim violence spread through Gujarat. The government's decision to move the bodies of the train victims from Godhra to Ahmedabad further inflamed the violence. The state government later stated 790 Muslims and 254 Hindus were killed during the riots; independent sources put the death toll at over 2,000, the vast majority of them Muslims. Approximately 150,000 people were driven to refugee camps. Numerous women and children were among the victims; the violence included mass rapes and mutilation of women.",
    "Scholars consider the Government of Gujarat to have been complicit in the riots, and it has received much criticism for its handling of the situation; some scholars explicitly blame Modi. The Modi government imposed a curfew in 26 major cities, issued shoot-at-sight orders and called for the army to patrol the streets; these measures failed to prevent the violence from escalating. The president of the state unit of the BJP expressed support for the bandh despite such actions being illegal at the time. State officials later prevented riot victims from leaving the refugee camps, which were often unable to meet the needs of those living there. Muslim victims of the riots were subjected to further discrimination when the state government announced their compensation would be half that offered to Hindu victims; this decision was later reversed after the issue was taken to court. During the riots, police officers often did not intervene in situations where they were able. Several scholars have described the violence as a pogrom and others have called it an example of state terrorism . According to Martha Nussbaum , \"There is by now a broad consensus that the Gujarat violence was a form of ethnic cleansing, that in many ways it was premeditated, and that it was carried out with the complicity of the state government and officers of the law\".",
    "Modi's personal involvement in the 2002 events has continued to be debated. During the riots, he said, \"What is happening is a chain of action and reaction\". Later in 2002, Modi said the way in which he had handled the media was his only regret regarding the episode. In March 2008, the Supreme Court of India reopened several cases related to the riots, including that of the Gulbarg Society massacre , and established a Special Investigation Team (SIT) to look into the issue. In response to a petition from Zakia Jafri , the widow of Ehsan Jafri , who was killed in the Gulbarg Society massacre, in April 2009, the court also asked the SIT to investigate Modi's complicity in the killings. The SIT questioned Modi in March 2010; in May, it presented to the court a report finding no evidence against him. In July 2011, the court-appointed amicus curiae Raju Ramachandran submitted his final report to the court. Contrary to the SIT's position, Ramachandran said Modi could be prosecuted based on the available evidence. The Supreme Court sent the matter to the magistrate's court. The SIT examined Ramachandran's report, and in March 2012 submitted its final report, asking for the case to be closed. Zakia Jafri filed a protest petition in response. In December 2013, the magistrate's court rejected the protest petition, accepting the SIT's finding there was no evidence against Modi. In 2022, the Supreme Court dismissed a petition by Zakia Jafri in which she challenged the clean chit given to Modi in the riots by the SIT, and upheld previous rulings that no evidence against him was found.",
    "Following the violence, calls for Modi to resign as chief minister were made from politicians within and outside the state, including leaders of Dravida Munnetra Kazhagam and the Telugu Desam Party —partners in the BJP-led National Democratic Alliance coalition—and opposition parties stalled Parliament over the issue. Modi submitted his resignation at the April 2002 BJP national executive meeting in Goa but it was not accepted. Despite opposition from the election commissioner, who said a number of voters were still displaced, Modi succeeded in advancing the election to December 2002. In the election, the BJP won 127 seats in the 182-member assembly. Modi made significant use of anti-Muslim rhetoric during his campaign, and the BJP profited from religious polarisation among voters. Modi framed the criticism of his government for human rights violations as an attack upon Gujarati pride, a strategy that led to the BJP winning 127 of the 182 seats—a two-thirds majority—in the state assembly. He won Maninagar constituency , defeating Congress candidate Yatin Oza. On 22 December 2002, Modi was sworn in for a second term.",
    "During Modi's second term, the government's rhetoric shifted from Hindutva to Gujarat's economic development. He curtailed the influence of Sangh Parivar organisations such as Bharatiya Kisan Sangh (BKS) and Vishva Hindu Parishad (VHP). When the BKS staged a farmers' demonstration, Modi ordered the BKS's eviction from state-provided houses, and his decision to demolish 200 illegal temples in Gandhinagar deepened the rift with the VHP. Modi retained connections with some Hindu nationalists. He wrote a foreword to a 2014 textbook by Dinanath Batra , which made the unscientific claim that ancient India possessed technologies including test-tube babies .",
    "Modi's relationship with Muslims continued to attract criticism. Prime Minister Atal Bihari Vajpayee distanced himself, reaching out to North Indian Muslims before the 2004 Indian general election , following which, Vajpayee called the violence in Gujarat a reason for the BJP's electoral defeat and said it had been a mistake to leave Modi in office after the riots. Western nations also raised questions about Modi's relationship with Muslims: the US State Department barred him from entering the United States in accordance with the recommendations of that country's Commission on International Religious Freedom , the only person to be denied a US visa under this law. The UK and the European Union (EU) refused to admit Modi because of what they saw as his role in the riots. As Modi rose to prominence in India, the UK and the EU lifted their bans in October 2012 and March 2013, respectively, and after his election as prime minister in 2014, the US lifted its ban and invited him to Washington, D.C.",
    "During the run-up to the 2007 Gujarat Legislative Assembly election and the 2009 Indian general election , the BJP intensified its rhetoric on terrorism. Modi criticised Prime Minister Manmohan Singh \"for his reluctance to revive anti-terror legislation\" such as the 2002 Prevention of Terrorism Act . In 2007, Modi wrote Karmayog , a 101-page booklet discussing manual scavenging. In it, he said scavenging is a \"spiritual experience\" for Valmiks , a sub-caste of Dalits . The book was not circulated at that time because of the election code of conduct . After the November 2008 Mumbai attacks , the Gujarat government authorised the deployment of 30 high-speed boats for coastal surveillance. In July 2007, Modi completed 2,063 consecutive days as chief minister of Gujarat, making him the longest-serving holder of that post. The BJP won 122 of 182 state-assembly seats in that year's election.",
    "Despite the BJP's shift away from explicit Hindutva, Modi's campaigns in 2007 and 2012 Gujarat Legislative Assembly elections contained elements of Hindu nationalism. He attended only Hindu religious ceremonies and had prominent associations with Hindu religious leaders. During his 2012 campaign, Modi twice refused to wear skullcap gifted by Muslim leaders. He did, however, maintain relations with Dawoodi Bohra . Modi's 2012 campaign included references to issues known to cause religious polarisation, including Afzal Guru and the death of Sohrabuddin Sheikh . The BJP did not nominate any Muslim candidates for the 2012 assembly election. During the 2012 campaign, Modi attempted to identify himself with the state of Gujarat, a strategy similar to that used by Indira Gandhi during the Emergency, and projected himself as protecting Gujarat against persecution by the rest of India. While campaigning for the 2012 Gujarat Legislative Assembly election, Modi made extensive use of holograms and other technologies, allowing him to reach a large number of people, something he repeated in the 2014 general election. Modi won the constituency of Maninagar, defeating Shweta Bhatt of the INC. The BJP won 115 of the 182 seats, continuing its majority during his tenure. After his election as Prime Minister of India , Modi resigned as the Gujarat chief minister and as MLA for Maninagar. Anandiben Patel succeeded Modi as chief minister.",
    "As chief minister, Modi favoured privatisation and small government , which was at odds with the philosophy of the RSS, which is usually described as anti-privatisation and anti-globalisation. Modi's policies during his second term have been credited with reducing corruption in Gujarat. He established financial and technology parks in the state and during the 2007 Vibrant Gujarat summit, real-estate investment deals worth ₹ 6.6 trillion (equivalent to ₹ 20 trillion or US$240 billion in 2023) were signed.",
    "The governments led by Patel and Modi supported NGOs and communities in the creation of large scale groundwater-conservation projects, which commentators credited with helping about half of the tehsils with depleted groundwater recharge their aquifers. As a result, the state's production of genetically modified cotton increased to become the largest in India. The boom in cotton production and its semi-arid land use led to Gujarat's agricultural sector growing at an average rate of 9.6 per cent from 2001 to 2007. Public irrigation measures in central and southern Gujarat, such as the Sardar Sarovar Dam , were less successful. The Sardar Sarovar project irrigated only 4–6% of the area intended. In 2008, Modi offered land in Gujarat to Tata Motors to set up a plant manufacturing the Nano car after popular agitation had forced the company to move out of West Bengal . Following Tata, several other companies relocated to Gujarat.",
    "The Modi government finished the process of taking electricity to every village in Gujarat its predecessor had almost completed. Modi significantly changed the state's system of power distribution, greatly impacting farmers. Gujarat expanded the Jyotigram Yojana scheme, in which agricultural electricity was separated from other rural electricity; the agricultural electricity was rationed to fit scheduled irrigation demands, reducing its cost. Early protests by farmers ended when those who benefitted found their electricity supply had stabilised but, according to an assessment study, corporations and large farmers benefited from the policy at the expense of small farmers and labourers.",
    "A contentious debate surrounds the assessment of Gujarat's economic development during Modi's tenure as chief minister. The state's Gross Domestic Product (GDP) growth rate averaged 10% during his tenure, similar to other highly industrialised states, and above that of the country. Gujarat saw strong economic growth before Modi took office; some scholars state that growth did not accelerate during his tenure. Under Modi, Gujarat performed well on measures of ease of doing business. Tax breaks and land for businesses were easier to obtain in Gujarat than in other states. Modi's policies of making Gujarat attractive for investment included the creation of Special Economic Zones in which labour laws were greatly weakened. In the later years of Modi's government, Gujarat's economic growth was frequently used as an argument to counter allegations of communalism.",
    "Despite its growth rate, Gujarat had a relatively poor record on human development, poverty relief, nutrition and education during Modi's tenure. Gujarat was ranked poorly within the country on education, and was reported to have a poor record of immunisation of children. Under much of Modi's tenure Gujarat did not significantly change its rank among Indian states with respect to poverty, female literacy, or infant mortality . The state government's social policies generally did not benefit Muslims, Dalits and Adivasis , and generally increased social inequalities. Development in Gujarat was generally limited to the urban middle class, and citizens in rural areas and those from lower castes were increasingly marginalised. Under Modi, the state government spent less than the national average on education and healthcare.",
    "In September 2013, Modi was named the BJP's candidate for prime minister ahead of the 2014 Lok Sabha election . Several BJP leaders, including BJP founding member L. K. Advani who cited concern with leaders who were \"concerned with their personal agendas\", expressed opposition to Modi's candidature. Modi played a dominant role in the BJP's 2009 general election campaign. Several people who voted for the BJP stated they would have voted for another party if Modi had not been the prime-ministerial candidate. The focus on Modi as an individual was unusual for a BJP election campaign. The election was described as a referendum on Narendra Modi.",
    "During the campaign, Modi focused on corruption scandals under the previous Congress government, and played on his image as a politician who had created a high rate of GDP growth in Gujarat. He projected himself as a person who could bring about \"development\" without focusing on specific policies. His message found support among young and middle-class people. The BJP under Modi was able to downplay concerns about the protection of religious minorities and Modi's commitment to secularism, areas in which he had previously received criticism. Prior to the election, Modi's media image had centred around his role in the 2002 Gujarat riots but during the campaign, the BJP focused on Modi's neoliberal ideology and the Gujarat model of development. The BJP sought to identify itself with political leaders who publicly opposed Hindu nationalism , including B. R. Ambedkar , Subhas Chandra Bose and Ram Manohar Lohia . Hindutva remained a part of the campaign; BJP leaders used Hindutva-based rhetoric in several states. Communal tensions were played upon, especially in Uttar Pradesh and Northeast India . A proposal for the controversial Uniform Civil Code was a part of the BJP's election manifesto. The BJP's campaign was assisted by its wide influence in the media. Modi's campaign blitz cost around ₹ 50 billion (US$590 million) and the BJP received extensive financial support from corporate donors. Modi made extensive use of social media and addressed more than 1,000 rallies via hologram appearances.",
    "The BJP won 31 per cent of the vote, and more-than-doubled its number of seats in the Lok Sabha to 282, becoming the first party to win a majority of seats on its own since 1984 . Voter dissatisfaction with the Congress and with regional parties in North India, and support from the RSS were reasons for the BJP's success. In states such as Uttar Pradesh, where the BJP performed well, it drew exceptionally high support from upper-caste Hindus, and its Muslim vote increased to 10 per cent. The BJP performed particularly well in parts of the country that had recently experienced violence between Hindus and Muslims. The magnitude of the BJP's victory led many commentators to say the election constituted a political realignment away from progressive parties towards the right-wing. Modi's tweet announcing his victory was described as being emblematic of the political realignment away from a secular, socialist state towards capitalism and Hindu cultural nationalism. Modi is the first Indian PM to be born after the country's independence from the British Empire in 1947.",
    "Modi was a candidate for the Lok Sabha constituencies Varanasi and Vadodara . He won in both constituencies, defeating Aam Aadmi Party leader Arvind Kejriwal in Varanasi by 371,784 votes and Madhusudan Mistry of the Congress in Vadodara by 570,128 votes. India's president appointed Modi, who was unanimously elected leader of the BJP, Prime Minister of India. To comply with the law prohibiting MPs from representing more than one constituency, he vacated the Vadodara seat.",
    "On 13 October 2018, Modi was named the BJP candidate for prime minister in the 2019 general election . The BJP's chief campaigner was its president Amit Shah . Modi launched the party's Main Bhi Chowkidar (\"I too am a watchman\") campaign ahead of the general election, against the INC's campaign slogan Chowkidar Chor Hai (\"The watchman is a thief\"). In 2018, the Telugu Desam Party split from the NDA over the campaign for special status for Andhra Pradesh .",
    "Amit Shah launched the BJP's election campaign on 8 April 2019. In the campaign, the opposition targeted Modi on allegations of corruption over the Rafale deal with the Government of France , highlighting the controversy surrounding the deal . Modi's campaign focused on defence and national security, especially after the Pulwama attack and the retaliatory Balakot airstrike , which was counted as an achievement of his administration. Other topics in the campaign were development and good foreign relations in the first premiership.",
    "Modi contested the Lok Sabha election as a candidate for Varanasi ; he won the seat by a margin of 479,505 votes, defeating Shalini Yadav of the Samajwadi Party (SP), who stood as a candidate for the SP- BSP alliance. Modi was unanimously appointed prime minister for a second time by the National Democratic Alliance after the alliance won the election for the second time with 353 seats in the Lok Sabha; the BJP alone won 303 seats.",
    "In November 2023, Modi was named the BJP candidate for prime minister in the 2024 general election . The BJP's chief campaigner was its home minister Amit Shah and President J. P. Nadda . Modi launched the party's \" Modi Ki Guarantee \" (\"Modi's assurance\") campaign ahead of the general election, against the INC's guarantees campaigns, that led to the party's enormous victories in the assembly elections of Karnataka and Telangana .",
    "Modi contested the Lok Sabha election as a candidate for Varanasi for the third consecutive time; he won the seat by a margin of 152,513 votes, defeating Ajay Rai of the INC, who contested as a candidate for the SP-INC alliance. His victory margin was the second lowest ever (in percentage points) for a sitting Prime Minister in India. The National Democratic Alliance secured a total of 292 seats, 20 seats ahead of simple majority, and the BJP solely winning 240 seats. Modi thanked the voters for reposing faith in his government for the 3rd consecutive time.",
    "Modi's first year as PM saw significant centralisation of power. Modi, who initially lacked a majority in the Rajya Sabha , the upper house of Indian Parliament, passed a number of ordinances to enact his policies, leading to further centralisation of power. His administration enacted a bill to increase its control over the appointment of judges and reducing that of the judiciary . In December 2014, he abolished the Planning Commission , replacing it with the National Institution for Transforming India (NITI Aayog), concentrating the power previously with the planning commission in the person of the PM. The Planning Commission had in previous years been criticised for creating inefficiency in the government and of not fulfilling its role of improving social welfare but since the economic liberalisation of the 1990s , it had been the major government body responsible for measures related to social justice. In its first year of administration, the Modi government launched investigations through the Intelligence Bureau into numerous civil society organisations and foreign non-governmental organisations (NGOs) on the grounds these organisations were slowing economic growth. The investigations were criticised as a witch hunt . International humanitarian aid organisation Medecins Sans Frontieres , and environmental nonprofit organisation Sierra Club and Avaaz were among the groups that were investigated. Cases of sedition and terrorism laws were filed against individuals who criticised the government. This led to discontent within the BJP about his style of functioning and drew comparisons to the governing style of Indira Gandhi.",
    "Modi repealed 1,200 obsolete laws in first three years as prime minister; 1,301 such laws had been repealed by previous governments in the previous 64 years. Modi launched the Digital India programme with the goal of ensuring government services are available electronically, build infrastructure to provide high-speed Internet access to rural areas, boost manufacturing of electronic goods in the country, and promote digital literacy .",
    "In 2019, a law to reserve 10 per cent of educational admission and government jobs for economically disadvantaged individuals was passed. In 2016, Modi's administration launched the Ujjwala scheme to provide free liquefied petroleum gas (LPG) connections to rural households. The scheme led to an additional 24% of Indian households having access to LPG in 2019 as compared to 2014. In 2022, the government eliminated LPG subsidies for all citizens except those covered by the Ujjwala program.",
    "In 2023, the Modi administration issued a notification constituting a high-level committee on One Nation, One Election , a proposal aimed to synchronise all elections in the country either on a single day or within a specific time frame. In September 2024, the bill for One Nation, One Election was approved by the Modi Cabinet.",
    "Since May 2023, ethnic tensions between some groups have resulted in violent clashes in Manipur . After 1 month of the violence, nearly 100 were killed and more than 36,000 people were displaced. Modi has been criticised for his lack of reaction towards the violence.",
    "The activities of a number of Hindu nationalist organisations increased in scope after Modi's appointment as prime minister, sometimes with the government's support. These activities included a Hindu religious conversion programme , a campaign against the supposed Islamic practice of \" Love Jihad \" (an Islamophobic conspiracy theory ) and attempts to celebrate Nathuram Godse , the assassin of Mahatma Gandhi , by members of the right-wing organisation Hindu Mahasabha . Government officials, including the Home Minister, defended the conversion programmes.",
    "Links between the BJP and the Rashtriya Swayamsevak Sangh (RSS) grew stronger under Modi. The RSS provided organisational support to the BJP's electoral campaigns while the Modi administration appointed RSS-affiliated individuals to prominent government positions. In 2014, Yellapragada Sudershan Rao , who had previously been associated with the RSS, became the chairperson of the Indian Council of Historical Research (ICHR). Historians and former members of the ICHR, including those sympathetic to the BJP, questioned Rao's credentials as a historian and stated the appointment was part of an agenda of cultural nationalism. During its first term, the Modi administration appointed other RSS members to lead universities and research institutions, and recruitment of faculty members favouring the RSS increased. According to scholars Nandini Sundar and Kiran Bhatty, many of these appointees did not possess the qualifications for their positions. The Modi administration also made numerous changes in government-approved history textbooks that de-emphasised the role of Jawaharlal Nehru and glorified that of Modi while also portraying Indian society as harmonious, and without conflict and inequity.",
    "In 2019, the Modi administration passed a citizenship law that provides a route to Indian citizenship for persecuted religious minorities from Afghanistan, Bangladesh and Pakistan who are Hindus, Sikhs, Buddhists, Jains, Parsis or Christians, but does not grant eligibility to Muslims. This was first time religion had been overtly used as a criterion for citizenship under Indian law; it attracted global criticism and prompted widespread protests that were halted by the COVID-19 pandemic . Counter-demonstrations against the protests developed into the 2020 Delhi riots , caused chiefly by Hindu mobs attacking Muslims. Fifty-three people were killed in the protests, two-thirds of whom were Muslim. On 5 August 2020, Modi visited Ayodhya after the Supreme Court in 2019 ordered contested land in Ayodhya to be handed to a trust to build a Hindu temple and ordered the government to give alternative 5 acres (2.0 ha) of land to the Sunni Waqf Board for the purpose of building a mosque. Modi became the first PM to visit temples at Ram Janmabhoomi and Hanuman Garhi .",
    "Soon after Modi returned to power in 2019, he took three actions the RSS had long called for. The practice of Triple Talaq was made illegal and became a punishable act from 1 August 2019. The administration repealed Article 370 of the Indian constitution that granted autonomy to Jammu and Kashmir , and also abrogated its statehood , reorganising it into the union territories Jammu and Kashmir , and Ladakh . The region was placed under a lockdown and internet services were suspended and were not completely restored until February 2021. Thousands of people, including hundreds of political leaders, were detained. The Supreme Court of India did not hear constitutional challenges to the reorganisation or the Citizenship Amendment Act. According to Bhatty and Sundar, this is an example of the subversion of the Supreme Court and other major institutions, which were filled with appointees favouring the BJP.",
    "During his campaign for 2024 Indian general election , Modi referred to Muslims as infiltrators with many children who would take India's wealth, if his political opponents gained power. In a later interview, Modi said that regardless of the social class, there are more children in neighbourhoods plagued by poverty. He said he made no mention of Muslim or Hindu in his campaign speech. However, factcheckers have refuted this claim of Modi and found numerous instances across his election campaign where he communally targeted the Muslims.",
    "The Modi government's economic policies focused on privatisation and liberalisation of the economy, and were based on a neoliberal framework. Modi liberalised India's foreign direct investment policies, allowing more foreign investment in several industries, including defence and railways. Other proposed reforms included making the forming of unions more difficult for workers, and making recruitment and dismissal easier for employers; some of these proposals were abandoned after protests. The reforms drew strong opposition from unions: on 2 September 2015, eleven of the country's largest unions—including one affiliated with the BJP—struck. The Bharatiya Mazdoor Sangh (Indian Workers Union), a constituent of the Sangh Parivar (Family of the RSS), stated the underlying motivation of labour reforms favoured corporations over labourers.",
    "The funds dedicated to poverty-reduction programmes and social welfare measures were greatly reduced by Modi's administration. The money spent on social programmes declined from 14.6 per cent of GDP during the previous Congress government to 12.6 per cent during Modi's first year in office, and spending on health and family welfare declined by 15 per cent. The government lowered corporate taxes, abolished the wealth tax , increased sales taxes, and reduced customs duties on gold and jewellery. In October 2014, the Modi government deregulated diesel prices. During Modi's first term, his government reduced spending on education as share of the budget: over five years, education spending dropped from 0.7 per cent of GDP to 0.5 per cent. The percentage of the budget spent on children's nutrition, education, health, and associated programmes was almost halved between 2014 and 2022. Capital expenditure on transport infrastructure significantly rose, increasing from less than 0.4 per cent of GDP in 2014 to 1.7 per cent in 2023.",
    "In September 2014, Modi introduced the Make in India initiative to encourage foreign companies to manufacture products in India with the goal of turning the country into a global manufacturing hub. Supporters of economic liberalisation supported the initiative but critics said it would allow foreign corporations to capture a greater share of the Indian market. Modi's administration passed a land-reform bill that allowed it to acquire private agricultural land without conducting a social impact assessment, and without the consent of the farmers who owned it. The bill was passed via an executive order after it faced opposition in Parliament but was eventually allowed to lapse. Modi's government passed the Goods and Services Tax , the biggest tax reform in the country since independence, subsuming around 17 taxes and became effective on 1 July 2017.",
    "In his first cabinet decision, Modi set up a team to investigate black money . On 9 November 2016, the government demonetised ₹500 and ₹1000 banknotes with the intention of curbing corruption, black money, terrorism and the use of counterfeit currency. The move led to severe cash shortages, and a steep decline in the Indian stock indices BSE SENSEX and NIFTY 50 , and sparked widespread protests throughout the country. It is estimated 1.5 million jobs were lost and that one per cent of the country's GDP was wiped out. Several deaths were linked to the rush to exchange cash. In the subsequent year, the number of income tax returns filed for individuals rose by 25 per cent and the number of digital transactions steeply increased.",
    "Modi's administration has observed a decline in GDP growth and increasing joblessness compared to the previous administration under Manmohan Singh . During the first eight years of Modi's premiership, India's GDP grew at an average rate of 5.5 per cent compared to the rate of 7.03 per cent under the previous government. Income inequality increased. An internal government report said in 2017, unemployment increased to its highest level in 45 years. The loss of jobs was attributed to the 2016 banknote demonetisation, and the effects of the Goods and Services Tax . GDP growth was 6.12 per cent in the 2018–19 financial year , with an inflation rate of 3.4 per cent. In the year 2019–20, the GDP growth rate slowed to 4.18 per cent, while inflation increased to 4.7 per cent. The Indian economy shrunk by 6.6 per cent during the COVID-19 pandemic in 2020–21, and was estimated to grow at 8.2 per cent the following financial year.",
    "In his first year as prime minister, Modi reduced the central government's healthcare spending. In January 2015, the Modi government launched its New Health Policy (NHP), which did not increase the government's spending on healthcare but emphasised the role of private healthcare organisations. This represented a shift away from the policy of the previous Congress government, which had supported programmes to assist public health goals, including a reduction in child and maternal mortality rates. The National Health Mission , which included public health programmes targeted at these indices, received nearly 20 per cent less funding in 2015 than in the previous year. The Modi administration reduced the healthcare budget by a further 15% in its second year. The healthcare budget for the following year rose by 19%; private insurance providers positively viewed the budget but public health experts criticised its emphasis on the role of private healthcare providers and said it represented a shift away from public health facilities. The healthcare budget rose by 11.5% in 2018; the change included an allocation of ₹ 20 billion (US$240 million) for a government-funded health insurance program and a decrease in the budget of the National Health Mission .",
    "Modi emphasised his government's efforts at sanitation as a means of ensuring good health. On 2 October 2014, Modi launched the Swachh Bharat Mission (\"Clean India\") campaign. The campaign's stated goals included the elimination of open defecation and manual scavenging within five years. As part of the programme, the Indian government began constructing millions of toilets in rural areas and encouraging people to use them. The government also announced plans to build new sewage treatment plants, and planned to construct 60 million toilets by 2019. The construction projects faced allegations of corruption and severe difficulty in getting people to use the newly constructed toilets. Sanitation cover in India increased from 38.7% in October 2014 to 84.1% in May 2018 but use of the new sanitary facilities was lower than the government's targets. In 2018, the World Health Organization (WHO) stated at least 180,000 diarrhoeal deaths in rural India were averted after the launch of the sanitation effort.",
    "In March 2020, in response to the COVID-19 pandemic , the Modi administration invoked the Epidemic Diseases Act, 1897 and Disaster Management Act, 2005 . The same month, all commercial domestic and international flights were suspended. Modi announced a 14-hour curfew on 22 March, and followed with a three-week \"total lockdown\" two days later. Restrictions were gradually lifted beginning in April, and were completely revoked in November 2020. A second wave of the pandemic that began in March 2021 was significantly more devastating than the first; some parts of India experienced shortages of vaccines, hospital beds, oxygen cylinders and other medical supplies. In late April India reported over 400,000 cases in a 24-hour period, the first country to do so. India began its vaccination programme in January 2021; in January 2022, India announced it had administered about 1.7 billion doses of vaccines and that more than 720 million people were fully vaccinated. In May 2022, the WHO estimated 4.7 million people had died of COVID-19 in India, mostly during the second wave in mid 2021—almost 10 times the Indian government's estimate. The Modi administration rejected the WHO's estimate.",
    "Foreign policy played a small role in Modi's election campaign and did not feature prominently in the BJP's election manifesto. Modi's foreign policy, similarly to that of the preceding Congress government, focused on improving economic ties, security and regional relations. Modi continued Manmohan Singh's policy of \"multi-alignment\". The Modi administration tried to attract foreign investment in the Indian economy from several sources, especially East Asia, with the use of slogans such as \" Make in India \" and \" Digital India \". The government also tried to improve relations with Islamic nations in the Middle East , such as Bahrain , Iran , Saudi Arabia and the United Arab Emirates , as well as with Israel .",
    "India's relationship with the United States improved after Narendra Modi became PM. During the run-up to the general election, there was wide-ranging scepticism about future of the strategic bilateral relationship under Modi's premiership; in 2005, while Chief Minister of Gujarat , Modi was denied a US visa during the presidency of George W. Bush for his poor human-rights record. Sensing Modi's victory well before the election, US Ambassador to India Nancy Powell contacted Modi as part of greater rapprochement from the West. Following Modi's 2014 appointment as India's PM, President Obama congratulated him over the telephone and invited Modi to visit the US. The Modi government enjoyed a positive relationship with the US during the presidencies of Barack Obama and his successor Donald Trump .",
    "During the first few months after his appointment as PM, Modi visited a number of countries in support of his policy, and attended the BRICS , ASEAN and G20 summits. One of Modi's first visits as PM was to Nepal, during which he promised one billion US dollars in aid. Modi also made several visits to the US; this was described as an unexpected development because of the US's earlier denial of a US travel visa to Modi over his role in the 2002 Gujarat riots. The visits were expected to strengthen diplomatic and trade relations between the two countries.",
    "In 2015, the Indian parliament ratified a land-exchange deal with Bangladesh in the India–Bangladesh enclaves , which the government of Manmohan Singh had initiated. Modi's administration brought renewed attention to India's \"Look East Policy\", which was instituted in 1991. The policy, which was renamed the \"Act East Policy\", involved directing Indian foreign policy towards East Asia and Southeast Asia . The government signed agreements to improve land connectivity with Myanmar through the Indian state of Manipur ; this represented a break with India's historic engagement with Myanmar, which prioritised border security over trade. China–India relations rapidly deteriorated following the 2020 China–India skirmishes . Modi pledged aid of $900 million to Afghanistan, which he visited twice and was honoured with Afghanistan's highest civilian honour in 2016. In September 2022, Modi appeared to have developed a strong personal relationship with Russia's President Vladimir Putin .",
    "India hosted the 2023 G20 New Delhi summit , during which the African Union joined the G20 as a permanent member. In an interview on 26 August 2023, Prime Minister Modi expressed optimism about the G20 countries' evolving agenda under India's presidency, shifting toward a human-centric development approach that aligns with the concerns of the Global South , including addressing climate change , debt restructuring through the G20's Common Framework for Debt, and a strategy for regulation of global cryptocurrencies . Modi's government faced scrutiny in the lead-up to the G20 meeting as multiple news sources reported that Indian authorities demolished slum neighbourhoods in New Delhi , displacing marginalised residents.",
    "India's nominal military spending steadily increased under Modi. During Modi's tenure, the military budget declined, both as a fraction of GDP and when adjusted for inflation. A substantial portion of the military budget was devoted to personnel costs. Commentators wrote the budget was constraining Indian military modernisation.",
    "Under Modi, India launched military modernisation initiative aimed at strengthening defence preparedness and streamlining defence acquisition. Modi launched new policies under the \" Aatmanirbhar Bharat \" campaign, promoting indigenous defence manufacturing with policies to procure key weapon systems domestically. The government has implemented several of the recommendations from the Shekatkar Committee to streamline defence procurement and rationalise spending. Efforts have been made to establish Integrated Theatre Commands (ITCs) to enhance jointness among the services, although challenges persist in their full operationalisation.",
    "Modi promised to be \"tough on Pakistan\" during his election campaign and repeatedly called Pakistan an exporter of terrorism . On 29 September 2016, the Modi administration said the Indian Army had conducted a surgical strike on terror launch pads in Azad Kashmir ; the Indian media said up to 50 terrorists and Pakistani soldiers had been killed in the strike. Independent analysts said India's statement about the scope of the strike and the number of casualties had been exaggerated. Pakistan denied any surgical strikes to have taken place. In February 2019, India carried out airstrikes against a supposed terrorist camp in Pakistan; open source satellite imagery suggested no targets of significance were hit. Further military skirmishes , including cross-border shelling and the loss of an Indian aircraft, occurred. Eight months after the incident, the Modi administration admitted that six Indian military personnel had been killed by friendly fire .",
    "In May 2020, Chinese and Indian troops engaged in aggressive skirmishes along the Sino-Indian border , including near the disputed Pangong Lake , Ladakh , and the Tibet Autonomous Region and near the border between Sikkim and the Tibet Autonomous Region . Additional clashes took place in eastern Ladakh along the Line of Actual Control (LAC). In 2020, there were high-profile skirmishes between the nations. A series of talks between India and China were held. The first border clash reported in 2021 was on 20 January; this was referred to as a minor border clash in Sikkim. Modi was from late 2022 criticised for maintaining silence over the ceding of about 2,000 sq km land to China since June 2020.",
    "In December 2021, Modi signed an agreement with Russian President Vladimir Putin to extend military technical cooperation. The Modi government bought the S-400 missile system , an anti-missile striking system, strengthening the relationship between the two nations. India refused to condemn the 2022 Russian invasion of Ukraine and stayed neutral. The Indian government's Operation Ganga initiative sought to return Indians stranded in Ukraine during the war. More than 19,000 Indian nationals were evacuated, including some from neighbouring countries.",
    "While naming his cabinet, Modi renamed the Ministry of Environment and Forests the \" Ministry of Environment, Forests, and Climate Change \", and reduced its budget allocation by more than half in his administration's first budget. The new ministry removed or diluted a number of laws related to environmental protection, and others related to industrial activity. The government also tried to reconstitute the National Board for Wildlife so it would no longer have representatives from NGOs but the Supreme Court of India blocked this move. Other changes included a reduction of ministry oversight on small mining projects and ending the requirement for approval from tribal councils for projects inside forested areas. Modi also lifted a moratorium on new industrial activity in India's most-polluted areas. The changes were welcomed by businesspeople but criticised by environmentalists.",
    "Speaking with Assamese students in 2014, Modi downplayed climate change , saying, \"Climate has not changed. We have changed. Our habits have changed. Our habits have got spoiled. Due to that, we have destroyed our entire environment.\" Later in his administration, however, he has called for climate action , especially with the proliferation of clean energy . In 2015, Modi proposed the International Solar Alliance initiative to encourage investment in solar energy. Holding developed countries responsible, Modi and his government have said India has had a negligible historical role in climate change. At the COP26 conference, Modi announced India would target carbon neutrality by 2070 and expand its renewable energy capacity. Indian environmentalists and economists applauded the decision, describing it as bold climate action. India has become the only major economy to be on track to meet its Paris Agreement goals. It has achieved 10 per cent of ethanol blending five months ahead of schedule.",
    "Under Modi's tenure, India has experienced democratic backsliding . His rule is known for weakening of democratic institutions, individual rights , and freedom of expression . According to one study, \"The BJP government incrementally but systemically attacked nearly all existing mechanisms that are in place to hold the political executive to account, either by ensuring that these mechanisms became subservient to the political executive or were captured by party loyalists\". The Modi government has used state power to intimidate and stifle critics in the media and academia, undermining freedom of expression and alternative sources of information. His administration has been criticised for using a democratic mandate to undermine democratic processes, including focusing on Hindu-nationalist priorities rather than economic development. Modi's second term as PM, in particular, saw the erosion of civil rights and press freedom .",
    "Modi is the longest-serving prime minister outside the Indian National Congress , and has received consistently high approval ratings during his premiership.",
    "Modi is a vegetarian and teetotaller , and is a workaholic and has been described as an introvert . On 31 August 2012, he posted on Google Hangouts , becoming the first Indian politician to interact with citizens on a live chat. Modi has been called a fashion icon for his signature crisply ironed, half-sleeved kurta , and for a suit with his name repeatedly embroidered in the pinstripes, which he wore during a state visit by US President Barack Obama , which drew public and media attention, and criticism. [ clarification needed ] Scholars and biographers have described Modi's personality as energetic, eccentric, arrogant and charismatic.",
    "The nomination of Modi for the prime-ministership drew attention to his reputation as \"one of contemporary India's most controversial and divisive politicians\". During the 2014 election campaign, the BJP projected an image of Modi as a strong, masculine leader who would be able to take difficult decisions. Campaigns in which he has participated have focused on Modi as an individual, an unusual tactic for the BJP and RSS. Modi has relied upon his reputation as a politician able to bring about economic growth and development. Modi's role in the 2002 Gujarat riots continues to attract criticism and controversy. Modi's hardline Hindutva philosophy and the policies adopted by his government also continue to draw criticism, and have been seen as evidence of a majoritarian and exclusionary social agenda.",
    "During his premiership, Modi has received consistently high approval ratings; at the end of his first year in office, he received an overall approval rating of 87% in a Pew Research poll, with 68% of respondents rating him \"very favourably\" and 93% approving of his government. Modi's approval rating remained largely consistent at around 74% during his second year in office, according to a nationwide poll conducted by instaVaani. At the end of his second year in office, an updated Pew Research poll showed Modi continued to receive high overall approval ratings of 81%, with 57% of those polled rating him \"very favourably\". At the end of his third year in office, a further Pew Research poll showed Modi with an overall approval rating of 88%, his highest yet, with 69% of people polled rating him \"very favourably\". A poll conducted by The Times of India in May 2017 showed 77% of respondents rated Modi as \"very good\" and \"good\". In early 2017, a survey by Pew Research Center showed Modi to be the most popular figure in Indian politics. In a weekly analysis by Morning Consult called the Global Leader Approval Rating Tracker, Modi had the highest net approval rating as of 22 December 2020 of all government leaders in the 13 countries being tracked.",
    "Modi Kaka Ka Gaon (Modi uncle's town), a 2017 Indian Hindi -language drama film by Tushar Amrish Goel, is the first biopic about Modi. It stars Vikas Mahante in the titular role. PM Narendra Modi , a 2019 Hindi-language biographical drama film by Omung Kumar , stars Vivek Oberoi in the titular role and covers Modi's rise to the premiership. An Indian web series called Modi: Journey of a Common Man , which is based on the same premise, was released in May 2019 on the video streaming platform Eros Now with Ashish Sharma portraying Modi.",
    "7 RCR ( 7, Race Course Road ), a 2014 Indian docudrama political television series which charts the political careers of prominent Indian politicians, covered Modi's rise to the PM's office in the episodes \"Story of Narendra Modi from 1950 to 2001\", \"Story of Narendra Modi in Controversial Years from 2001 to 2013\", \"Truth Behind Brand Modi\", \"Election Journey of Narendra Modi to 7 RCR\", and \"Masterplan of Narendra Modi's NDA Govt\", with Sangam Rai in the role of Modi. India: The Modi Question , a 2023 BBC documentary, examines Modi's role in the 2002 Gujarat riots and his record as Prime Minister of India. The Indian government banned the documentary, drawing widespread criticism.",
    "Other portrayals of Modi include those by Rajit Kapur in the film Uri: The Surgical Strike (2019) and Vikram Gokhale in the web-television series Avrodh: The Siege Within (2020), both of which are based on the 2016 Uri attack and the subsequent Indian surgical strikes . Gokhale reprised the role in the sequel Avrodh: The Siege Within 2 (2022) , which is based on the 2016 Indian banknote demonetisation . Pratap Singh played a character based on Modi in Chand Bujh Gaya (2005) which is set against the backdrop of the Gujarat riots.",
    "Modi appeared in an episode of Discovery Channel 's show Man vs. Wild with the host Bear Grylls in July 2019, becoming the second world leader after Barack Obama to appear in the reality show. In the show, Modi treks through jungles, and talks about nature and wildlife conservation with Grylls. The episode was recorded in Jim Corbett National Park , Uttarakhand , and was broadcast in India and 180 other countries. Modi hosts Mann Ki Baat , a monthly radio programme on All India Radio , and has conducted the competition Pariksha Pe Charcha , and discussions for students and the issues they face in examinations.",
    "In March 2012 and June 2014, Narendra Modi appeared on the cover of the Asian edition of Time Magazine , becoming one of the few Indian politicians to have done so. In 2014, CNN-News18 (formally CNN-IBN ) news network awarded Modi Indian of the Year . In June 2015, Modi was featured on the cover of Time Magazine . In 2014, 2015, 2017, 2020 and 2021, he was named one of Time magazine's 100 Most Influential People in the World . In its list of the world's most powerful people , Forbes Magazine ranked Modi 15th in 2014 and 9th in 2015, 2016 and 2018. In 2015, Modi was ranked the 13th Most Influential Person in the World by Bloomberg Markets Magazine . In 2021, Time called Modi the third \"pivotal leader\" of independent India after Jawaharlal Nehru and Indira Gandhi , who \"dominated the country's politics like no one since them\". Modi was ranked fifth on Fortune Magazine ' s first annual list of the \"World's Greatest Leaders\" in 2015. In 2017, Gallup International Association (GIA) conducted a poll and ranked Modi third-top leader of the world. In 2016, a wax statue of Modi was unveiled at Madame Tussauds wax museum in London .",
    "In 2015, Modi was named one of Time ' s \"30 Most Influential People on the Internet\" because he was the second-most-followed politician on Twitter and Facebook . In 2018, he was the third-most-followed world leader on Twitter and the most-followed world leader on Instagram and Facebook. In October 2018, Modi received United Nations' highest environmental award, the Champions of the Earth , for policy leadership by \"pioneering work in championing\" the International Solar Alliance and \"new areas of levels of cooperation on environmental action\". Modi was conferred the 2018 Seoul Peace Prize .",
    "Following his second oath of office ceremony as Prime Minister of India, a picture of Modi was displayed on the facade of the Abu Dhabi National Oil Company (ADNOC) building in Abu Dhabi, United Arab Emirates . The Texas India Forum hosted a community event, Howdy Modi , in honour of Modi on 22 September 2019 at NRG Stadium in Houston, Texas . The event was attended by over 50,000 people and several American politicians, including President Donald Trump , making it the largest gathering for an invited foreign leader visiting the United States other than the Pope . At the event, Modi was presented with the Key to the City of Houston by Mayor Sylvester Turner . The Bill & Melinda Gates Foundation awarded Modi the Global Goalkeeper Award on 24 September 2019 in New York City, in recognition of the Swachh Bharat Mission and \"the progress India has made in providing safe sanitation under his leadership\".",
    "In 2020, Modi was among eight world leaders who were awarded the parody Ig Nobel Prize in Medical Education \"for using the COVID-19 viral pandemic to teach the world that politicians can have a more immediate effect on life and death than scientists and doctors can\". On 21 December 2020, US President Donald Trump awarded Modi the Legion of Merit for improving India–United States relations . On 24 February 2021, Gujarat Cricket Association controversially renamed Motera Stadium in Ahmedabad — the largest cricket stadium in the world — Narendra Modi Stadium .",
    "In July 2024, during a visit to Russia, Modi was awarded the Order of St. Andrew , Russia's highest civilian award, for his effort in the development of the bilateral ties between India and Russia. In March, the King of Bhutan conferred Modi with the Order of the Dragon King , the highest decoration of Bhutan. It was the first such award to a non-Bhutanese head of government.",
    "Later in November 2024, during a diplomatic visit to Nigeria, Modi was conferred the Grand Commander of the Order of the Niger by the Nigerian President. This is one of the country's highest honours, making him the second foreign dignitary to receive the award, after Queen Elizabeth II in 1969. President Bola Tinubu stated that the award was presented in recognition of Nigeria's appreciation for the growing partnership between the two countries. Upon his arrival, Modi was presented with the symbolic \"Key to the City\" of Abuja by Minister Nyesom Wike , a gesture symbolising trust and honour from the people of Nigeria. In December 2024, Modi was conferred the Order of Mubarak the Great , the highest national honour of Kuwait . Modi was named a Grand Commander of the Order of the Star and Key , the highest honour conferred by Mauritius , in March 2025. In April 2025, Modi was awarded the Sri Lanka Mitra Vibhushana , the highest Sri Lankan award to a foreign leader, in Colombo by the Sri Lankan President Anura Kumara Dissanayake .",
    "^ = February 2002 by-poll",
    "In 2008, Modi published a Gujarati book titled Jyotipunj , which contains profiles of RSS leaders. The longest was of M. S. Golwalkar , under whose leadership the RSS expanded and whom Modi refers to as Pujniya Shri Guruji (\"Guru worthy of worship\"). According to The Economic Times , Modi's intention was to explain the workings of the RSS to his readers, and to reassure RSS members he remained ideologically aligned with them.",
    "After becoming the Prime Minister he also authored a book called Exam Warriors , a guide for children to commendably face exams. Modi has written eight other books, mostly containing short stories for children. Modi has penned the lyrics of two Gujarati garba songs; Garbo , sung by Dhvani Bhanushali and composed by Tanishk Bagchi , and Maadi , sung by Divya Kumar and composed by Meet Bros . The songs were released on the occasion of autumn Navratri in 2023.",
    "Abundance in Millets , a song by Falu and Gaurav Shah that featured a speech given by Modi for the promotion of millet , received a nomination in the Best Global Music Performance category for the 2024 Grammy Awards ."
  ],
  "scraped_at": "2025-06-11 06:43:39 UTC"
}