{
  "url": "https://en.wikipedia.org/wiki/P._T._Usha",
  "title": "P. T. Usha",
  "paragraph_count": 15,
  "paragraphs": [
    "Pilavullakandi Thekkeparambil Usha (born 27 June 1964) is an Indian sports administrator, parliamentarian and retired track and field athlete. She was born in Koothali near Perambra in Kozhikode district , Kerala , and grew up in Payyoli . Usha has been associated with Indian athletics since 1979. She has won a total of four gold and seven silver medals in the Asian Games . She is often associated as the \"Queen of Indian track and field\".",
    "In July 2022, she was nominated as a Member of Parliament to the Rajya Sabha , the upper house of the Indian Parliament . In December 2022, she was elected president of the Indian Olympic Association unopposed. That same month, she was appointed to the panel of Rajya Sabha vice-chairman to control the proceedings of the upper house during the absence of both Chairman and Deputy Chairman. Usha is the first nominated parliamentarian in history to become the vice-chairperson of the Rajya Sabha.",
    "In 1976, the Kerala State Government started a Sports division for women in Kannur , and Usha started practicing under the guidance of coach O. M. Nambiar in 1977 as one among the forty girl athletes in sports division Kannur. Nambiar was an athletics coach and had taken notice of Usha at a sports prize-distribution ceremony. In an interview with Rediff.com in 2000, he recalled: \"What impressed me at first sight about Usha was her lean shape and fast walking style. I knew she could become a very good sprinter.\" The same year, he began coaching her. Quick results followed when she won six medals at the inter-state meet for juniors, in Kollam in 1978, with four gold medals in 100 m, 200 m, 60 m hurdles and high jump , silver in long jump and bronze in 4 x 100 m relay. In the year's Kerala State college meet, she won 14 medals. She went on to win multiple medals at the 1979 National Games and 1980 National inter-state meet setting many meet records. She participated in her first international event at the Qaid-e-Azam invitation meet in Karachi , Pakistan, in 1980, where she won four gold medals.",
    "At the senior inter-country meeting in Bangalore in 1981, Usha clocked 11.6 seconds in the 100 m and 24.8 seconds in the 200 m setting national records in both. At the 1982 New Delhi Asian Games , she won silver medals in 100 m and 200 m, clocking 11.95 s and 25.32 s. At the 1983 Open National Championships in Jamshedpur , she broke the 200 m national record again clocking 23.9 s, and with 53.6 s, set a new national record in 400 m. At the Asian Championships in Kuwait City the same year, she won gold in 400 m.",
    "Usha's best moment came at the 1984 Los Angeles Olympics . She entered on the back of a string of good performances at the year's New Delhi inter-state meet and Mumbai Open National Championships. However, poor performances in 100m and 200m at the Moscow World Championships prompted her to concentrate on the 400 m hurdles. At the Olympic trials in Delhi, she beat Asian Champion M. D. Valsamma to qualify for the Games. At another pre-Olympic trials, she clocked 55.7 seconds beating American top sprinter Judi Brown . At the Games, she clocked 56.81 s in the heats and 55.94 s in the semi-final, setting a new Commonwealth record as she entered the final. At the final, she came fourth, at 55.42 seconds, falling behind the eventual bronze medalist by 1/100 of a second. This followed after one of her competitors had a false start , which was said to have \"broken her rhythm\" as \"she got off the blocks a bit slower at the restart.\"",
    "In the 1985 Jakarta Asian Championships , Usha won six medals — five gold and one bronze. She won the 100 m in 11.64, 200 m in 23.005, 400 m in 52.52, an Asian record , and 400 m hurdles in 56.64, with the final two coming in a span of 35 minutes. Her fifth gold came in 4 x 400 m relay, and a final bronze in 4 x 100 m. She set a record in the process for most gold medals won at a single event in the history of the championships. In the first two of her wins, she equalled the Asian record held by Chi Cheng of Taiwan . She went on to better her personal best in 400 m a week later at the 1985 Canberra World Cup , when she clocked 51.61, finishing seventh. She almost replicated her Jakarta Championships performance at the 1986 Seoul Asian Games . She won the 100 metres silver with a time of 11.67 seconds losing the gold to Lydia de Vega . The 200 metres gold came in 23.44, 400 metres gold in 52.16 and 4 x 400 m relay gold in 3:34.58, all of which were new Games records. At the Games, British athletics coach Jim Alford said of her, \"Usha is a first class athlete, a tough competitor and a terrific runner to watch. She has all the potential. Given careful guidance, she can be world class.\"",
    "I never wanted to be an Olympian. All I wanted was to keep breaking my own record. I never competed to defeat anybody. —P. T. Usha",
    "From 1983–89, Usha garnered 13 golds at ATF meets. In the 10th Asian Games held at Seoul in 1986, Usha won 4 gold medals and 1 silver medal in the track and field events. She also won five gold medals at the 6th Asian Track and Field Championship in Jakarta in 1985. Her medals at the same meet is a record for a single athlete in a single international meet.",
    "Currently she is committee head of Indian Talent organization which conducts the National Level Indian Talent Olympiad examinations in schools across India. Usha retired from her active sports career in 2000.",
    "In July 2022, Usha was nominated by President of India , Ram Nath Kovind , as a Member of Parliament (MP) of the Rajya Sabha , the upper house of the Indian Parliament . In December 2022, She was appointed as one of the vice-chairpersons of the Rajya Sabha and become the first nominated MP to be in the Vice Chairperson panel. On 8 February 2023, Usha chaired the Rajya Sabha.",
    "Since retiring from her sports career in 2000, Usha had given no inclination of entering sports administration, however, in December 2022, she was elected as the president of the Indian Olympic Association (IOA) in an election where she ran unopposed. She also became the first woman to be elected president of the IOA.",
    "Usha represented India in 4 x 100 metres relay together with Valdivel Jayalakshmi , Rachita Mistry , and E.B. Shyla at the 1998 Asian Championships in Athletics , where her team won the gold medal, setting a national record of 44.43 s.",
    "Usha studied in Providence Women's College in Kozhikode.",
    "Usha married V. Srinivasan, an English inspector with Central Industrial Security Force , in 1991. The couple has a son, Dr. Vignesh Ujjwal.",
    "Currently, she is a member of the Board of Advisors of India's International Movement to Unite Nations (I.I.M.U.N.) ."
  ],
  "scraped_at": "2025-06-11 06:35:56 UTC"
}