{
  "url": "https://en.wikipedia.org/wiki/Prasanta_Chandra_Mahalanobis",
  "title": "Prasanta Chandra Mahalanobis",
  "paragraph_count": 23,
  "paragraphs": [
    "Prasanta Chandra Mahalanobis OBE , FNA , FASc , FRS (29 June 1893 – 28 June 1972) was an Indian scientist and statistician. He is best remembered for the Mahalanobis distance , a statistical measure, and for being one of the members of the first Planning Commission of free India . He made pioneering studies in anthropometry in India. He founded the Indian Statistical Institute , and contributed to the design of large-scale sample surveys. For his contributions, Mahalanobis has been considered the Father of statistics in India. Since 2007, every year June 29 is celebrated as National Statistics Day in India to commemorate the birth anniversary of P.C. Mahalanobis and his contributions to statistical science and planning.",
    "Mahalanobis was born on 29 June 1893, in Calcutta , Bengal Presidency (now West Bengal ).\nMahalanobis belonged to a prominent Bengali Brahmin family of landed gentry in Bikrampur , Dhaka , Bengal Presidency (now in Bangladesh ). His grandfather Gurucharan (1833–1916) moved to Calcutta in 1854 and built up a business, starting a chemist shop in 1860. Gurucharan was influenced by Debendranath Tagore (1817–1905), father of the Nobel Prize-winning poet, Rabindranath Tagore . Gurucharan was actively involved in social movements such as the Brahmo Samaj , acting as its treasurer and president. His house on 210 Cornwallis Street was the centre of the Brahmo Samaj. Gurucharan married a widow, an action against social traditions at that time. [ citation needed ]",
    "Gurucharan's younger son, Prabodh Chandra (1869–1942), was the father of P. C. Mahalanobis. Born in the house at 210 Cornwallis Street, Mahalanobis grew up in a socially active family surrounded by intellectuals and reformers.",
    "Mahalanobis received his early schooling at the Brahmo Boys School in Calcutta, graduating in 1908. He joined the Presidency College, then affiliated with the University of Calcutta , where he was taught by teachers who included Jagadish Chandra Bose , and Prafulla Chandra Ray . Others attending were Meghnad Saha , a year junior, and Subhas Chandra Bose , two years his junior at college. Mahalanobis received a Bachelor of Science degree with honours in physics in 1912. He left for England in 1913 to join the University of London . [ citation needed ]",
    "After missing a train, he stayed with a friend at King's College, Cambridge . He was impressed by King's College Chapel and his host's friend M. A. Candeth suggested that he could try joining there, which he did. He did well in his studies at King's, but also took an interest in cross-country walking and punting on the river. He interacted with the mathematical genius Srinivasa Ramanujan during the latter's time at Cambridge. After his Tripos in physics, Mahalanobis worked with C. T. R. Wilson at the Cavendish Laboratory . He took a short break and went to India, where he was introduced to the Principal of Presidency College and was invited to take classes in physics.",
    "After returning to England, Mahalanobis was introduced to the journal Biometrika . This interested him so much that he bought a complete set and took them to India. He discovered the utility of statistics to problems in meteorology and anthropology , beginning to work on problems on his journey back to India.",
    "In Calcutta , Mahalanobis met Nirmalkumari (Rani), daughter of Heramba Chandra Maitra, a leading educationist and member of the Brahmo Samaj. They married on 27 February 1923, although her father did not completely approve of the union. He was concerned about Mahalanobis's opposition to various clauses in the membership of the student wing of the Brahmo Samaj, including prohibitions against members' drinking alcohol and smoking. Sir Nilratan Sircar , P. C. Mahalanobis' maternal uncle, took part in the wedding ceremony in place of the father of the bride.",
    "Many colleagues of Mahalanobis took an interest in statistics . An informal group developed in the Statistical Laboratory, which was located in his room at the Presidency College, Calcutta. On 17 December 1931 Mahalanobis called a meeting with Pramatha Nath Banerji (Minto Professor of Economics), Nikhil Ranjan Sen (Khaira Professor of Applied Mathematics) and Sir R. N. Mukherji . Together they established the Indian Statistical Institute (ISI) in Baranagar , and formally registered on 28 April 1932 as a non-profit distributing learned society under the Societies Registration Act XXI of 1860.",
    "The institute was initially in the Physics Department of the Presidency College; its expenditure in the first year was Rs. 238. It gradually grew with the pioneering work of a group of his colleagues, including S. S. Bose, J. M. Sengupta, R. C. Bose , S. N. Roy , K. R. Nair, R. R. Bahadur , Gopinath Kallianpur , D. B. Lahiri and C. R. Rao . The institute also gained major assistance through Pitambar Pant , who was a secretary to Prime Minister Jawaharlal Nehru . Pant was trained in statistics at the Institute and took a keen interest in its affairs.",
    "In 1933, the Institute founded the journal Sankhya , along the lines of Karl Pearson 's Biometrika .",
    "The institute started a training section in 1938. Many of the early workers left the ISI for careers in the United States and with the government of India. Mahalanobis invited J. B. S. Haldane to join him at the ISI; Haldane joined as a Research Professor from August 1957, staying until February 1961. He resigned from the ISI due to frustrations with the administration and disagreements with Mahalanobis' policies. He was concerned with the frequent travels and absence of the director and complained that the \"... journeyings of our Director define a novel random vector.\" Haldane helped the ISI develop in biometrics.",
    "In 1959, the institute was declared as an institute of national importance and a Deemed university .",
    "The methods pioneered at the institute are now used by the World Bank and the United Nations. As Nobel Prize-winning economist Angus Deaton and co-author Valerie Kozel wrote in 2005: \"Where Mahalanobis and India led, the rest of the world has followed, so that today, most countries have a recent household income or expenditure survey. Most countries, can only envy India in its statistical capacity\".",
    "Economists TN Srinivasan, Rohini Somanathan , Pranab Bardhan and another Nobel-winner Abhijit Banerjee have since argued that there is \"no other instance of an entirely homegrown institution in a developing country becoming a world leader in a large field of general interest\".",
    "Mahalanobis distance is one of the most widely used metrics to find how much a point diverges from a distribution, based on measurements in multiple dimensions. It is widely used in the field of cluster analysis and classification. It was first proposed by Mahalanobis in 1930 in context of his study on racial likeness. From a chance meeting with Nelson Annandale , then the director of the Zoological Survey of India , at the 1920 Nagpur session of the Indian Science Congress led to Annandale asking him to analyse anthropometric measurements of Anglo-Indians in Calcutta. Mahalanobis had been influenced by the anthropometric studies published in the journal Biometrika and he chose to ask the questions on what factors influence the formation of European and Indian marriages. He wanted to examine if the Indian side came from any specific castes. He used the data collected by Annandale and the caste-specific measurements made by Herbert Risley to come up with the conclusion that the sample represented a mix of Europeans mainly with people from Bengal and Punjab but not with those from the Northwest Frontier Provinces or from Chhota Nagpur. He also concluded that the intermixture more frequently involved the higher castes than the lower ones. This analysis was described by his first scientific article in 1922. During the course of these studies he found a way of comparing and grouping populations using a multivariate distance measure. This measure, denoted \" D 2 \" and now eponymously named Mahalanobis distance , is independent of measurement scale. Mahalanobis also took an interest in physical anthropology and in the accurate measurement of skull measurements for which he developed an instrument that he called the \"profiloscope\".",
    "His most important contributions are related to large-scale sample surveys. He introduced the concept of pilot surveys and advocated the usefulness of sampling methods. Early surveys began between 1937 and 1944 and included topics such as consumer expenditure, tea-drinking habits, public opinion, crop acreage and plant disease. Harold Hotelling wrote: \"No technique of random sample has, so far as I can find, been developed in the United States or elsewhere, which can compare in accuracy with that described by Professor Mahalanobis\" and Sir R. A. Fisher commented that \"The ISI has taken the lead in the original development of the technique of sample surveys, the most potent fact-finding process available to the administration\".",
    "He introduced a method for estimating crop yields which involved statisticians sampling in the fields by cutting crops in a circle of diameter 4 feet. Others such as P. V. Sukhatme and V. G. Panse who began to work on crop surveys with the Indian Council of Agricultural Research and the Indian Agricultural Statistics Research Institute suggested that a survey system should make use of the existing administrative framework. The differences in opinion led to acrimony and there was little interaction between Mahalanobis and agricultural research in later years.",
    "In later life, Mahalanobis was a member of the planning commission contributed prominently to newly independent India's five-year plans starting from the second. In the second five-year plan he emphasized industrialization on the basis of a two-sector model. His variant of Wassily Leontief 's Input-output model , the Mahalanobis model , was employed in the Second Five Year Plan , which worked towards the rapid industrialisation of India and with other colleagues at his institute, he played a key role in the development of a statistical infrastructure. He encouraged a project to assess deindustrialization in India and correct some previous census methodology errors and entrusted this project to Daniel Thorner .",
    "In the 1950s, Mahalanobis played a critical role in the campaign to bring India its first digital computers.",
    "Mahalanobis also had an abiding interest in cultural pursuits and served as secretary to Rabindranath Tagore (about whom he would write in the Journal of the Oriental Society of Australia ), particularly during the latter's foreign travels, and also worked at his Visva-Bharati University , for some time. He received India's second highest civilian award, the Padma Vibhushan from the Government of India for his contribution to science and services to the country.",
    "Mahalanobis died on 28 June 1972, a day before his seventy-ninth birthday. Even at this age, he was still active doing research work and discharging his duties as the secretary and director of the Indian Statistical Institute and as the honorary statistical advisor to the Cabinet of the Government of India. [ citation needed ]",
    "The government of India decided in 2006 to celebrate Prasanta Chandra Mahalanobis's birthday, 29 June, every year as \" National Statistics Day \" of India .",
    "On the occasion of his 125th birth anniversary on 29 June 2018, Indian Vice-President M Venkaiah Naidu released a commemorative coin at a programme at ISI, Kolkata."
  ],
  "scraped_at": "2025-06-11 06:38:17 UTC"
}