{
  "url": "https://en.wikipedia.org/wiki/Raja_Rammohan_Roy",
  "title": "Raja Ram Mohan Roy",
  "paragraph_count": 42,
  "paragraphs": [
    "Raja Ram Mohan Roy (22 May 1772 – 27 September 1833) was an Indian reformer and writer who was one of the founders of the Brahmo Sabha in 1828, the precursor of the Brahmo Samaj , a socio-religious reform movement in the Indian subcontinent . He has been dubbed the \"Father of Indian Renaissance.\" He was given the title of Raja by Mughal emperor Akbar II ( r. 1806–1837 ).",
    "His influence was apparent in the fields of politics , public administration , education and religion. He was known for his efforts to abolish the practices of sati and child marriage . Roy wrote Gaudiya Vyakaran which was the first complete Bangla grammar written book.",
    "Ram Mohan Roy was born in Radhanagar , Hooghly District , Bengal Presidency . His great-grandfather Krishnakanta Bandyopadhyay was a Rarhi Kulin (noble) Brahmin . Among Kulin Brahmins –  descendants of the five families of Brahmins imported from Kannauj by Ballal Sen in the 12th century as per popular myth – those from the Rarhi district of West Bengal were notorious in the 19th century for living off dowries by marrying several women. Kulinism was a synonym for polygamy and the dowry system, both of which Ram Mohan campaigned against. His father, Ramkanta, was a Vaishnavite , while his mother, Tarini Devi, was from a Shaivite family. He was a great scholar of  Sanskrit, Persian and English languages and also knew Arabic, Latin and Greek. One parent prepared him for the occupation of a scholar, the Shastri , while the other secured for him all the worldly advantages needed to launch a career in the laukik or worldly sphere of public administration. Torn between these two parental ideals from early childhood, Ram Mohan vacillated between the two for the rest of his life.",
    "During his childhood Ram Mohan Roy witnessed the death of his sister-in-law through sati . The seventeen-year-old girl was dragged towards the pyre where Ram Mohan Roy witnessed her terrified state. He tried to protest but to no avail. She was burned alive. The people chanted \"Maha Sati! Maha Sati! Maha Sati!\" (great wife) over her painful screams.",
    "Ram Mohan Roy was married three times. His first wife died early. He had two sons, Radhaprasad in 1800, and Ramaprasad in 1812 with his second wife, who died in 1824. Roy's third wife outlived him.",
    "The nature and content of Ram Mohan Roy's early education is disputed. One view is that Ram Mohan started his formal education in the village pathshala where he learned Bengali and some Sanskrit and Persian . Later he is said to have studied Persian and Arabic in a madrasa in Patna and after that he was sent to Benares to learn the intricacies of Sanskrit and Hindu scripture, including the Vedas and Upanishads . The dates of his time in both these places are uncertain. However, it is believed that he was sent to Patna when he was nine years old and two years later he went to Benares .",
    "Ram Mohan Roy's impact on modern Indian history was his revival of the pure and ethical principles of the Vedanta school of philosophy as found in the Upanishads. He preached the unity of God, made early translations of Vedic scriptures into English, co-founded the Calcutta Unitarian Society and founded the Brahmo Sabha, precursor to Brahmo Samaj . The Brahmo Samaj played a major role in reforming and modernizing the Indian society. He successfully campaigned against sati , the practice of burning widows. He sought to integrate Western culture with the best features of his own country's traditions. He established a number of schools to popularize a modern system of education in India. He promoted a rational, ethical, non-authoritarian, this-worldly views and social reforms in Hinduism. His writings also sparked interest among British and American Unitarians.",
    "During the early years of East India Company rule, Ram Mohan Roy acted as a political agitator while employed by the company.",
    "In 1792, the British Baptist shoemaker William Carey published his influential missionary tract, An Enquiry of the Obligations of Christians to Use Means for the Conversion of Heathens .",
    "In 1793, William Carey landed in India to settle. His objective was to translate, publish and distribute the Bible in Indian languages and propagate Christianity to the Indian people. He realised the \"mobile\" (i.e. service classes) Brahmins and Pandits were most able to help him in this endeavour, and he began gathering them. He learnt the Buddhist and Jain religious works to better argue the case for Christianity in a cultural context.",
    "In 1795, Carey made contact with a Sanskrit scholar, the Tantric Saihardana Vidyavagish, who later introduced him to Ram Mohan Roy, who wished to learn English.",
    "While there are rumors that between 1796 and 1797, the trio of Carey, Vidyavagish, and Roy created a religious work known as the \"Maha Nirvana Tantra\" (or \"Book of the Great Liberation\"). Scholars like John Duncan Derrett are skeptical of this claim calling it \"highly improbable\" and Hugh Urban argues that \"It is probable that we will never know the true author and date of the Maha Nirvana Tantra\". Carey's involvement is not recorded in his very detailed records and he reports only learning to read Sanskrit in 1796 and only completed a grammar in 1797, the same year he translated part of The Bible (from Joshua to Job), a massive task. For the next two decades Maha Nirvana Tantra was regularly augmented. Its judicial sections were used in the law courts of the English Settlement in Bengal as Hindu Law for adjudicating upon property disputes of the zamindars. However, a few British magistrates and collectors began to suspect and its usage (as well as the reliance on pandits as sources of Hindu Law) was quickly deprecated. Vidyavagish had a brief falling out with Carey and separated from the group, but maintained ties to Ram Mohan Roy.",
    "In 1797, Raja Ram Mohan reached Calcutta and became a bania (moneylender), mainly to lend to the Englishmen of the Company living beyond their means. Ram Mohan also continued his vocation as pandit in the English courts and started to make a living for himself. He began learning Greek and Latin.",
    "In 1799, Carey was joined by missionary Joshua Marshman and the printer William Ward at the Danish settlement of Serampore .",
    "From 1803 until 1815, Ram Mohan served the East India Company's \"Writing Service\", commencing as private clerk ( Munshi ) to Thomas Woodroffe, Registrar of the Appellate Court at Murshidabad (whose distant nephew, John Woodroffe —also a magistrate—and later lived off the Maha Nirvana Tantra under the pseudonym Arthur Avalon ). Roy resigned from Woodroffe's service and later secured employment with John Digby, a Company collector, and Ram Mohan spent many years at Rangpur and elsewhere with Digby, where he renewed his contacts with Hariharananda. William Carey had by this time settled at Serampore and the old trio renewed their profitable association. William Carey was also aligned now with the English Company, then head-quartered at Fort William, and his religious and political ambitions were increasingly intertwined.",
    "While in Murshidabad, in 1804 Raja Ram Mohan Roy wrote Tuhfat-ul-Muwahhidin (A Gift to Monotheists) in Persian with an introduction in Arabic. Bengali had not yet become the language of intellectual discourse. The importance of Tuhfat-ul-muwahhidin lies only in its being the first known theological statement of one who achieved later fame and notoriety as a Vedantin . On its own, it is unremarkable, perhaps of interest only to a social historian because of its amateurish eclecticism. Tuhfat was, after all, available as early as 1884 in the English translation of Maulavi Obaidullah EI Obaid, published by the Adi Brahmo Samaj. Raja Ram Mohan Roy did not know the Upanishad at this stage in his intellectual development.",
    "In 1814, he started Atmiya Sabha (i.e. Society of Friends) a philosophical discussion circle in Kolkata (then Calcutta) to propagate the monotheistic ideals of the vedanta and to campaign against idolatry, caste rigidities, meaningless rituals and other social ills.",
    "The East India Company was draining money from India at a rate of three million pounds a year by 1838. Ram Mohan Roy was one of the first to try to estimate how much money was being taken out of India and to where it was disappearing. He estimated that around one-half of all total revenue collected in India was sent out to England, leaving India, with a considerably larger population, to use the remaining money to maintain social well-being. Ram Mohan Roy saw this and believed that the unrestricted settlement of Europeans in India governing under free trade would help ease the economic drain crisis.",
    "During the next two decades, Ram Mohan along with William Carey, launched his attack against the bastions of Hinduism of Bengal, namely his own Kulin Brahmin priestly clan (then in control of the many temples of Bengal) and their priestly excesses. The Kulin excesses targeted include sati (the co-cremation of widows), polygamy, child marriage and dowry.",
    "From 1819, Ram Mohan's battery increasingly turned against William Carey, a Baptist Missionary settled in Serampore, and the Serampore missionaries. With Dwarkanath's munificence, he launched a series of attacks against Trinitarian Christianity and was now considerably assisted in his theological debates by the Unitarian faction of Christianity.",
    "He wrote Gaudiya Vyakaran which was the first complete Bangla grammar written book. It was published in 1826.",
    "In 1828, he launched Brahmo Sabha with Debendranath Tagore . By 1828, he had become a well known figure in India. In 1830, he had gone to England as an envoy of the Mughal Emperor, Akbar Shah II, who invested him with the title of Raja to the court of King William IV.",
    "This was Ram Mohan's most controversial period. Commenting on his published works Sivanath Sastri writes:",
    "\"The period between 1820 and 1830 was also eventful from a literary point of view, as will be manifest from the following list of his publications during that period:",
    "He publicly declared that he would emigrate from the British Empire if Parliament failed to pass the Reform Bill.",
    "In 1830, Ram Mohan Roy travelled to the United Kingdom as an ambassador of the Mughal Empire to ensure that Lord William Bentinck's Bengal Sati Regulation, 1829 banning the practice of sati was not overturned. In addition, Roy petitioned the King to increase the Mughal Emperor's allowance and perquisites. He was successful in persuading the British government to increase the stipend of the Mughal Emperor by £30,000. While in England, he embarked on cultural exchanges, meeting with members of parliament and publishing books on Indian economics and law. Sophia Dobson Collet was his biographer at that time.",
    "The religious reforms of Roy contained in some beliefs of the Brahmo Samaj expounded by Rajnarayan Basu are:",
    "Having studied the Qur’an , the Vedas and the Upanishads , Roy's beliefs were  derived from a combination of monastic elements of Hinduism , Islam , eighteenth-century Deism , Unitarianism , and the ideas of the Freemasons .",
    "Raja Ram Mohan Roy founded the Atmiya Sabha and the Unitarian Community to fight the social evils, and to propagate social and educational reforms in India. He was the man who fought against superstitions, a pioneer in Indian education, and  a trend setter in Bengali prose and Indian press.",
    "Roy's political background and Devandra's Christian influence influenced his social and religious views regarding reforms of Hinduism. He writes,",
    "The present system of Hindus is not well calculated to promote their political interests… It is necessary that some change should take place in their religion, at least for the sake of their political advantage and social comfort.",
    "Roy's experience working with the British government taught him that Hindu traditions were often not credible or respected by western standards and this no doubt affected his religious reforms. He wanted to legitimise Hindu traditions to his European acquaintances by proving that \"superstitious practices which deform the Hindu religion have nothing to do with the pure spirit it dictates!\" The \"superstitious practices\", to which Ram Mohan Roy objected, included sati, caste rigidity, polygamy and child marriages. These practices were often the reasons British officials claimed moral superiority over the Indian nation. Ram Mohan Roy's ideas of religion actively sought to create a fair and just society by implementing humanitarian practices similar to the Christian ideals professed by the British and thus seeking to legitimise Hinduism in the eyes of the Christian world.",
    "In early September 1833 Roy came to Bristol to visit his Unitarian friend, Dr Lant Carpenter , where he made a deep impression on Lant's daughter and future social reformer, Mary Carpenter . While in Bristol Roy preached at the Lewins Mead Meeting House . In mid September he became ill and was diagnosed with meningitis. He died at Stapleton , then a village to the north-east of Bristol (now a suburb), on 27 September 1833 of meningitis or a chronic respiratory ailment.",
    "Ram Mohan Roy was originally buried on 18 October 1833, in the grounds of Stapleton Grove, where he had lived as an ambassador of the Mughal Empire and died of meningitis on 27 September 1833. Nine years later he was reburied on 29 May 1843 in a grave at the new Arnos Vale Cemetery , in Brislington, East Bristol. A large plot on The Ceremonial Way there had been bought by William Carr and William Prinsep, and the body in its lac and a lead coffin was placed later in a deep brick-built vault, over seven feet underground. Two years after this, Dwarkanath Tagore helped pay for the chhatri raised above this vault, although there is no record of him ever visiting Bristol. The chhatri was designed by the artist William Prinsep, who had known Ram Mohan in Calcutta . [ citation needed ]",
    "Bristol Arnos Vale cemetery have been holding remembrance services for Raja Ram Mohan Roy every year on a Sunday close to his death anniversary date of 27 September. The Indian High Commission at London often come to Raja's annual commemoration and Bristol's Lord Mayor is also regularly in attendance. The commemoration is a joint Brahmo-Unitarian service, in which, prayers and hymns are sung, flowers laid at the tomb, and the life of the Raja is celebrated via talks and visual presentations. In 2013, a recently discovered ivory bust of Ram Mohan was displayed. In 2014, his original death mask at Edinburgh was filmed and its history was discussed. In 2017, Raja's commemoration was held on 24 September.",
    "Roy's commitment to English education and thought sparked debate between Mahatma Gandhi and Rabindranath Tagore . Gandhi objected to Roy's devotion to English education and thought and disallowing independent thinking by being overly supportive of the Western philosophical discourses. Tagore wrote a letter rejecting Gandhi's view, saying \"[Roy] had the full inheritance of Indian wisdom. He was never a school boy of the West, and therefore had the dignity to be a friend of the West.\"",
    "In 1983, a full-scale Exhibition on Ram Mohan Roy was held in Bristol's Museum and Art Gallery. His enormous 1831 portrait by Henry Perronet Briggs still hangs there and was the subject of a talk by Max Muller in 1873. At Bristol's centre, on College Green, there is a full-size bronze statue of Raja by a modern Kolkata sculptor Niranjan Pradhan. Another bust by Pradhan, gifted to Bristol by Jyoti Basu, sits inside the main foyer of Bristol's City Hall. [ citation needed ]",
    "A pedestrian path at Stapleton has been named \"Rajah Rammohun Walk\". There is a 1933 Brahmo plaque on the outside west wall of Stapleton Grove, and his first burial place in the garden is marked by railings and a granite memorial stone. His tomb and chhatri at Arnos Vale are listed as a Grade II historic site by English Heritage and attract many visitors today. [ citation needed ]",
    "A 1965 Indian Bengali -language film Raja Rammohan about  Roy's reforms, directed by Bijoy Bose and starring Basanta Chowdhury in the title role.",
    "In 1988 Doordarshan Serial Bharat Ek Khoj produced and directed by Shyam Benegal also picturised a full one episode on Raja Ram Mohan Roy. The title role was played by noted TV actor Anang Desai with Urmila Bhatt , Tom Alter and Ravi Jhankal as supporting cast.",
    "In 1984 Films Division of India created a documentary Raja Rammohan Roy directed by P. C. Sharma.",
    "In 2004, Roy was ranked number 10 in BBC's poll of the Greatest Bengali of All Time ."
  ],
  "scraped_at": "2025-06-11 06:30:59 UTC"
}