{
  "url": "https://en.wikipedia.org/wiki/Sathya_Sai_Baba",
  "title": "Sathya Sai Baba",
  "paragraph_count": 86,
  "paragraphs": [
    "Traditional",
    "Sathya Sai Baba (born Ratnakaram Sathyanarayana Raju ; 23 November 1926 – 24 April 2011 ) was an Indian godman , guru and philanthropist. At the age of 14, he claimed to be the reincarnation of Shirdi Sai Baba and left his home saying \"my devotees are calling me, I have my work\".",
    "Sathya Sai Baba's followers have attributed to him a range of miraculous abilities, including the materialisation of Vibhuti (holy ash) and other small objects such as rings, necklaces, and watches. He was also believed to have performed spontaneous healings, resurrections , and exhibited clairvoyant abilities . Additionally, claims were made regarding his ability to be in multiple places simultaneously ( bilocation ), as well as his omnipresence , omnipotence , and omniscience .",
    "Sathya Sai Baba's devotees include members of all religions. In 1972, Sathya Sai Baba founded the Sri Sathya Sai Central Trust . Through this organization, Sathya Sai Baba established a network of free, general, and superspeciality hospitals , medical clinics, drinking water projects, educational institutions, ashrams , and auditoriums.",
    "Sathya Sai Baba faced numerous accusations over the years which include sleight of hand , sexual abuse , money laundering , fraud , and murder . However, he was never charged with any offence, and his devotees strongly reject these accusations, considering them propaganda against their guru.",
    "By virtue of his sizeable influence, many feel Sai Baba provides an example of \"the phenomenon referred to as mahagurus; that is, gurus with a global reach.\" Citing the number of Sai Centres (over 2000 in 137 countries), the scope of service and charitable works (free hospitals, drinking water projects), social sphere and influence of devotees (royalty, celebrities, high ranking politicians along with a total number of devotees estimated to be from 6 to 100 million worldwide) as well as being seen as a global \"movement extending in some very surprising ways.\"",
    "Sathyanarayana Raju was born on 23 November 1926 to Namagiriamma (Easwaramma) and Peddavenkama Raju Ratnakaram, to a Telugu -speaking Bhatraju family, a community of religious musicians and balladeers, in the village of Puttaparthi in Madras Presidency of British India (present-day Andhra Pradesh , India). His birth was purported by his mother Easwaramma to be of a miraculous conception . He was the fourth among the five children of his parents.",
    "Sathya Sai Baba's siblings included elder brother Ratnakaram Seshama Raju (1911–1985), elder sisters Venkamma (1918–1993) and Parvathamma (1920–1998), and younger brother Janakiramaiah (1931–2003).",
    "As a child, Sathya was described as \"unusually intelligent\" and charitable, though not necessarily academically inclined, as his interests were of a more spiritual nature. He was uncommonly talented in devotional music, dance and drama. From a young age, he has been purported to have been capable of materializing objects such as food and sweets out of thin air.",
    "Almost everything known about Sathya Sai Baba's early life stems from the hagiography that grew around him; these were narratives that hold special meaning to his devotees and are considered by them to be evidence of his divine nature.",
    "According to these sources, on 8 March 1940, while living with his elder brother Seshama Raju in Uravakonda (a small town near Puttaparthi ) 14-year-old Sathya was stung by a scorpion. He lost consciousness for several hours and in the next few days underwent a noticeable change in behavior. There were \"symptoms of laughing and weeping, eloquence and silence.\" It is claimed that then \"he began to sing Sanskrit verses, a language of which it is alleged he had no prior knowledge.\" Doctors concluded his behavior to be hysteria . Concerned, his parents brought Sathya back home to Puttaparthi and took him to many priests, doctors and exorcists. One of the exorcists at Kadiri , a town near Puttaparthi, went to the extent of torturing him with the aim of curing him. Having shaved Raju’s head, he cut three crosses on his skull, then poured acid into the wounds. At this point, his parents called a stop to it.",
    "On 23 May 1940, Sathya called household members and reportedly materialized sugar candy ( prasad ) and flowers for them. His father became furious at seeing this, thinking his son was bewitched . He took a stick and threatened to beat him if Sathya did not reveal who he really was, the young Sathya responded calmly and firmly \"I am Sai Baba\", a reference to Sai Baba of Shirdi . This was the first time he proclaimed himself to be the reincarnation of Sai Baba of Shirdi – a saint who became famous in the late 19th and early 20th centuries in Maharashtra and had died eight years before Sathya was born. It was then he came to be known as 'Sathya Sai Baba'.",
    "Several months later Sai Baba, on 20 October 1940, told his parents that he had \"come to this world with a mission to re-establish the principle of Righteousness ( Dharma ), to motivate love for God and service to fellow man.\" Further elaborating in a letter (dated 25 May 1947) to his older brother Seshma, he stated \"I have a task to foster all mankind and ensure for all of them lives full of bliss. I have a vow to lead all who stray away from the straight path, again into goodness and save them... to remove the sufferings of the poor and grant them what they lack.\" Personally stating, \"I do not belong to any place. I am not attached to any name. I have no ‘mine’ or ‘thine.’\"",
    "In 1944, a mandir for Sai Baba's devotees was built near the village of Puttaparthi . It is now referred to as the \"old mandir\". The construction of Prasanthi Nilayam , the current ashram, began in 1948 and was completed in 1950. In 1954, Sai Baba established a small free general hospital in the village of Puttaparthi. He won fame for his reputed mystical powers and ability to heal. In 1957, Sai Baba went on a tour of North India, visiting temples in Delhi, Srinagar, Kashmir and Rishikesh.",
    "In 1963, it was asserted that Sai Baba suffered a stroke and four severe heart attacks, which left him paralysed on one side. These events culminated in an event where he apparently healed himself in front of the thousands of people gathered in Prashanthi Nilayam who were then praying for his recovery.",
    "On recovering, Sai Baba stated, \"I am Shiva-Sakthi, born in the gotra (lineage) of Bharadwaja , according to a boon won by that sage from Siva and Sakthi . Siva was born in the gotra of that sage as Sai Baba of Shirdi; Shiva and Sakthi have incarnated as Myself in his gotra now; Sakthi alone will incarnate as the third Sai (Prema Sai Baba) in the same gotra in Mandya district of Karnataka State.\" He stated he would be born again eight years after his death at the age of 96, but died at the age of 84.",
    "On 29 June 1968 Sai Baba began his only overseas trip to Kenya and Uganda , returning to India on 15 July 1968.",
    "In 1968, he established Dharmakshetra or the Sathyam Mandir in Mumbai . In 1973, he established the Shivam Mandir in Hyderabad .",
    "He inaugurated the Sundaram, a new ashram and temple in Chennai on 19 January 1981.",
    "On 6 June 1993 there was an assassination attempt on Sai Baba's life . While reports vary, the official narrative is that four men (devotees) entered Sai Baba's residence under the premise of wanting to give him a telegram. When their path was obstructed, they stabbed two of the Baba's assistants to death, injuring two others. Hearing the commotion Sai Baba sounded the alarm and police were dispatched to his residence. Upon arriving, the police report stated the four youths had locked themselves in Sai Baba's living room and the officers tried to break the door down. \"The four were shot when they opened the door and attacked the police.\" Sai Baba remained unharmed during the incident, and later in a discourse cleared things up saying there was no bid on his life. Many aspects of the event remain unsolved and ambiguous.",
    "Another concern for Sai Baba's immediate safety arose on 17 January 2002 when an unknown man (later identified as Somasundaram) entered the Whitefield Ashram with an air pistol. He was apprehended by volunteers and handed over to police without incident.",
    "In March 1995, Sai Baba started a project to provide drinking water to 1.2 million people in the drought-prone Rayalaseema region in the Anantapur district of Andhra Pradesh . In April 1999 he inaugurated the Ananda Nilayam Mandir in Madurai , Tamil Nadu.",
    "In 2001 he established another free super-speciality hospital in Bangalore to benefit the poor.",
    "In 2003, Sai Baba suffered a fractured hip when a student standing on an iron stool slipped, and the boy and stool both fell on him. After the incident, he gave darshana from a car or his porte chair. After 2004, Sai Baba used a wheelchair and slowly began to make fewer public appearances.",
    "On 28 March 2011, Sai Baba was admitted to the Sri Sathya Sai Super Speciality Hospital in Puttaparthi after he complained of having giddiness and a slowing heartbeat. Initially, his condition improved, and on 4 April, it was reported all his vital parameters were near normal. However, over the course of the following weeks, multiple organ failures set in, and his condition progressively deteriorated. He died on Sunday, 24 April, at 7:40 IST, aged 84.",
    "Sai Baba had predicted that he would die at age 96 and would remain healthy until then. After he died, some devotees suggested that he was referring to lunar years , as counted by Telugu-speaking Hindus, rather than solar years and using the Indian way of accounting for age , which counts the year to come as part of a person's life. Other devotees have spoken of his anticipated resurrection , reincarnation , or awakening .",
    "Sathya Sai Baba's body lay in state for two days and was buried with full state honors on 27 April 2011. An estimated 500,000 people attended the burial. Political leaders and prominent figures attending included then Indian Prime Minister Manmohan Singh , Congress president Sonia Gandhi , Gujarat Chief Minister Narendra Modi (who later became Prime Minister of India), cricketer Sachin Tendulkar and Union Ministers S. M. Krishna and Ambika Soni .",
    "Political leaders who offered their condolences included the then Indian prime minister, Manmohan Singh , then Nepali Prime Minister Jhala Nath Khanal and Sri Lankan President Mahinda Rajapaksa . The cricketer Sachin Tendulkar, whose birthday was that day, cancelled his birthday celebrations. The Hindu newspaper reported that \"Sai Baba's phenomenal mass appeal lay in his unswerving commitment to communal harmony, his encouragement of charitable activity and public-spiritedness, and his own example in building educational and health care institutions that focused on meeting basic needs on a large scale.\"",
    "Many spiritual figures expressed their sentiments at Sai Baba's death. Mata Amritanandamayi said, \"Sri Sathya Sai Baba was the one who opened the path of love and compassion to millions of his devotees. Sathya Sai Baba’s life was his message.\"",
    "Ravi Shankar , founder of the Art of Living Foundation , wrote that \"Baba will continue to live in the hearts of millions of devotees ... his message of 'Satya Dharma Shanti Prema' which has transcended all barriers of caste and religion.\"",
    "The Dalai Lama expressed shock over the death of Sathya Sai Baba. In a message he said, \"I am saddened by the passing away of Sri Sathya Sai Baba,\nthe respected spiritual leader. I would like to convey my condolences and prayers to all the followers, devotees and admirers of the late spiritual leader.\"",
    "The Government of Karnataka declared 25 and 26 April as days of mourning . The state government of Andhra Pradesh (where Prasanthi Nilayam is located) announced a four-day state mourning period and decided to honor Sai Baba with a state funeral .",
    "From the time Sai Baba was admitted to hospital on 28 March, questions and allegations arose about his care and subsequently the role of his personal aide, Satyajit Salian. Police sources said, \"Satyajit did not feed Sai Baba proper food and gave him lot of sedative drugs, resulting in the deterioration of the latter’s health, leading up to Sai Baba's death.\" Doctors from the Sathya Sai Institute of Higher Medical Sciences, who treated Sai Baba, neither confirmed nor denied that sedative drugs were given to him prior to his admission to the hospital following respiratory problems. Later assessment from doctors noted lack of food had led to muscular weakness. Citing death threats and possible harm to his well-being from within the ashram community (after one of two trust members were allowed to sign cheques from a multi-billion dollar account), as well as from outside, a senior police officer said that Sathyajit was provided police protection.",
    "On 10 April, direct relatives expressed wonder as to why they were kept in the dark and knew nothing about Sai Baba's state of health. \"It is almost two months since Baba stopped taking food [but] we were not told about it.\" Family members said they were livid about the secrecy around Sai Baba's health and medical treatments and as to why the trust was not allowing anyone direct contact with him except for Sathyajit, his personal attendant. They only saw him from a distance in the ICU on April 2 after raising a furore. It was on 28 March, when Sai Baba complained of giddiness and slowing of the heartbeat that he was taken to hospital.",
    "On 21 April, the Deccan Herald reported an allegation stating that Sathya Sai Baba had died 20 days prior and that his death was not being announced in order to receive money from Indian and foreign devotees.",
    "On 28 April 2011, four days after the death of Sai Baba, The Times of India printed a story questioning the time of his death. A business making freezer boxes said that the one in which Sai Baba was kept was ordered on 4 April, partial payment was also made at that time. The freezer box arrived in Puttaparthi on 5 April. Sai Baba was admitted to hospital on 28 March but his condition had officially worsened on 15 April. \"The order was placed by Rajendranath Reddy of Bangalore [and] according to sources, the powerful Sri Sathya Sai Central Trust had a role in ordering the freezer box.\" According to Lakshmi, the owner of Kumar and Co International (freezer box company), her colleague Ganesh called Rajendranath to confirm the purchase for Sai Baba. \"He confirmed the same and told Ganesh not to discuss the matter with anyone.\"",
    "Within two months of Sai Baba's death, his niece Chetana Raju alleged that she was facing death threats from some trust members.",
    "In 2015, Ganapathy Raju, Sathya Sai Baba's first cousin, alleged that Sai Baba was murdered. He believes Satya Sai died on 29 March and not as officially declared on 24 April, saying that \"Baba was a victim of a well-planned conspiracy and pre-planned hi tech murder\" (adding) that the trust members had ordered a glass coffin and two truckloads of flowers even when Baba was unwell.\" Ganapathy also alleged that trust members were behind silencing the real date of Sai Baba's death in order to buy time to \"usurp the huge wealth of the trust fund\", asserting that properties worth hundreds of millions of dollars have \"changed hands\". Dr Aiyar, Sai Baba's personal physician, was heavily criticized for not maintaining any medical records of Sai Baba.",
    "Ganapathy Raju's main ideas of interest laid with the medical treatment and drugs given to Sai Baba, primarily by Satyajit Salian. Shyam Sunder, who had been involved with Prasanthi Nilayam since 1968, also raised concerns about harassment and exploitation from Satyajit as numerous allegations by devotees and workers in Prasanthi Nilayam arose saying that Satyajit would intimidate and physically abuse them. Like Ganapathy, Sunder also alleged that \"Satyajit and his associates had been administering sleeping pills to Sai Baba for over six years. Though Sai Baba resisted the pills after his return from Brindavan at Whitefield, Bangalore , in 2006, he was forced to take them ... and within a few months, Baba became sluggish and weak.\" Satyajit also controlled if and when the doctors could see Sai Baba, and within two days of Sai Baba's passing, The Times of India reported that Satyajit (who was a paid employee of the ashram and \"had no say whatsoever in the trust affairs or activities,\") was given authority to sign checks from the multi billion dollar trust account.",
    "Sai Baba was known for the quotes, in reference to his universal message, \"Love All, Serve All\" and \"Help Ever, Hurt Never.\" In Prashanti Nilayam, his devotees believed in seeking the spiritual benefit of Sai Baba's darshan , scheduled for morning and afternoon each day, as a form of devotion. Sai Baba would interact with people, accept letters or call groups and individuals for interviews. Devotees considered it a great privilege to have an interview and sometimes a single person, group or family was invited for a private interview so they could ask for answers to spiritual questions or for general guidance.",
    "Internationally, his devotees gather daily, or weekly on Sundays or Thursdays or both, for satsangs, spiritual discourses and devotional songs , prayer, spiritual meditation, service to the community (Seva), and to participate in \"Education in Human Values\" (SSEHV) known as \" Bal Vikas \" (Blossoming of the Child).",
    "Devotees still receive Sai Baba's Divya Darshan at his Mahasamadhi shrine, a white marble edifice decorated with flowers, in Sai Kulwant Hall ( Prasanthi Nilayam ), where he was laid to rest.",
    "Sai Baba was a lacto-vegetarian for spiritual as well as moral reasons and his followers have adopted the diet. He stated that \"meat eating fosters animal qualities in man making him descend to the demonic level; it is a heart-rending sight to see cows being slaughtered to serve as food for man.\" Sai Baba and many devotees have heavily criticized factory farming as unethical.",
    "Puttaparthi , where Sai Baba was born and lived, was originally a small, remote South Indian village in Andhra Pradesh . It was here that Prasanthi Nilayam (Abode of Highest Peace) was established. After 2 years of construction it was inaugurated on 23 November 1950, Sai Baba's 25th birthday. It succeeded the \"old mandir\" which was created in 1944. Prasanthi Nilayam is painted blue, yellow, and pink \"communicating the message of the harmony of spirit, intellect, and heart respectively; for blue stands for spirit, yellow for intellect, and pink for heart (love). The rich harmony of the three does result in Santi (peace) and Prasanti (supreme peace); and that really is the message of the Prasanthi Mandir.\" In 1954 a free general hospital was constructed in Puttaparthi and soon after a medical hospital was constructed in 1957 inside the ashram.",
    "Poornachandra Auditorium was built in 1973. Seating around 15,000 people in its enclosed 60 x 40-metre area, it is where cultural programmers (plays/dance/music), conferences and yagnas during Dasara take place. Sathya Sai Baba's living quarters were upstairs above the stage area.",
    "Sai Kulwant Hall was inaugurated by Sathya Sai Baba on July 9, 1995. The hall can accommodate up to 20,000 people and it was here that Sai Baba gave darshan everyday from that time forward. Sai Kulwant Hall is where Sai Baba was laid to rest. A white marble edifice stands as his Mahasamadhi shrine and devotees still have his Divya darshan here daily.",
    "The ashram itself houses a shopping center, book stores, library and reading room, multiple accommodations such as dormitories and rooms, banking/ATM facilities, media and Radio Sai facilities, a bakery, emergency medical services and three food courts – North and South Indian as well as Western canteens.",
    "In the encompassing area around Puttaparthi there is an extensive university complex, a specialty hospital, and two museums: the Sanathana Samskruti or Eternal Heritage Museum, sometimes called the Museum of All Religions, and the Chaitanya Jyoti , devoted exclusively to the life and teachings of Sai Baba; the latter has won several international awards for its architectural design. There is also a planetarium, a railway station, a hill-view stadium, an administrative building, an airport, an indoor sports stadium and more. High-ranking Indian politicians such as the former president A. P. J. Abdul Kalam , former prime minister Atal Bihari Vajpayee , Andhra Pradesh former chief minister Konijeti Rosaiah and Karnataka chief minister B. S. Yediyurappa have been official guests at the ashram in Puttaparthi.",
    "Established on 25 June 1960, the Brindavan Ashram is located in Kadugodi, a village close to Whitefield and 24 kms from the city centre of Bangalore , Karnataka . It occupies around 50 acres of land and was known as the summer home of Sai Baba as he would spend about three months here every year. Notable features are Sai Ramesh Krishan Hall, where darshan and bhajans were held, Trayee Brindavan, Sai Baba's personal residence and the Brindavan Campus of the Sri Sathya Sai Institute of Higher Learning.\nIn its adjacent areas are the Sri Sathya Sai General and Super Specialty Hospital ( Whitefield ), Sri Sathya Sai Institute of Higher Medical Sciences, Sai Central Trust and an old age home, Sri Sathya Sai Vriddhashram. All services at the hospitals are still free.",
    "Located in Kodaikanal , atop the Palani Hills in south Indian state of Tamil Nadu , Sai Shruti ashram was often visited by Sai Baba for a few days in the months of April and May. It holds no accommodations or extra curricular facilities.",
    "Sai Baba resided much of the time in his main ashram , Prasanthi Nilayam , at Puttaparthi. In the summer he often left for Brindavan , in Kadugodi, Whitefield , a town on the outskirts of Bangalore . Occasionally he visited his Sai Sruthi ashram in Kodaikanal .",
    "On 23 November 1999, the Department of Posts, Government of India , released a postage stamp and a postal cover in recognition of the service rendered by Sai Baba in addressing the problem of providing safe drinking water to the rural masses. Another commemorative stamp was released on the occasion of what would have been his 88th birthday during November 2013.",
    "In January 2007, an event was held in Chennai Nehru Stadium organized by the Chennai Citizens' Conclave to thank Sai Baba for the 2 billion water project which brought water from the River Krishna in Andhra Pradesh to Chennai city. Four chief ministers attended the function.",
    "The Sri Sathya Sai International Organization was founded in the 1960s by Sathya Sai Baba. Initially called the \"Sri Sathya Sai Seva Samithi\", it was established \"to enable its members to undertake service activities as a means to spiritual advancement.\" In 2020, Sri Satya Sai Central Trust was granted Special Consultative status by the United Nations Economic and Social Council .",
    "The Sathya Sai International Organization reports that there are an estimated 1,200 Sathya Sai Baba Centres in 114 countries. However, the number of active Sai Baba followers is hard to determine. Estimates vary from 6 million up to nearly 100 million. In India itself, Sai Baba drew followers predominantly from the upper-middle-class , the urban sections of society who have the \"most wealth, education and exposure to Western ideas.\" In 2002, he said he had followers in 178 countries.",
    "Sathya Sai Baba founded a large number of schools and colleges, hospitals, and other charitable institutions in India and abroad, the net financial capital of which is usually estimated at ₹ 400 billion (US$9 billion). However, estimates as high as ₹ 1.4 trillion (about US$31.5bn) have also been made. Sri Sathya Sai Baba's 100th Birthday Celebrations have been commemorated by a specially designed logo created by the SSSIO . It is a humble and sincere effort to capture the uniqueness of Sri Sathya Sai Baba in this logo.",
    "In 1950 Prasanthi Nilayam , his Puttaparthi ashram completed construction and with in 4 years, a general hospital in Puttaparthi was established (1954). Over a decade later in 1968 the first education project, a college for girls was set up in Anantapur . The Sri Sathya Sai Central Trust , a charitable trust that undertakes social welfare projects and acts as an umbrella for many seva projects was begun in 1972. In 1976 another general hospital in Whitefield, outside of Bangalore was completed followed by a boys' college in Puttaparthi in 1978. The inauguration of the Sri Sathya Sai University ( Puttaparthi campus), happened on 22 November 1981.",
    "In 1991, Sri Sathya Sai Institute of Higher Medical Sciences was completed.",
    "The Anantapur drinking water project launched in 1995 would be the first of many water projects taken up by Sai Baba, others included the Medak & Mahabubnagar drinking water projects (2001), the Chennai water project in 2002 and the East & West Godavari water projects completed in 2007.\nA decade later, another Sri Sathya Sai Institute of Higher Medical Sciences began operations in Bangalore along with the Sri Sathya Sai Super Specialty Hospital in Whitefield, offering free medical services. In 2009 the construction of Sri Sathya Sai University campus began.",
    "Years after Sai Baba's passing, Vivek Kumar wrote, \"the things that he executed were out of his love towards humanity. He provided free education, healthcare and water to people who never even dreamt of getting it.\"",
    "Sources often describe Sai Baba's following as a \"movement\". Sathya Sai Baba claimed to be the reincarnation of Sai Baba of Shirdi , whose followers considered him to be an avatar of Shiva . While Sai Baba of Shirdi was known to combine Islamic and Hindu teachings, Charles S. J. White, of The American University at Washington D.C., observed in 1972 that with Sathya Sai Baba, \"there is no discernible Muslim influence.\" Stephanie Tallings, in The Harvard international Review, noted Sai Baba's following is drawn from people of all religions, ethnicities, and social classes. In contrast, Sai Baba's following is also regarded by many scholars to be of a Hindu persuasion.",
    "Lawrence A. Babb, of the Amherst College in Massachusetts, labelled Sai Baba movement as a cult in the 1980s, calling it \"deeply and authentically Hindu...\" and noted, \"The most striking feature of this cult, however, is the extremely strong emphasis given to the miraculous.\" However, a scholarly review says Babb misapplies the word \"cult\", responding, \"the so-called 'cult' of Satya Sai Baba seems to possess all such characteristics which are, according to the author, central to a religious movement.\" Deborah A. Swallow, of the University of Cambridge, referred to it as a cult and said that the \"ritual and theology, then, unlike Sai Baba [of Shirdi]'s, is distinctly Hindu in form and content.\" However John D. Kelly, a professor of anthropology at the University of Chicago, wrote about Hindu missions in Fiji that the Sathya Sai Organization (which is part of the movement) rejected the label Hindu. According to Kelly, they see their founder as the \"living synthesis of the world's religious traditions\" and prefer to be classified as an interfaith movement. He observed that the Sai Baba mission is a Hindu mission that is as active as Christian or Muslim missions. In a 2001 scholarly book, Tulasi Srinivas notes, \"The Sathya Sai global civil religious movement incorporates Hindu and Muslim practices, Buddhist, Christian, and Zoroastrian influences, and \"New Age\"-style rituals and beliefs.' And in the appendix of the book (p. 349) lists 10 scholarly authors/researchers in both Europe and America who all refer to it as a New Religious Movement (NRM).",
    "While scholars often refer to it as either a \" New Religious Movement \" (NRM) or as a cult , it has been noted by Eugene Gallagher, a noted professor of religious studies, that in more modern times \"'New Religious Movement', is the classification preferred by most academics, who see 'cult' as a pejorative term.",
    "A secret report from the Central Intelligence Agency from the 1990s stated a \"worldwide mass religious movement\" was emerging around Sathya Sai Baba, who many devotees viewed as a full incarnation of God. On a local scale, the report states that the extensive appeal of Sai Baba's doctrine \"of a harmonious, multi-religious and multi-ethnic India has the potential to counterbalance the appeal of Hindu chauvinists and ethnic separatists\" Globally, the report concluded that the Sai Baba movement is likely to “become another worldwide religion”, via its current wealth and assets, social contributions and activity in the political domain, thus allowing expansion even after Sai Baba's death. Adding scope to the movement, the report addresses the claim that Sai Baba is the Kalki Avatar (the tenth Avatar of Vishnu ) who is to \"create a new world of peace and justice\", which the CIA operative compares to the return of Jesus Christ .",
    "Accusations against Sathya Sai Baba by his critics over the years have included sleight of hand, sexual abuse, money laundering, fraud in the performance of service projects, and murder.",
    "In 1972, Abraham Kovoor made the first public criticism of Sathya Sai Baba when he looked into a claim publicly narrated by one devotee that Sai Baba had created a new model of a Seiko watch, and found the claim to be untrue.",
    "In April 1976, Hossur Narasimhaiah, a physicist , rationalist and then vice-chancellor of Bangalore University , founded and chaired a committee \"to rationally and scientifically investigate miracles and other verifiable superstitions\". Narasimhaiah wrote Sai Baba three widely publicised letters challenging him to perform his miracles under controlled conditions. The letters were ignored. Sathya Sai Baba said that he ignored Narasimhaiah's challenge because he felt that a scientific approach to spiritual issues was improper, adding that \"Science must confine its inquiry only to things belonging to the human senses, while spiritualism transcends the senses. If you want to understand the nature of spiritual power you can do so only through the path of spirituality and not science. What science has been able to unravel is merely a fraction of the cosmic phenomena...\" Narasimhaiah's committee was dissolved in August 1977. Narasimhaiah held the fact that Sai Baba ignored his letters to be an indication that his miracles were fraudulent. As a result of this episode, a public debate raged for several months in Indian newspapers.",
    "Indian rationalist Basava Premanand , who began campaigning against Sathya Sai Baba in 1976, unsuccessfully attempted to sue him in 1986 for violations of the Gold Control Act , citing Sai Baba was \"producing gold necklaces out of thin air without the permission of a Gold Control Administrator\". When the case was dismissed, Premanand unsuccessfully appealed on the grounds that claimed spiritual power is not a defence recognised in law.",
    "In the early 1990s, the Central Intelligence Agency created a secret report that stated the Sai Baba movement is “likely to eventually become another worldwide religion”. The CIA operative who wrote the report concluded it by stating, “there is always the possibility, too, that the movement will collapse if Sai Baba is convincingly demonstrated to be a fraud.”",
    "A 1995 TV documentary Guru Busters , produced by filmmaker Robert Eagle for the UK's Channel 4 , accused Sai Baba of faking his materializations. The clip from the film was mentioned in the Deccan Chronicle , on 23 November 1992, in a front-page headline \"DD Tape Unveils Baba Magic\".",
    "Claims of Sai Baba resurrecting American devotee Walter Cowan in 1971 have been discussed by British journalist Mick Brown in his book The Spiritual Tourist from 1998, and subsequently by Erlendur Haraldsson , who interviewed doctors attending Cowan at the hospital; these physicians reported that Cowan had been dangerously ill but had not died.",
    "Brown also related his experiences with alleged manifestations of vibhuti (sacred ash) from Sai Baba's pictures in houses in London, which he felt were not fraudulent or the result of trickery. With regards to Sai Baba's claims of omniscience, Brown wrote, \"sceptics have produced documentation clearly showing discrepancies between Baba's reading of historical events and biblical prophecies, and the established accounts.\"",
    "The Vancouver Sun in 2001 reported that Sai Baba told his adherents not to sign on to the internet, while encouraging them, rather, to surf the \"inner net\".",
    "In January 2002, a documentary produced by Denmark's national television and radio broadcast company, Danmarks Radio (DR), called Seduced By Sai Baba , analyzed videos of public manifestations of Sai Baba and suggested that they could be explained as sleight of hand. The documentary also presented interviews with Alaya Rahm, former devotee of Sathya Sai Baba, where he alleged abuse by Sathya Sai Baba. As a result, in 2002 the parliament of the United Kingdom discussed the danger to male children of British families intending to visit the ashram of Sathya Sai Baba in case of individual audiences with the guru.",
    "In 2004, the BBC produced a documentary titled The Secret Swami as part of its series \"The World Uncovered\". One central theme of the BBC documentary was again Alaya Rahm's sexual abuse allegations against Sathya Sai Baba. This documentary interviewed him together with Mark Roche, who had spent 25 years of his life since 1969 in the movement and alleged abuse by Sai Baba. The show also featured allegations from Sai Baba critic Basava Premanand. Premanand stated in the documentary that, in his opinion, Sai Baba faked his materializations.",
    "After Sai Baba's death, questions about the manner in which the finances of the organization were going to be managed led to speculations of impropriety, with reports stating that suitcases containing cash and/or gold had been removed from his personal lodgings.",
    "On 17 June 2011, officials from the Sri Sathya Sai Central Trust opened his private residence in the presence of government, bank and tax department officials. In the private residence, which had been sealed since his death, they inventoried 98 kg of gold ornaments, approximate value Rs 21 crores (US$4.7m), 307 kg of silver ornaments, approximate value Rs 16 million (US$0.36m), and Rs 116 million (US$2.6m) in cash. The cash was deposited into the Sai Trust's account at the State Bank of India with payment of government taxes (thus transferring them from religious gifts to Trust assets.) The gold and other items were inventoried, assessed, and placed in secure storage. In July, district authorities inventoried an additional Rs 7.7 million (US$0.17m) in valuables in another 4 rooms. The total value of these items is believed to exceed 7.8 million US dollars. Also inventoried at Yajurmandir were thousands of pure silk sarees, dhotis, shirts, 500 pairs of shoes, dozens of bottles of perfume and hairspray, watches, a large number of silver and gold \"mangala sutrams\", and precious stones such as diamonds. There were also 750 saffron and white robes of the type Sai Baba wore. In July 2011, a similar opening of his Bangalore-area ashram tallied 6 kg of gold coins and jewelry, 245 kg of silver articles and Rs 8 million in cash. These items and goods are believed to have been donated over the years by Sai Baba's devotees from all over the world as religious gifts.",
    "In 2012 Satyaji (Sai Baba's former personal attendant) came forward with a noterised signed, yet unknown, document from Sai Baba, dated from 1967 entailing Sai Baba had \"no personal right on the multi-crore spiritual empire built by him\". In the letter Sai Baba stated, \"Whatever is given to me is under my management, supervision and control as a trustee to be used for public charitable purposes. This declaration I am making so that nobody can claim, under or through me, in the family properties if any.\" Reports stated that for some time Sai Baba's nephew, R.J. Ratnakar Raju was trying to gain control over the trust, whose assets and properties worth hundreds of millions of dollars, led to a conflict between him and the other trust members.\nThe Sri Sathya Sai Central Trust however, never makes the intake or expenditure details of funds into the trust public.\n\"Nobody really knows who the members are in the trust and whether if; or any, changes are made at any point of time.\"",
    "Sathya Sai Baba rejected any allegations of misconduct and was never charged with any offense. During a speech in December 2000, he used the analogy of Jesus Christ and Judas Iscariot , saying, \"in those days there was one Judas, but today there are thousands.\" Addressing the allegations, he said that out of jealousy, hate and fear, many devotees were being bought to speak against him, having been offered money to say nasty things.",
    "His followers have also defended him publicly and attested to what they believed to be his character. These include Bill Aitken , and Anil Kumar, former principal of the Sathya Sai Educational Institute.",
    "In an open letter in December 2001, Prime Minister Atal Bihari Vajpayee , Chief Justices P. N. Bhagwati and Ranganath Misra , and Members of Parliament and Najma Heptulla said that they were \"deeply pained and anguished by the wild, reckless and concocted allegations\" against Sathya Sai Baba, and called him \"an embodiment of love and selfless service to humanity\".",
    "In a 2015 article, writer Paul William Roberts said Sai Baba \"definitely emanated love and could perform extraordinary actions defying explanation. No matter what is said about him, I can only speak for myself, and I have never had any reason to doubt that he is what he said he is.”",
    "Sathya Sai Baba authored 15 books, known as \"Vahinis\" (river or stream), originally written in Telugu and translated into English by Prof. Narayana Kasturi . His public discourses were collected and published into book form known as the \"Sathya Sai Speaks\" series. There are 42 volumes in total, beginning in 1953 and ending in 2010. During the summer months (from 1972 until 2002), Sai Baba gave discourses to his students at the Brindavan university campus in Whitefield . These were collected to create a 15 volume series known as the \"Summer Showers\" series.",
    "There is a large known collection of Bhajans (spiritual songs) written and sung by Sai Baba as well as countless numbers of books about him written by devotees and critics.",
    "Sathya Sai Baba has also been featured in various documentaries and films.",
    "In a 1995 X-Files episode, \" The Calusari \" (season 2, episode 21), during a conversation about vibhuti (sacred ash) Sai Baba's name is cited and mentioned. A fictitious character, Dr. Burk elaborates, \"In 1979, I witnessed a guru named Sai Baba create an entire feast out of thin air.\""
  ],
  "scraped_at": "2025-06-11 06:36:58 UTC"
}