{
  "url": "https://en.wikipedia.org/wiki/Savitri_Jindal",
  "title": "Savitri Jindal",
  "paragraph_count": 9,
  "paragraphs": [
    "Savitri Devi Jindal (born 20 March 1950 ) is an Indian businesswoman and politician. She is the chairperson emeritus of the O.P. Jindal Group. She is also the president of Maharaja Agrasen Medical College, Agroha . As of June 2024, the Jindal family's net worth is estimated at $40 billion.",
    "In October 2024, Saviri Jindal and her family were ranked third on the Forbes list of India’s 100 richest tycoons, with a net worth currently of $34.4 billion.",
    "Jindal was born in Tinsukia , Assam in a Hindu Marwari family. She married Om Prakash Jindal in the 1970s, who had founded the Jindal Group, a steel and power conglomerate. Jindal was a Minister in the Haryana Government and a member of the Haryana Vidhan Sabha ( Legislative Assembly ) from Hisar constituency. She lost the seat in elections held in 2014 for the Haryana assembly. She became the chairperson of the group after her husband, O.P. Jindal, passed away in a helicopter crash in 2005. She is now an independent MLA serving in the Haryana Legislative Assembly . Previously she held membership of both INC and BJP.",
    "Savitri Jindal is the richest woman in India as of 3 March 2024, and the 50th richest person in the world. She is the world's seventh-richest mother and contributes to the public work her husband started. She was conferred with Acharya Tulsi Kartritva Puraskar in 2008 by Akhil Bhartiya Terapanth Mahila Mandal.",
    "In 2005, Jindal was elected to the Haryana Vidhan Sabha from Hisar constituency, which was earlier represented by her late husband Om Prakash Jindal for a long time. In 2009, she was re-elected to the constituency and was appointed the cabinet minister in the Haryana Government on 29 October 2013.",
    "In the previous cabinet, she had served as the Minister of State for Revenue and Disaster Management, Consolidation, Rehabilitation and Housing and also the Minister of State for Urban Local Bodies and Housing. [ citation needed ]",
    "The revenue of the company quadrupled after she took charge of the company. With a background and history from the state of Haryana, she served as a member of the Haryana Legislative Assembly and held the office of Minister of Power till 2010. O.P. Jindal group was started in 1952 by O.P. Jindal, an engineer by profession. It became the conglomerate of steel, power, mining, oil and gas. Each of these four divisions of her business is run by her four sons, Prithviraj, Sajjan , Ratan and Naveen Jindal . Jindal Steel is the third-largest producer of steel in India.",
    "In March 2024, she joined Bharatiya Janata Party ahead of 2024 Indian general election . Her son and politician, Naveen Jindal won the 2024 general election on BJP ticket from Kurukshetra . In October 2024, she contested independently in Haryana State Assembly elections from Hisar and won.",
    "."
  ],
  "scraped_at": "2025-06-11 06:35:47 UTC"
}