{
  "url": "https://en.wikipedia.org/wiki/V._V._S._Laxman",
  "title": "VVS Laxman",
  "paragraph_count": 43,
  "paragraphs": [
    "Vangipurapu Venkata Sai Laxman ( pronunciation ⓘ ; born 1 November 1974) is an Indian former international cricketer and a former cricket commentator and pundit. A right-handed batsman known for his elegant stroke play, Laxman played as a middle-order batsman in Test cricket . Laxman is currently the Head of Cricket at the National Cricket Academy (NCA), and the head coach of the India Under-19 and India A teams. Laxman was a member of the Indian team that was one of the joint-winners of the 2002 ICC Champions Trophy , the title being shared with Sri Lanka.",
    "Laxman is one of the few players to have played 100 Test matches, without ever appearing in a Cricket World Cup . Despite being a relatively slow runner between the wickets, Laxman compensated with his stroke play and fast scoring. In 2002, he was named one of Wisden 's five Cricketers of the Year . He was considered to be a part of the original \"Fab Four\"",
    "In domestic cricket, Laxman represented Hyderabad . He also played for Lancashire in county cricket . He was also the captain of the Deccan Chargers team in the Indian Premier League during its inaugural season. Later, he played for the Kochi Tuskers team. He was the mentor of the Sunrisers Hyderabad until 2021. He is popularly called the 'God of 4th Innings' for his exploits in Tests.",
    "In 2011, Laxman was awarded the Padma Shri award, India's fourth highest civilian award. In 2012, he retired from international cricket.",
    "Laxman was born in Hyderabad , Andhra Pradesh (present-day Telangana ). Laxman's parents are physicians Shantaram and Satyabhama of Vijayawada .",
    "Laxman studied at the Little Flower High School , Hyderabad . Though he joined a medical school for his undergraduate studies, Laxman chose cricket as a career.",
    "He married G. R. Shailaja, a Computer Applications graduate from Guntur , on 16 February 2004. They have two children [ citation needed ] .",
    "Laxman is known for his fluid style, technical soundness and aggressiveness. Sambit Bal of ESPN Crincinfo writes: \"At his sublime best, VVS Laxman is a sight for the gods. Wristy, willowy and sinuous, he can match – sometimes even better – Tendulkar for strokeplay... [He] has the rare gift of being able to hit the same ball to either side.\" He was equally skilled against both pace and spin, with great timing and outstanding ability to place the ball splitting the tightest field positions. Laxman was particularly skillful in using his wrists (reminiscent of his role model and fellow Hyderabadi , Mohammed Azharuddin ) that allowed him to place the same ball to different areas of the field.",
    "Standing tall and still at the crease, Laxman had a keen awareness of the off-stump and a polished ability to dispatch the bad ball. He plays with a high elbow and a steady stance and a textbook technique with natural elegance and flair. At the start of his career, Laxman was rated by Geoffrey Boycott as one of India's best players of the hard (new) ball. However, Indian selectors played around with his batting positions, whenever India felt a lacuna regarding any batting number. He was forced to play in almost every position, including opening. Laxman found his home in the middle order, where he played most of his best innings, batting at numbers 3, 5 and 6. In a 2001 test against Australia and promoted to no. 3 in the second innings from his first innings position of 6, he scored 281 to take India to a huge lead after following on. Though Laxman was ideally suited for No. 3, Rahul Dravid was always preferred over him to bat at one-down, while Sachin Tendulkar was established at No. 4. As a result, Laxman played around 63 percent of his Test innings at No. 5 or 6. This meant that Laxman often found himself batting with tail-end batsmen, and is reflected in his final statistics, which show that he has a relatively high proportion of not out innings (34 of 225, or 15 per cent — for comparison, Tendulkar finished not out in around 10 per cent of his Test innings, and Dravid in 11 per cent). Nevertheless, Laxman batted particularly well with non-specialist lower-order batsmen, and was able, with their support, to save and win numerous matches for India (for example, the Mohali 2010 Test against Australia ).",
    "Laxman made his Under-19 debut for India against Australia in February 1994. Batting at six, he made 88 in his debut innings against a bowling attack that consisted of Brett Lee and Jason Gillespie , both of whom were making their debuts too. In the second game of the series, Laxman scored an unbeaten 151 in the first innings and 77 in the second innings to help his team register a 226-run victory. He continued his good form as he scored 36 and 84 in the third game to end up as the leading run-scorer of the series. The Test series was followed by a 3-match ODI series, where he managed scores of 24, 22 and 77. Later in August that year, the India Under-19 team toured England for 2 ODIs and 3 Test matches. Laxman disappointed in the ODIs with scores of 20 and 5. However, in the first Test he struck 119 in the first innings, but did not get to bat in the second innings as India cruised to a 9-wicket win. He made only 28 in the second match and 4 in the third.",
    "Laxman made his first-class debut for Hyderabad against Punjab in the quarter-final match of 1992–93 Ranji Trophy season. He scored a duck in the first innings and 17 in the second. He played only one match for Hyderabad in the next season, before getting dropped. However, he was named in the South Zone squad for the 1994–95 Duleep Trophy in the back of his impressive outings for India Under-19s, but he failed to score big in the tournament. In the following Ranji Trophy season, Laxman notched up 532 runs from five matches at an average of 76 scoring two centuries. In the semi-final of the Duleep Trophy of 1995–96 season against West Zone , Laxman scored 47 in the first innings and a spectacular 121 in the second innings, sharing a 199-run partnership with skipper Rahul Dravid . He had another brilliant Ranji season the next year, as he piled 775 runs in just 11 innings at an average of 86 with 3 centuries and a best of 203* that came against Karnataka in the semi-final, which Hyderabad eventually lost. He was picked to play for Rest of India against Karnataka in the Irani Cup and also in the Board President's XI squad against the touring Australian team. He played only three matches in 1996–97 Ranji season, where he scored three half-centuries, before getting picked for the Indian Test team against South Africa .",
    "After the tests he joined Lancashire as their overseas player in place of Brad Hodge . He played in five games of the county championship and showed glimpses of his sublime batting. In their final County Championship game of 2007, against Surrey at the Oval, Laxman scored a century in the second innings in which Lancashire were chasing 489 to win. They just missed out by 25 runs and subsequently lost the Championship to Sussex. His performance for Lancashire was good with 380 runs scored in 5 matches at an average of 54.28 with 2 centuries and 2 half-centuries",
    "Laxman was supposed to replace Adam Voges for Nottinghamshire , but this move was vetoed by the BCCI due to the fact that there were players from the rival Indian Cricket League playing for Nottinghamshire.",
    "Laxman was originally named as the Icon Player for his home franchise Deccan Chargers before the first season of the IPL . But he gave up the Icon Player status in a bid to allow his team spend a bigger purse at the auction. The Deccan Chargers bought him at the auction for $375,000 and named him the captain for the first season. However, Laxman dropped himself from the team halfway through the season, after the team had a horrendous run in the tournament. Adam Gilchrist took over as captain and led the side in the next two seasons as well; Laxman did score 155 runs from the 6 games that he played at an average of 31 and strike rate of 118. He batted at 3 in the first few games before opening the innings with Gilchrist in some matches where he found more success. His only half-century of the tournament (52 off 44) came against Royal Challengers Bangalore . He did score a couple more fluent innings that season including an unbeaten 37 from 26 balls against Mumbai Indians and 48 from 34 balls against Kings XI Punjab . However, he struggled with the bat in the next two seasons and sat out the tournament after playing only 5–6 matches.",
    "At the mega-auction in 2011, Laxman was bought by the newly formed franchise of Kochi Tuskers Kerala for $400,000. This time, though, he was injured after the first three games and missed the rest of the season. In the first match against Royal Challengers, he opened the innings with Brendon McCullum and scored an attractive 36 from 29 deliveries. But, the Kochi franchise was terminated later that year and all the players of the team were put in the auction in 2012. However, Laxman, who had a base price of $400,000, found no buyers and he couldn't participate in the 2012 edition of the tournament. Then in IPL 2013, he was appointed as a mentor for Sunrisers Hyderabad Team.",
    "Laxman made his Test debut in 1996 against South Africa at Ahmedabad , scoring a fifty in the second innings of the match. In the second game at Kolkata , he scored 14 and 1. He played just one Test in the South African tour the following month and was unable to cement his place in a star-studded Indian middle order. Instead, he was asked to open the innings, starting in West Indies in 1997. At Kingston , he scored 64 in his first innings as opener. However, he averaged only 28 in that series playing as an opener. But intermittently continued in this role for nearly three years, but without any consistent success. In 1998 at Calcutta , he scored 95 against Australia opening the innings with Navjot Sidhu who scored 97. India went on to win the match by an innings and 219 runs. Though he was selected in the Test squad that toured New Zealand in 1998, he did not get to play a single game as Ajay Jadeja was preferred over Laxman to open the innings with Sidhu. Laxman scored a duck on his ODI debut against Zimbabwe in the Pepsi Tri-Series in 1998. He had a horrible run in the ODIs in 1998 which resulted in him getting dropped from the ODI team for more than a year. Against Pakistan in 1999, he scored just 66 runs from two Tests, averaging a modest 16. In the first match of the Asian Test Championship later that year, Laxman scored 67 against Pakistan, but failed to score consistently, before getting dropped from the Test team as well.",
    "Laxman returned to playing first-class cricket in 1999 to regain his place in the national team. In the 1999–2000 season of Ranji Trophy, he broke the record for most runs in a Ranji season when he made 1415 runs, at an average of 108, in just 9 matches notching up eight hundreds – a record that still remains intact. His performance was rewarded when, in January 2000, he was recalled in the Indian squad for the Australian tour. He scored 167 in the third and final Test match at Sydney when the rest of the batsmen struggled to cope with Glenn McGrath 's destructive bowling, a rare high point for India in an otherwise disastrous tour. Despite this success against an attack containing both McGrath and Shane Warne , Laxman apparently decided that he would return to domestic cricket, rather than continue playing as opener, a role which he believed did not suit him. As a result, Laxman was out of the Test team for nearly a year. He was recalled in late 2000, and also found a spot in the side for the home series against Australia in 2001.",
    "Laxman's career changed dramatically in the 2001 home series against Australia . In the first Test at Mumbai , Laxman made 20 and 12, as the entire Indian batting line-up, with the exception of Sachin Tendulkar , capitulated, leading to a 10-wicket defeat. This was Australia's 16th consecutive Test win and extended their own world record.",
    "In the next Test at Eden Gardens , Kolkata, however, Laxman produced a match-winning and series-defining performance. After scoring 59 in the first innings, Laxman shot to fame with an extraordinary knock of 281 in the second innings ( following on ) when under tremendous pressure and with Australia looking set for a crushing 17th win in a row. He broke Sunil Gavaskar 's long standing Indian Test record score of 236*. This remained the highest ever by an Indian until it was eclipsed by Virender Sehwag 's triple ton against Pakistan in Multan in March 2004. The innings also contributed to a record partnership of 376 with Rahul Dravid who made 180 and together they survived the whole 4th day. Laxman's performance was of enormous consequence: India had been on the brink of an innings defeat but went on to win the Test and the series, denying Steve Waugh 's conquest of the \"final frontier\". This was only the third time in the history of cricket that a team had managed to win a Test after being forced to follow on. It has become one of the most celebrated tales of Indian cricket, and the innings is ranked the sixth best Test innings ever by Wisden Cricketers' Almanack . At the time, the pitch was taking significant turn, and to negate Laxman's free scoring, Australian leg spinner Shane Warne pitched his deliveries into the footmarks outside leg stump. However, such was Laxman's play that he consistently drove the ball through long on for boundaries against the spin, something that is considered to be technically dangerous. When Warne attempted to stop Laxman from scoring by defensively stationing most of the fielders on the leg side ( leg theory ) and bowling outside leg stump, Laxman proceeded to skip down the pitch and drive Warne inside-out through the vacant off side, hitting through the line of a substantially turning ball. Warne later admitted that he was clueless as to how to stop Laxman.",
    "Laxman went on to score 65 and 66 in the third and the final Test match at Chennai , which India won by 2 wickets and won the series 2–1. Laxman had great amount of success batting at No.3 in the ODI series that followed the Tests, as he scored 45, 51, 83, 11 and 101 in the five games, thus cementing his spot in the ODI line-up as well. In the Coca-Cola Tri-Series later that year in Sri Lanka, Laxman scored 212 runs in 7 matches with two fifties and a decent average of 36.",
    "Laxman then cemented his place both in the Test and one day teams for a few years. After bad performances in the Test series against Zimbabwe , he did well in the first two ODIs scoring 75 and 52, but couldn't convert the starts into big knocks in the next three matches. Laxman managed to score a fighting 89 in the second Test at Port Elizabeth , when the rest of the team struggled to survive against Shaun Pollock 's deadly bowling, helping his team put up 201 on the board and avoid an embarrassing follow-on. Against the touring England in late 2001, he scored 75, sharing a 100-plus run partnership with Tendulkar to take his team out of trouble. He had a great tour of West Indies , as he scored 474 runs in 8 innings at an average of 79. He had scores of 69, 69*, 74, 1, 43, 130, 65* and 23 in that series. He performed reasonably well during West Indies tour of India as well, particularly in the third match at Kolkata , where he scored 48 and 154*. He followed it up with brilliant showing in the 7-match ODI series as well with scores of 47, 99, 66 and 71 in the first five games. But his form dropped during India's tour of New Zealand in 2002–03. In the first Test at Wellington , he got a pair and in the second match he could score only 23 and 4. However, he had a brilliant 2-match Test series against the same team in India as he scored a half-century along with 44 in the first Test and 104* and 67* in the second match. He won the Man of the Series award for his impressive batting performances in the two Test match series. In October 2003, he scored 102 in the first ODI against Australia at Gwalior , sharing a 190-run second wicket partnership with Tendulkar. However he failed to deliver on a consistent basis in ODIs. He continued to perform well against Australia, especially during India's tour of Australia in 2003–04, in which he hit three ODI and two Test centuries. He was involved in two century partnerships, one with Tendulkar and the other with Dravid, in the Brisbane ODI against Australia where he remained unbeaten on 102. His 106* against the same opponents at Sydney saw him put up a fourth-wicket partnership of 213 runs with Yuvraj Singh , who scored his career-best 139. In the next ODI against Zimbabwe, Laxman scored a 138-ball 131, once again setting up 2 hundred-run stands. He scored 148 in the famous Adelaide Test, sharing a triple century partnership with Rahul Dravid , which India won by 4 wickets. This was their first Test victory in Australia in two decades. His innings of 178 at Sydney also came in a triple century partnership, on this occasion with Sachin Tendulkar . India went on to post 705/7 in their first innings which is their highest total in Test cricket. Laxman scored a total of 494 runs from the 4 Tests at a staggering average of 82. During this series, Ian Chappell described Laxman as Very Very Special Laxman. His 107 (104) against Pakistan in the fifth and the final ODI at Lahore , helped India win by 40 runs and clinch the series 3–2.",
    "However, Laxman's form was on the decline since the series against Australia. Beginning with the series in Pakistan in 2004, Laxman had only 8 Test centuries to his credit. He averaged just 31 in the Test series in Pakistan in 3 matches. His only half-century (71) came in a high-scoring game at Rawalpindi where India made a mammoth 600 to win the game by an innings and 131 runs. He struggled to score in the ODI series in England which put question marks over his future in the shorter format. He struggled against his favourite opponents Australia in the home series in October–November 2004, although his 69 in the low-scoring final Test at Mumbai was instrumental for India to record a consolation victory. He had a mixed Test series against Pakistan in 2005. He scored 58 in the first Test, 0 and 24 in the second and 79* and 5 in the third. He batted well in the Sri Lanka Test series scoring a fifty at Delhi and a crucial century (104) in the last match at Ahmedabad . Laxman was dropped after scoring a duck in the first Test against England at Nagpur in March 2006. He regained his place for the tour of the West Indies in place of the injured Tendulkar, and made a hundred in the third Test. He also scored a resilient 63 in the second innings to deny West Indies the victory in the same match. In ODIs, Laxman was left out persistently since Greg Chappell took over as coach in mid-2005, mainly on account of his slow ground fielding and running between the wickets; Laxman is a highly regarded close-catching fielder in stationary positions but in ODIs, these positions are generally disused except for the opening phases of the match, and players otherwise have to patrol substantial spaces and retrieve balls. Another reason was a perception that his batting is too one paced for ODI cricket and that he lacks the ability to score at a high rate as required when the batting team has the momentum, or in the closing stages of the innings. This was despite his superb form in Australia and Pakistan in early 2004, when he made four centuries in 14 games, including three in a week in the VB Series in Australia.",
    "In December 2005, Laxman helped India to victory against Sri Lanka with a fine century. In June 2006, Laxman again rescued India from a difficult position against the West Indies with a gritty century. In November 2006, he was selected in the test squad for India's tour of South Africa. In the first test in Johannesburg Laxman scored 73 in the second innings to help India claim a historic 123 run win. In the 2007 tour of England Laxman produced three good innings, two of which were half-centuries and a vital 39 that helped India draw the first test at Lords. He passed the 5000 run landmark in the first day of the final test.",
    "In India's home series against Pakistan in 2007, V.V.S. Laxman once again showed his importance to the team with a disciplined batting performance in the 1st Test at Delhi , as he scored 72* in dire circumstances. He then followed that innings of 72 in the first test with 112 in the second test. This ensured his place on the tour of Australia which would be his third to that country.",
    "Laxman's good form continued in the 2007–08 Test series against Australia with him scoring 109 against Australia on the second day of the controversial Sydney Test to put India back into the contest. It was his 12th hundred in Test matches, and his fifth against Australia. It was also his third consecutive century at SCG , giving him an average well above 90 at the venue. He followed this up with a gritty knock of 79 in Perth , assisted by Mahendra Singh Dhoni and RP Singh , which set India up to record a historic and unexpected victory at a ground on which previously no Asian team had won. He hit 51 in the first innings of the final Test at Adelaide. He finished as the second highest run-getter for India in that series, only behind Sachin Tendulkar .",
    "He, like all other Indian batsmen, struggled in Sri Lanka against the spin duo of Muttiah Muralitharan and Ajantha Mendis later in July–August that year. India lost the first Test by an innings and 239 runs at Colombo , where Laxman's first innings score of 50 was the only half-century scored by an Indian batsman in either innings. Laxman scored another fifty in that series, in the third Test, an unbeaten 61 as India went on to lose the game by 8 wickets and the series 2–1. Laxman was dismissed by Mendis on all five occasions in that series. He also crossed the 6000-run milestone during the series. [ citation needed ]",
    "Against Australia, in the Border–Gavaskar Trophy later that year, Laxman was in top form as he scored 381 runs from 4 Tests with a double-hundred and two fifties. During the third Test at the Feroz Shah Kotla in Delhi, Laxman scored an unbeaten 200 in the first innings with characteristic use of his wrists and flicks through the leg side. In the same innings, Gautam Gambhir scored 206, Laxman and Gambhir becoming the first pair of batsmen to score double-centuries in the same innings for India, and the first to do so against Australia. This was his second double-century in Test cricket with the previous one coming against the same opponents. He made an unbeaten 59 in the second innings and was named Man of the Match. The match was also the last game of India's spin wizard Anil Kumble who was also the captain of the team. In the final Test at Nagpur , Laxman scored another half-century in the first innings of the match.",
    "In 2009, Laxman continued to be in brilliant form. He had scored 76 and 124* in the 2nd Test at Napier in New Zealand. The century helped India salvage a draw and avoid an innings defeat. In the next match at Wellington he hit a well-composed 61 in the second innings. Against Sri Lanka later that year in a home series, Laxman hit three fifties in four innings as India went on to win the series comfortably. His unbeaten 51 in the second innings combining with a hundred from Tendulkar helped India draw the first Test at Ahmedabad . Laxman scored two fifties in the next two games as India went on to win both matches by an innings.",
    "He injured himself during the first match of the two-match Test series in Bangladesh in January 2010 after scoring another unbeaten half-century. The injury forced him to sit out for three weeks and he returned to action only during the final Test against South Africa held in Kolkata . He scored 143* in a record stand for the seventh wicket with MS Dhoni . The test was eventually won by India by an innings and 57 runs in the last 10 minutes of the fifth day's play, despite centuries in both innings from South African batsman Hashim Amla . This victory also helped India draw the Test series and remain the world Number 1 team. He also passed 7000 Test runs during the innings.",
    "Laxman helped India to level the series with Sri Lanka in August 2010 when he hit 103 not out in the run-chase, resulting in a five-wicket win in the Third Test, after scoring 69 in the first innings. He was awarded the Man of the Match for this brilliant effort. He scored a total of 279 runs in that series at an average of 70.",
    "In October, he once again turned around another match that appeared headed for a comfortable Australian victory, in the first Test in Mohali. Laxman was suffering with a back problem and needed Suresh Raina as his runner, and the Indians had collapsed to 124/8 in pursuit of 216. He and paceman Ishant Sharma put on 81 to take the score to 205 before Sharma fell. Last man Pragyan Ojha then managed to survive till the end as the hosts completed a thrilling one-wicket win. Laxman ended on 73 not out. He was ruled out of the remaining matches of the series due to his injury. In November, he helped India recover from 15/5 in the second innings of the first Test against New Zealand at Ahmedabad and the match was drawn. In the second match of the series at his home ground Hyderabad , he scored 74 and the match ended in another draw.",
    "After failing in the first Test of the South African tour, Laxman once again helped India to a historic win at Durban . India struggled to cope with Dale Steyn in the first innings before getting bundled out for 205. Laxman's 38 was the highest score in that innings. In the second innings, India were struggling at 94/5 and he put on crucial partnerships with Dhoni and Zaheer Khan to help his team to 228, giving South Africa a target of 303. South Africa were bundled out for 215 giving India an 87-run win that helped level the series 1–1. He was awarded the Man of the Match for his match-winning innings of 96.",
    "In three test matches, Laxman scored three consecutive fifties including two scores in eighties against the West Indies during India's tour of West Indies in June 2011.",
    "During India's Tour to England, Laxman scored just two half-centuries in eight innings as India went down 0–4 to England. This was India's first Test series loss since its 2007–08 tour of Australia. Laxman got out with the pull shot frequently in this series, which otherwise he is good at.\nAs part of West Indies tour to India in September 2011, Laxman scored a magnificent 176 not out in the second test, and India went to win the match by an innings and 13 runs. Laxman was adjudged Man of the Match. India went on to win the series 1–0.",
    "Laxman failed to live to his expectations during India's tour of Australia in November 2011, as India went down 0–4 to Australia, with Laxman scoring only two half centuries in eight innings. For the first time in four tours to Australia, Laxman failed to register a century in the series; and also for the first time in four test matches played at Sydney Cricket Ground he failed to touch the three figure mark.",
    "After this series, there were calls from the media and former cricketers that it was time for older players like Laxman, Dravid and Sachin to consider retirement.",
    "On 18 August 2012, Laxman announced his retirement from international cricket. Although he was selected for the upcoming New Zealand series, he opted not to play in the series but he will play in domestic cricket for Hyderabad and the Indian Premier League . It was announced that the northern stand at the Rajiv Gandhi International Cricket Stadium will now be named after him.",
    "Laxman was particularly prolific against Australia , in both Tests and One Day Internationals . Six out of his 17 Test hundreds, and four out of his six ODI hundreds came against Australia. He has two double-centuries in Tests, both against Australia: his personal best of 281 at Kolkata in 2000–01, and 200 not out at Feroz Shah Kotla in 2008–09. The Australians admitted that they did not know where to bowl to him.",
    "A very occasional bowler at Test level, Laxman took 2 wickets in his test career. One against the West Indies, and the other against Pakistan.",
    "Laxman is one of the member of the elite three-man panel that consists of himself, Sachin Tendulkar and Sourav Ganguly . This three-man panel is known as the Cricket Advisory Committee of BCCI. The Cricket Advisory Committee (CAC) was set up by Anurag Thakur (then Secretary) and late BCCI President Jagmohan Dalmiya . This committee was set up to advise BCCI on various issues and to help BCCI with their immense cricketing experience. The Cricket Advisory Committee took several important decisions that includes the recommendation for the selection of Anil Kumble (ex-coach) who stepped down as the coach and recommendation of selection of Ravi Shastri (ex-coach) for the post of coach of the Indian cricket team.",
    "Laxman was also appointed as the batting consultant in Cricket Association of Bengal (CAB)'s vision 2020 project.",
    "Laxman made his Test debut against South Africa in November 1996, and took almost four years to score his first century when he scored 167 against Australia at the Sydney Cricket Ground in 2000. Laxman's next century came against the same team in 2001, when he made 281 at Eden Gardens , Kolkata . The score is the highest individual score in a Test match between India and Australia. It was also the highest individual score by an Indian at that time. In Test matches, Laxman has scored centuries against all the Test cricket playing nations except England and Bangladesh . As of 2012, he is seventh on the list of leading Test century makers for India. Laxman has scored two double centuries and has been dismissed four times between the score of 90 and 99 in test matches.",
    "In ODIs, Laxman has scored six centuries against three countries including four against Australia. His first ODI century was against Australia in the last match of a five match series, held at the Fatorda Stadium in Margao in 2001. His highest score of 131 came against Zimbabwe at the Adelaide Oval in 2004. Two out of his six ODI centuries were scored at home grounds and four were at away (opposition's home) or neutral venues. He has been dismissed once between the score of 90 and 99."
  ],
  "scraped_at": "2025-06-11 06:40:34 UTC"
}