{
  "url": "https://en.wikipedia.org/wiki/Vinoba_Bhave",
  "title": "Vinoba Bhave",
  "paragraph_count": 21,
  "paragraphs": [
    "Vinayak Narahar Bhave , also known as Vinoba Bhave ( pronunciation ⓘ ; 11 September 1895 – 15 November 1982), was an Indian advocate of nonviolence and human rights. Often called Acharya (Teacher in Sanskrit ), he is best known for the Bhoodan Movement . He is considered as National Teacher of India and the spiritual successor of Mahatma Gandhi . He was an eminent philosopher. He translated the Bhagavad Gita into the Marathi language by him with the title Geetai (meaning 'Mother Gīta' in Marathi ).",
    "Vinayak Narahar Bhave was born on 11 September 1895 in a small village called Gagoji (present-day Gagode Budruk) in Kolaba in the Konkan region of what is now Maharashtra . Vinayaka was the eldest son of Narahar Shambhu Rao and Rukmani Devi. The couple had five children; four sons named Vinayaka (affectionately called Vinya), Balakrishna, Shivaji and Dattatreya, and one daughter Shanti.  His father was a trained weaver with a modern rationalist outlook and worked in Baroda . Vinayaka was brought up by his grandfather, Shamburao Bhave and was greatly influenced by his mother Rukmini Devi, a religious woman from Karnataka . Vinayaka was highly inspired after reading the Bhagavad Gita , at a very young age.",
    "A report in the newspapers about Gandhi's speech at the newly founded Banaras Hindu University attracted Bhave's attention. In 1916, after reading a newspaper piece by Mahatma Gandhi , Bhave threw his school and college certificates into a fire on his way to Bombay to appear for the intermediate examination . \nHe wrote a letter to Gandhi and after an exchange of letters, Gandhi advised Bhave to come for a personal meeting at Kochrab Ashram in Ahmedabad . Bhave met Gandhi on 7 June 1916 and subsequently abandoned his studies. Bhave participated with a keen interest in the activities at Gandhi''s Sabarmati ashram , like teaching, studying, spinning and improving the lives of the community. His involvement with Gandhi's constructive programmes related to Khadi , village industries, new education ( Nai Talim ), sanitation and hygiene also kept on increasing.",
    "Bhave went to Wardha on 8 April 1921 to take charge of the Ashram as desired by Gandhi. In 1923, he brought out Maharashtra Dharma , a Marathi monthly which had his essays on the Upanishads. Later on, this monthly became a weekly and continued for three years. In 1925, Gandhi sent him to Vaikom , Kerala to supervise the entry of the Harijans to the temple.",
    "Bhave was arrested several times during the 1920s and 1930s and served a five-year jail sentence in the 1940s for leading non-violent resistance to British rule . The jails for Bhave had become the places of reading and writing. He wrote Ishavasyavritti and Sthitaprajna Darshan in jail. He also learnt four South Indian languages and created the script of Lok Nagari at Vellore jail. In the jails, he gave a series of talks on the Bhagavad Gita in Marathi, to his fellow prisoners. Bhave participated in the nationwide civil disobedience periodically conducted against the British and was imprisoned with other nationalists. Despite these many activities, he was not well known to the public. He gained national prominence when Gandhi chose him as the first participant in a new nonviolent campaign in 1940. All were calling him by his short name, Vinoba.\nBhave's younger brother Balkrishna was also a Gandhian. Gandhi entrusted him and Manibhai Desai to set up a nature therapy ashram at Urali Kanchan where Balkrishna spent all his life.",
    "He was associated with Mahatma Gandhi in the Indian independence movement . He stayed for some time at Gandhi's Sabarmati ashram in a cottage that was named after him, 'Vinoba Kutir'. He gave talks on the Bhagavad Gita in Marathi to his fellow ashramites. These were later published in book form, as Talks on the Gita , and it has been translated into many languages both in India and elsewhere. Bhave felt that the source of these talks was something from above and he believed that its influence would endure even if his other works were forgotten.",
    "In the year 1940, he was chosen by Gandhi to be the first individual Satyagrahi (an individual standing up for Truth instead of a collective action ) against the British colonisation. It is said that Gandhi envied and respected Bhave's celibacy, a vow he made in his adolescence, in fitting with his belief in the Brahmacharya principle. Bhave also participated in the Quit India Movement .",
    "Bhave's religious outlook was very broad and it synthesized the truths of many religions. This can be seen in one of his hymns \"Om Tat Sat\" which contains symbols of many religions. His slogan \"जय जगत्\" (Jay Jagat) i.e. \"victory to the world\" finds reflection in his views about the world as a whole.",
    "Bhave observed the life of the average Indian living in a village and tried to find solutions for the problems he faced with a firm spiritual foundation. This formed the core of his Sarvodaya movement . Another example of this is the Bhoodan (land gift) movement started at Pochampally on 18 April 1951, after interacting with 80 Harijan families. He walked all across India asking people with land to consider him one of their sons and so gave him one-sixth of their land which he then distributed to the landless poor. Non-violence and compassion is a hallmarks of his philosophy, he also campaigned against the slaughtering of cows.",
    "Bhave said, \"I have walked all over India for 13 years. In the backdrop of the enduring perpetuity of my life's work, I have established 6 ashrams.\"",
    "The Brahma Vidya Mandir was founded in 1959 in Paunar, Maharashtra and is one of the ashrams established by Bhave. It was created for women to become self-sufficient and practice non-violence within the community. They used Gandhi's beliefs, which was heavily influenced by the Bhagavad-Gita , to aid in agricultural practices that were non-violent and produce sustainable food. The community performed prayers as a group every day, reciting from the Isha Upanishad at dawn, the Vishnu Sahasranama at mid-morning, and the Bhagavad-Gita in the evening. As of today, there are around 25 women who are members of the community and several men have also been allowed to join the community.",
    "BVM's existence demonstrates how a self sufficient community can apply non-violence and radical democracy to their own social and geographic context in food production. One mainstream narrative is that large-scale agriculture is \"inevitable, necessary, and the sole possibility of feeding the world\" and relies on expensive technology.  However, BVM rejects this narrative and continues to use Gandhian principles in agriculture such as nonviolence. It is a small community in India and does not hold much influence to promote its beliefs and practices in the mainstream. Most agricultural practices in India has adopted US-style consumerism. BVM is still important as its ideals can help shape agriculture for the better and focus less on profit.",
    "Vinoba Bhave was a scholar, thinker, and writer who produced numerous books. He was a translator who made Sanskrit texts accessible to the common man. He was also an orator and linguist with an excellent command of several languages (Marathi, Kannada, Gujarati, Hindi, Urdu, English, and Sanskrit).",
    "Bhave was an innovative social reformer. He called \"Kannada\" script the \"Queen of World Scripts\" ( Vishwa Lipigala Raani ). He wrote brief introductions to, and criticisms of, several religious and philosophical works like the Bhagavad Gita, works of Adi Shankaracharya , the Bible and the Quran . His views of Dnyaneshwar's poetry and works by other Marathi saints are pretty brilliant and a testimony to the breadth of his intellect.",
    "Bhave had translated the Bhagavad Gita into Marathi. He was deeply influenced by the Gita and attempted to imbibe its teachings into his life, often stating that \"The Gita is my life's breath\".",
    "Vinoba Bhave University , located in Hazaribagh district in the state of Jharkhand , is named after him.",
    "On 18 April 1951, Bhave started his land donation movement at Pochampally of Nalgonda district Telangana , the Bhoodan Movement . He took donated land from landowner Indians and gave\nit away to the poor and landless, for them to cultivate.  Then after 1954, he started to ask for donations from whole villages in a programme he called Gramdan. He got more than 1000 villages by way of donations. Out of these, he obtained 175 donated villages in Tamil Nadu alone. Noted Gandhian and an atheist Lavanam was the interpreter for Bhave during his land reform movement in Andhra Pradesh and parts of Orissa.",
    "Bhave spent the later part of his life at his Brahma Vidya Mandir ashram in Paunar in Wardha district of Maharashtra. He died on 15 November 1982 after refusing food and medicine for a few days by accepting \"Samadhi Maran\" / \" Santhara \" as described in Jainism . Then the Prime Minister of India, Indira Gandhi , who was visiting Moscow to attend the funeral of Soviet leader Leonid Brezhnev , cut short her visit to be at the Bhave's funeral.",
    "V.S. Naipaul has scathingly criticised Bhave in his collection of essays citing his lack of connection with rationality and excessive imitation of Gandhi. Even some of his admirers find fault with the extent of his devotion to Gandhi. Much more controversial was his support, ranging from covert to open, to the Congress Party's government under Indira Gandhi, which was fast becoming unpopular. He controversially backed the Indian Emergency imposed by Prime Minister Indira Gandhi , calling it Anushasana Parva ( Time for Discipline ). Jayaprakash Narayan in his prison diary during the emergency sarcastically wrote about the meaning of Anushasan Parva. Congress party opponents at that time had coined the derogatory term \"Sarkari Sant (Government Saint)\" to describe him. Noted Marathi writer Pra Ke Atre publicly criticised him and mocked him by writing an article titled \"Vanaroba\" which is a disambiguation of the name \"Vinoba\" and means monkey .",
    "In 1958 Bhave was the first recipient of the international Ramon Magsaysay Award for Community Leadership. He was awarded the Bharat Ratna posthumously in 1983.",
    "Vinoba Bhave, The Man , a documentary film on the social-reformer directed by Vishram Bedekar was released in 1963. It was produced by the Government of India 's Films Division . Indian film director Sarvottam Badami had earlier made another documentary on him, Vinoba Bhave , in 1951."
  ],
  "scraped_at": "2025-06-11 06:31:08 UTC"
}