{
  "url": "https://en.wikipedia.org/wiki/Virat_Kohli",
  "title": "Virat Kohli",
  "paragraph_count": 92,
  "paragraphs": [
    "Virat Kohli (born 5 November 1988) is an Indian international cricketer who plays ODI cricket for the national team and is a former captain in all formats. He is a right-handed batsman and occasional right-arm medium pace bowler . Considered one of the greatest all-format batsmen in the history of cricket , he is called the King, the Chase Master, and the Run Machine for his skills, records and ability to lead his team to victory. Kohli is the highest run-scorer in the Indian Premier League , third in T20I , third in ODI , and third in international cricket. He has the most ODI centuries and second-most centuries in international cricket , with a total of 82 centuries across all international formats of the game. Kohli is also the most successful Test captain of India with back-to-back Test mace wins and most victories in his tenure. He is the only batter to earn 900 rating points in all three formats.",
    "Kohli was the captain of the 2008 U19 World Cup winning team and was a crucial member of the teams that won 2011 ODI World Cup , 2013 Champions Trophy , 2024 T20 World Cup , and 2025 Champions Trophy . He plays for Royal Challengers Bengaluru in the Indian Premier League and for Delhi in domestic cricket . In 2013, Kohli was ranked number one in the ODI batting rankings . In 2015, he achieved the same in T20I. In 2018, he was ranked number one in Test, making him the only Indian to hold the number one spot in all three formats. He is the first player to score 20,000 runs in a decade. He was the Cricketer of the Decade for 2011 to 2020 .",
    "Kohli has won ten ICC Awards , making him the most awarded player in international cricket history. He won the ODI Player of the Year award four times in 2012, 2017, 2018, and 2023. He won the Cricketer of the Year award, on two occasions, in 2017 and 2018. In 2018, he became the first player to win all three major awards including Cricketer of the Year, ODI Player of the Year and Test Player of the Year in the same year. He was honored with the Spirit of Cricket Award in 2019 and given the Cricketer of the Decade and ODI Cricketer of the Decade in 2020. Kohli was named the Wisden Leading Cricketer in the World for three consecutive years.",
    "Kohli has the most Player of the Series and second most Player of the Match awards to his name in all three formats combined. He was honoured with the Arjuna Award in 2013, the Padma Shri in 2017, and India's highest sporting honour, the Khel Ratna Award , in 2018. Time included him on its 100 most influential people in the world list in 2018.",
    "After winning the 2024 T20 World Cup and winning the Player of the Match award in the final , Kohli announced his retirement from T20Is. On 12 May 2025, aged 36, he announced his retirement from the Test format. He is married to actress Anushka Sharma , and they have two children.",
    "Kohli was born on 5 November 1988 in Delhi into a Punjabi Hindu family. His mother Saroj Kohli is as a housewife while his father Prem Nath Kohli worked as a criminal lawyer. He has an elder brother Vikas and an elder sister Bhawna. His formative years were spent in Uttam Nagar . His early education was at Vishal Bharti Public School. As per his family, Kohli exhibited an early affinity for cricket as a 3-year-old. He would pick up a bat and request his father bowl to him.",
    "In 1998, the West Delhi Cricket Academy was created. In May, his father arranged for him to meet Rajkumar Sharma . Upon the suggestion of their neighbours, Kohli's father considered enrolling his son in a professional cricket academy, as they believed his ability merited more than gully cricket . He was unable to secure a place in the U-14 Delhi team, due to extraneous factors. His father reportedly received offers to relocate his son to influential clubs, which would ensure his selection, but he declined the proposals.",
    "Kohli found his way into the U-15 team. He received training at the academy and participated in matches at the Sumeet Dogra Academy located at Vasundhara Enclave . In pursuit of furthering his cricketing career, he transferred to Saviour Convent School during his ninth-grade education.",
    "On 18 December 2006, his father died of a stroke. As per his mother, Kohli's demeanour shifted noticeably after his father's death. He took on cricket with newfound seriousness, prioritising playing time and dedicating himself fully to the sport. Kohli's family resided in Meera Bagh , Paschim Vihar until the year 2015, after which they relocated to Gurgaon .",
    "Kohli's junior cricket career kicked off in October 2002 at the Luhnu Cricket Ground against Himachal Pradesh . His first half-century in domestic cricket happened at Feroze Shah Kotla , where he scored 70 runs against Haryana . By the season's end, he had amassed a total of 172 runs, emerging as the highest run-scorer for his side with an average of 34.40. During the 2003–2004 season, Kohli was appointed the captain of the U-15 team. He scored 54 runs in Delhi 's victory over Himachal Pradesh. In the next fixture against Jammu and Kashmir , Kohli scored his maiden century with a score of 119. By the end of the season, he had a total of 390 runs at an average of 78, which included two centuries. Towards the end of 2004, Kohli earned selection for the 2004–2005 Vijay Merchant Trophy with the Delhi U-17 team. In the four matches that he played, Kohli had a total of 470 runs, with his highest score being 251 * runs.",
    "The team's coach, Ajit Chaudhary, lauded his performance and was particularly impressed with his temperament on the field. He commenced the 2005–2006 season with a score of 227 against Punjab . The team later secured the tournament with a five-wicket win over Mumbai , where he contributed with a half-century in the first innings . He was the highest run-scorer with a total of 757 runs from 7 matches, averaging 84.11.",
    "I did not see him waste his time. If not on the field, he would be busy in the gym. I saw him first as a chubby-cheeked bubbly young kid who grew into a perfect athlete.",
    "On 18 February 2006, Kohli made his debut in List A cricket, playing against Services in the Ranji One-Day Trophy , but he did not get the opportunity to bat during the match. In 2006, Kohli got a spot in the state senior team. Subsequently, he made his first-class debut on 23 November 2006, during the opening match of the Ranji Trophy against Tamil Nadu . During the tournament, his father died. Despite the heartbreaking news, Kohli returned to the match and scored 90 runs. Chetan Chauhan , the coach, was impressed by his determination in the face of adversity. Venkatesh Prasad praised him and his knock, which was executed in the midst of an emotional turmoil. Kohli attended his father's funeral post his dismissal. His innings proved to be crucial for Delhi as they were able to avoid the follow-on . The team's captain Mithun Manhas lauded Kohli.",
    "Kohli's foray into T20 cricket first happened in April 2007, during the Inter-State T20 Championship , where he emerged as the top run-getter for his team with a tally of 179 runs at an average of 35.80. In Sep 2008, Kohli played in Nissar Trophy against SNGPL . He emerged as the leading scorer for Delhi in both innings. During the 2009–2010 Ranji Trophy season, Kohli helped Delhi secure the bonus point required for victory.",
    "In July 2006, Kohli was selected in the India Under-19 squad on its tour of England . The team's coach Lalchand Rajput noted Kohli's adeptness in facing pace and spin bowling and showed his appreciation for his technical prowess. He came into the limelight in 2008 when he led the team to victory at the 2008 U19 World Cup held in Malaysia . He amassed 235 runs at an average of 47, ranking as the tournament's third-highest scorer and one of three cricketers to compile a century. His century, a knock of 100 runs off 74 balls, was lauded by ESPNcricinfo as \"the innings of the tournament\" and he won the Player of the match award. Kohli's performances did not go unnoticed by the selectors who were observing his progress. He began his international cricket journey by joining the senior team in Colombo .",
    "Kohli made his international debut in August 2008 at the age of 19. After his brilliant performances, featuring half-centuries and centuries, he was awarded a contract by the Board of Control for Cricket in India . He scored his maiden ODI century, 107 off 114 balls. Alongside, he struck a brilliant 224 run partnership with Gautam Gambhir .",
    "In January 2010, Kohli became just the third Indian to score two ODI centuries before the age of 22. He became the fastest Indian to reach 1,000 runs in ODIs, achieving this milestone in 24 innings. He made his T20I debut against Zimbabwe at Harare .",
    "He is a very physical type of player. He likes to impose himself on the game, backs it up with his skill.",
    "During the 2011 ODI World Cup , he became the first Indian to score a century on his WC debut. He then made his Test debut at Kingston . Game after game, he created his reputation as an expert of the chase. He was the leading run-getter in ODIs for the year 2011, with 1381 runs from 34 matches as well as four centuries and eight fifties.",
    "In 2012, former Australian cricketer Dean Jones called Kohli's play one of the greatest ODI knocks of all time. During the 2012 Asia Cup , he was the leading run-scorer with 357 runs at an average of 119. He helped India chase a score of 330, which was their highest successful ODI run chase then. His knock was the highest individual score in Asia Cup history. During the 2012 T20 World Cup , he scored 185 runs becoming the highest India scorer. He was named in the Team of the Tournament by ICC.",
    "During the 2013 Champions Trophy India eon the tournament. Kohli was named in the Team of the Tournament by the ICC. In a series, he helped India chase down 360 with more than six overs left. It was the second-highest successful run-chase in ODIs at the time while Kohli's knock became the fastest century against Australia and third fastest in a run chase. He also became the fastest batsman in the world to score 17 hundreds in ODIs. Kohli moved to the top position in the ODI rankings due to his performance.",
    "I love watching Virat Kohli bat. He looks to me like an individual of my own heart. I love his aggression, and he has serious passion that I used to have. He reminds me of myself.",
    "During the 2014 T20 World Cup , Kohli was named the vice-captain. He made a total of 319 runs at an average of 106.33, recording the most runs by a batter in a single T20 WC tournament. For his consistency, he won the Player of the Tournament award.",
    "He topped the T20I batting rankings soon after. Kohli became the fastest batter in the world to go past the 6000-run mark in the ODIs. In December, he was revealed to be the stand-in Test captain. Kohli scored 115, becoming the fourth Indian to score a hundred on Test captaincy debut.",
    "From the beginning, I was very sure that he was a rare talent and would become a great player. He grew massively in these past few years and has matured a lot. I was fortunate to be part of that process of seeing him grow and that give me immense pleasure.",
    "After MS Dhoni announced his retirement from Test cricket, he was appointed as the full-time Test captain. Kohli's total of 692 runs in four Tests is the most by any Indian batsman in a Test series in Australia. The 2015 ODI World Cup saw him score 107 runs from 126 deliveries against Pakistan. He was awarded the Player of the Match.",
    "In 2016, he became the fastest batter in the world to make 1,000 runs in T20Is, reaching the milestone in 27 innings. He became the fastest batter in the world to cross the 7000-run mark in ODIs in 161vinnings and the fastest to get to 25 centuries. He was also instrumental in India winning the 2016 Asia Cup . During the 2016 T20 World Cup , his innings against Australia  was \"an innings of sheer class\" with \"clean cricket shots\". He scored 273 runs in 5 matches at an average of 136.50, earning him his 2nd consecutive Player of the Tournament award at the event. He was named the captain of the Team of the Tournament by ICC. He proceeded to top the Test rankings.",
    "Kohli is the next chosen one. He exudes the intensity of Dravid , the audacity of Sehwag , and the extraordinary range of Tendulkar .",
    "Kohli scored double centuries, becoming the first batter to score double centuries in four consecutive series. When it came to the 2017 Champions Trophy , he scored 96* runs to become the fastest batsman in terms of innings to reach 8,000 runs in ODIs in 175 innings. He was also named in the Team of the Tournament by the ICC.",
    "In 2017, he completed 200 ODIs and made a new record for the most runs (8,888), best average (55.55) and the highest number of centuries (31) for a batter. Kohli went on to become the first batsman to score six double hundreds as a captain. When he scored 610 runs in a series, he became the highest run-scorer by an Indian in a three-match Test and the 4th highest overall.",
    "With this win, India equaled Australia for the record streak of nine consecutive series wins in Test cricket. He ended the year with 2818 international runs, the highest tally ever by an Indian player. ICC named Kohli as thevcaptain of their 2017 World Test XI and ODI XI. He became the first Indian captain to win an ODI series in South Africa.",
    "He then became the number one ranked Test batsman, becoming the seventh Indian to achieve this feat. The Guardian described Kohli's performance as \"one of the greatest batting displays.\" In 2018, he became the 12th batsman to amass 10,000 ODI runs in ODIs. He scored his 25th test hundred in Perth , which was his 6th hundred in three tours to Australia making him the only Indian to score 6 test hundreds in Australia after Sachin Tendulkar . It was called one of his finest against a quality Australian attack. After the team's victory, he became the first Asian or Indian captain to win a Test series in Australia. He was again named as captain of the 2018 World Test XI and ODI XI.",
    "I cannot think there has been a better ODI player in history.",
    "During the 2019 ODI World Cup , Kohli was the fastest batter to score 11,000 runs in ODI in 222 innings. He became the fastest to score 20,000 runs in international cricket in 417 innings. Kohli scored five consecutive fifty plus scores in the tournament. During the next Test series, Kohli became the most successful test captain for India, going past MS Dhoni who had 27 wins. He became the first Indian batter to score seven double centuries in Tests . Soon after, he became the fastest captain to score 5,000 runs in Tests and scored his 70th century.",
    "In 2020, he was nominated for Cricketer of the Decade as well as the Test, ODI and T20I Player of the Decade. He won Cricketer of the Decade and ODI Player of the Decade awards. Kohli became the first batter to complete 3,000 runs in T20I. In 2021, he became the fastest batter to score 23,000 runs in international cricket in innings. He became the 2nd captain after Kapil Dev to win two tests in a series in England. After the 2021 T20 World Cup , he decision to step down as the T20 captain.",
    "He redefined expectations, challenged conventions, and symbolised the self-assured, unapologetic India of the 21st century. Kohli lit the fire. He tore the script and authored a new one.",
    "In 2022, he also stepped down as the Test captain. At the 2022 Asia Cup , he scored his maiden T20I century against Afghanistan with 122 runs from 61 balls. During the 2022 T20 World Cup , Kohli scored 82* and won the match for his team, creating history by winning a match almost impossible to win. His six against Haris Rauf is considered as one of the greatest sixes of all time. He rated this as his best innings in the format due to the magnitude of the game. Wisden deemed this particular innings as the acme of the tournament. Kohli finished as the highest run-scorer in the tournament, with 296 runs to his name at an average of 98.66. For his brilliant performance, he was a part of the Team of the Tournament by ICC. In 2023, he claimed the massive record for the second-most centuries scored across all formats in international cricket.",
    "In 2023, Kohli scored his 21st ODI century in India, the most by a player in a country. It was also his 10th against Sri Lanka, the most by a player against any opposition. His performance led to him to becoming the fifth highest run-scorer in ODI cricket , beating Mahela Jayawardene . During the 2023 Asia Cup , he hit a century and an unbeaten 233 run partnership with KL Rahul , making it the highest in the history of the tournament. He also achieved the milestone of the fastest to score 13,000 ODI runs in 267 innings.",
    "During the 2023 ODI World Cup , he scored the most number of 1000 runs in a year. This marked the eighth time in Kohli's career that he achieved this milestone, surpassing the record held by Sachin Tendulkar, who had scored 1000 or more runs 7 times in his career. In the semi-final, Kohli scored his 50th ODI century, surpassing Tendulkar and became the only player with 50 ODI 100s. He also became the first player to hit 700 runs in a single World Cup edition. Kohli became the third highest run-scorer in ODIs .",
    "He won the Player of the Tournament award for scoring 765 runs, the highest in a single edition in the history of the World Cup which consisted of three centuries with an average of 95.62. This was his third Player of the Tournament award in a World Cup, having previously won it in 2014 and 2016.",
    "In 2024, India won the T20 World Cup and Kohli contributed in the final by scoring 76 runs off 59 balls, becoming the player of the match. After the win, he announced his T20I retirement, saying it was the time for the next generation to take over.",
    "Where others reacted, Kohli anticipated. He saw innings before they unfolded. He lived the pressure before it arrived.",
    "In 2024, he scored his 81st century. This was his 7th Test century in Australia, making him the player with the most Test centuries for India in Australia. In the 2025 Champions Trophy , Kohli scored another century against Pakistan and led India to an iconic six-wicket victory. This was his 51st century in ODIs and he became the fastest to reach 14,000 runs, achieving this in 287 innings. Kohli also surpassed Mohammad Azharuddin 's record of 156 catches, becoming the player with most catches in ODIs. Ricky Ponting was all-praises about him, calling it a chase masterclass and highlighting his ability to step up in crucial moments for his team.",
    "Kohli then scored 84 runs off 98 balls in the semi-final against Australia, helping India win by four wickets. He surpassed Sachin Tendulkar's record for most 50+ scores in ICC ODI tournaments and became India's top run-scorer in Champions Trophy history. He also completed 8,000 runs while chasing in ODIs. Due to his brilliant performance throughout the event, he was named in the Team of the Tournament by ICC .",
    "On 12 May 2025, Kohli officially announced his retirement from the Test format. This came right before India's tour of England . It raised questions because he has been quite successful on England tours in the past. He was also just 770 runs short of the massive milestone of 10k Test format runs.",
    "The golden boy, the next superstar and the face of India's new generation. He turned himself into a ruthless run machine and the most feared player in the world.",
    "In 2007, the Board of Control for Cricket in India introduced the Indian Premier League , a franchise-based T20 league. Among the franchises, Royal Challengers Bangalore , owned by Vijay Mallya at the time, selected Kohli to join their team for a sum of $50,000 through a draft. This decision was influenced by his performance in the U19 World Cup in Malaysia which India won under him.",
    "In the first season, Kohli's performance gave a total of 165 runs and RCB secured the 7th position on the points table. In the next season , the team made it to the playoffs. During the semi-final against Chennai Super Kings , Kohli led RCB to the final. But in the final against Deccan Chargers , RCB fell short by a meagre 8 runs, thus concluding the season as the runners-up.",
    "During the 2010 season , Kohli was the vice-captain. His standout performance came in an encounter against the Deccan Chargers, where he scored 58 runs at a strike rate of 165. RCB made it to the playoffs but in the semi-final against Mumbai Indians , the team faced a defeat of 35 runs, ending the season's campaign. In the Champions League T20 , Kohli scored 49* runs against the Lions , guiding his team to the semis. They lost to the Chennai Super Kings by 52 runs, thus ending their tournament’s run.",
    "Prior to the 2011 season of the IPL, Kohli was the sole player retained by Bangalore, for an amount of US$1.8 million . He scored 56 runs against the Delhi Daredevils , and was awarded the player of the match for the first time in the tournament. Against the Pune Warriors , he claimed his second player of the match award and became the leading run-scorer of the season, donning the orange cap , also surpassing 1000 IPL runs.",
    "With captain Daniel Vettori sustaining an injury, he captained the team for the first time. RCB ended the league stage at the top position on the points table. They reached the final but fell short of the win. During the season, Kohli amassed 557 runs with 4 half-centuries, becoming the second-highest run-scorer after Chris Gayle .",
    "In the Champions League, the team reached the finals with many crucial knocks by Kohli but lost to Mumbai Indians by 31 runs.",
    "Halfway into the 2012 season , Daniel Vettori stepped down as the captain and handed the role to Kohli for the rest of matches. He contributed to the team's chase in a must-win match but his dismissal led to a batting order collapse, thus resulting in a defeat.",
    "After Vettori's retirement, Kohli assumed the role of full-time captain for RCB starting from the 2013 season . With a strong start to the season that saw RCB occupying the top position in the table, the team's performance fell in the latter half of the tournament.",
    "The 2014 season was a mixed bag with the team facing several challenges. But Kohli's popularity continued to soar, making him the most-searched player on the internet during the tournament. During the 2015 season , key changes were made and the team made it to the playoffs but then lost in qualifier two. Through the season, Kohli hit a total of 505 runs in 16 matches the third-highest run tally achieved by him in a single season.",
    "In the 2016 season , Kohli shared 3 century partnerships with de Villiers. His match-winning knocks and technical proficiency received appreciation. In the final, RCB fell short by 8 runs. He was the highest run-scorer of the tournament and won the Orange Cap as well as the title of the most valuable player with 973 runs in 16 matches at an average of 81.08. Additionally, he hit the most sixes, had the most centuries as well as had the best average of the season.",
    "In the 2017 season , Kohli grappled with a shoulder injury, which sidelined him for the initial three fixtures of the tournament. The team had a poor tournament while he scored a total of 308 runs in 10 innings.",
    "He is a consummate surgeon at the crease, intensely focused, working hard, playing the ball into gaps in the field and staying calm under pressure. He is always judging the right time to consolidate and the right time to seize a game by the scruff of the neck.",
    "During the 2018 season , RCB retained Kohli for sum of ₹ 17 crore (US$2.0 million), making him the league's most expensive player at the time. He surpassed 500 runs in the season, a feat he accomplished for a record fifth time. RCB's poor bowling attack led to their elimination from the tournament. In the 2019 season , his form dipped as he struggled for consistency. RCB, as always heavily reliant on him, was eliminated.",
    "During the 2020 season , RCB won five of the 8 matches, but fizzled out during the latter part. They qualified for the playoffs on the basis of their net run rate but could not make it to the finals. In the 2021 season , the team qualified for the playoffs, but lost in the eliminator . Kohli officially announced the end of his tenure as the captain of RCB.",
    "In the 2022 season , Kohli was retained for a sum of ₹ 15 crore (US$1.8 million). Faf du Plessis took over the captaincy duty and the team made it to the playoffs again but then lost in the eliminator and qualifier 2 .",
    "In the 2023 season , Kohli assumed the role of a stand-in captain in the absence of du Plessis. His performances led to him clinching the record of most centuries in the league. RCB was eventually eliminated and Kohli ended the season with 639 runs at an average of 53.2 and a strike rate of 140.",
    "In the 2024 season , RCB was on a 6 game losing streak, but made a brilliant and iconic turnaround, with a 6 game winning streak in the season's second half. This comeback was called the blueprint by Chennai Super Kings coach Stephen Fleming as well as Sunrisers Hyderabad coach Daniel Vettori and player Nitish Kumar Reddy with their teams hoping to do the same in the 2025 season. Kohli surpassed the 8000 runs mark in total and won his second orange cap for being the highest run-scorer with 741 runs.",
    "The 2025 season saw RCB win it's first title with all the players dedicating it to Kohli. He wears jersey number 18 and this was season 18 of the league making it very special. He scored 657 runs in 15 innings, becoming him the third-highest run-scorer of the 2025 edition. He averaged 54.75, struck at 146.5, and amassed eight half-centuries. Kohli also become broke several records including the most half-centuries as well as fours. RCB broke many records and even became the only team to have won all their away games in a season.",
    "Kohli's batting style and approach to the game have frequently drawn comparisons to Sachin Tendulkar , whom he regards as the epitome of excellence in the sport of cricket. Called Tendulkar's successor, he is widely considered to have the potential to surpass his records. Kohli has stated he tried to mirror Tendulkar's style of batting, imitating his shots and attempting to hit sixes in a similar manner.",
    "His aggressive and dynamic style has earned him accolades from cricketing greats such as Vivian Richards, who has acknowledged Kohli's similarities to his own style. He has been lauded as the \"new king of world cricket\" by Dean Jones , a former Australian cricketer. Kohli's skills with the bat have earned him accolades from former West Indies great Brian Lara , who has ranked him among the best batsmen in the world.",
    "Tendulkar proclaimed that Kohli possesses the potential to surpass his record of 100 international centuries. He acknowledged Kohli's batting aptitude and steadfastness of accumulating runs. In 2013, Tendulkar retired from international cricket, marking the end of an era for Indian cricket. Kohli played alongside Tendulkar in the team.",
    "In 2024, Kohli became the fastest player to score 27,000 runs in international cricket. He surpassed Tendulkar's record, achieving the feat in 594 innings compared to Tendulkar's 623, during the Test against Bangladesh at Green Park Stadium . Kohli now joins Ricky Ponting and Kumar Sangakkara as the only players to have crossed this milestone in international cricket.",
    "Kohli possesses technical abilities and a dynamic playing demeanour. His customarily batting position in ODl cricket is at number three with a slightly open-chested stance and a grip on the bottom handle of his bat. He has been noted for his agile footwork, expansive range of strokes, and his propensity for adeptly orchestrating innings whilst thriving in high-pressure situations. In his batting technique, Kohli tends to favour playing grounded shots rather than attempting big hits. He is appreciated for his ability to execute wrist shots and his consistent prowess in the mid-wicket and cover region.",
    "Kohli has often expressed his admiration for the cover drive , which he considers to be his signature stroke. He uses the flick shot , particularly when facing deliveries aimed towards leg stump . Having a limited recourse to the sweep shot , Kohli's batting technique is characterized by an emphasis on ground shots that primarily yield runs in the regions between deep square leg and mid-on . Kohli scores runs between long-off and long-on with an aligned bat. His combo of bat-speed and wrist movements enable him to craft innovative angles that disrupt traditional field positioning. Kohli is also an extremely proficient fielder.",
    "He has a vulnerability to deliveries that are wide of the off-stump . Bowlers often exploit this weakness by targeting him with such deliveries, especially in Test and ODl matches. Cricket experts such as VVS Laxman and former India cricketer Sanjay Manjrekar have acknowledged this weakness, and former New Zealand cricketer Richard Hadlee has also noted that Kohli is particularly susceptible to out-swinging deliveries.",
    "Kohli has recognition as a limited-overs batsman. In ODIs, he boasts an average of 65.5 runs when batting second and 51.7 runs when batting first. He has amassed 28 of his 51 ODI hundreds in run-chases, and holds the record for the most hundreds scored batting second. Kohli has often expressed a fondness for the challenge of chasing a score, relishing the opportunity to test himself and demonstrate his ability to manage strike rotation and execute boundary hits. His colleagues admire his self-assurance, dedication, concentration, and work ethic, which are the driving forces behind his success.",
    "Kohli's playing style is aggressive, a trait that extends to his leadership on field. His captaincy is characterized as proactive, taking decisions and leading the team by example. Kohli has been the subject of much media scrutiny and criticism in the early stages of his career. He was often portrayed as a brash and arrogant individual, eliciting mixed reactions. While some have praised his assertiveness and confidence, others have criticized Kohli's behaviour for crossing the boundaries of fair play and for losing control, sometimes resulting in a loss of composure. The cricketer has persistently maintained that his aggression acts as a source of inspiration and drives his focus and motivation on the field. Writing for The New York Times , Huw Richards noted Kohli's self-assuredness and \"assertiveness\" in contrast to some former Indian cricketers who he felt had exhibited an inclination towards excessive politeness and reticence, and that Kohli embodies his combative demeanour both on and off the cricket field.",
    "Kohli and actress Anushka Sharma met on the sets of an advertisement they were both signed to star in. They started dating in 2013 and their popularity led to the masses giving them the moniker Virushka. During an interview with Graham Bensinger , he recalled how they met during the promotional shoot for Clear shampoo . Their union attracted significant media and public interest. On 11 December 2017, the couple got married in a ceremony held in Florence , Italy .",
    "On 11 January 2021, they had their first child, a daughter. On 15 February 2024, the couple welcomed their second child, a son.",
    "In 2018, Kohli disclosed that he had made the decision to adopt a vegetarian diet in an effort to alleviate the symptoms of a cervical spine issue caused by elevated levels of uric acid . This condition was impacting his finger movements, thus, affecting his performance as a batsman. He made a conscious effort to abstain from consuming meat, as part of his regimen for maintaining optimal health. He has since clarified that his dietary choices do not align with a vegan lifestyle and he continues to consume dairy products and eggs effectively making what is known in India as an eggetarian . His hard work and discipline have earned him the reputation of being one of the fittest sportspersons in the world.",
    "Kohli has acknowledged a belief in superstitions and owns various lucky charms and rituals that he feels serve to bring him good fortune on the cricket field. One such tradition involves the donning of black wristband . Additionally, he prefers a particular pair of gloves, which he has consistently worn. Furthermore, Kohli has been observed sporting a kara , a traditional bangle often worn for religious or spiritual purposes, on his right arm since 2012. In addition to the previously mentioned superstitions, Kohli has also established the ritual of consistently donning white shoes on the cricket field. Kohli has tattoos of the Hindu deity Lord Shiva , the sacred syllable \" Om \", the names of his parents, Prem and Saroj, a tribal emblem , a representation of a serene monastery, a samurai warrior, the astrological symbol of the scorpion , and his ODl and Test match cap numbers.",
    "In 2008, Kohli was approached by sports agent Bunty Sajdeh of Cornerstone Sport and Entertainment after his performance in the ICC Under-19 World Cup . Sajdeh was impressed with Kohli's leadership skills and attitude and saw potential in the young cricketer. After being recommended by Yuvraj Singh, Kohli was signed to Cornerstone Sport and Entertainment. Over the years, Kohli's brand endorsement portfolio has experienced significant growth. In 2013, it was reported that his endorsements were valued at over ₹ 1 billion (US$12 million). In 2023, his brand value reached ₹ 1,000 crore (US$120 million). His bat deal with MRF is one of the most financially rewarding deals in cricket history. In 2017, Kohli entered into an endorsement agreement with Puma that spanned over eight years and was estimated to be worth around ₹ 1.1 billion (US$13 million). This deal made Kohli the first Indian athlete to sign a brand endorsement contract valued at ₹ 100 crore (equivalent to ₹ 140 crore or US$17 million in 2023) deal with a brand. As of January 2023 [update] , Kohli is widely regarded as the most marketable cricketer, with annual earnings estimated at ₹ 165 crore (equivalent to ₹ 175 crore or US$21 million in 2023). Kohli is the most followed Asian individual on the social media platform Instagram , with over 270 million followers on the platform. Reports indicate that he is able to command a fee of ₹ 8.9 crore (equivalent to ₹ 9.4 crore or US$1.1 million in 2023) for each sponsored post on the platform.",
    "ESPN ranked Kohli among the world's most renowned athletes. In 2014, American Appraisal conducted an evaluation of Kohli's brand value and determined it to be $56.4 million, placing him fourth on the list of India's most valued celebrity brands. In October 2016 by Duff & Phelps , Kohli's brand worth had increased to $92 million, second only to that of Bollywood actor Shah Rukh Khan . In 2017, Kohli was recognized by Forbes as the seventh \"Most Valuable Brand among Athletes\", with a brand estimation of $14.5 million. By September of the same year, Kohli had endorsement agreements with 17 distinct brands, and he announced that he would only endorse products that he personally uses and believes in. The following year, he was featured on Time magazine's annual list of the 100 most influential people in the world . In 2019, Kohli was the only cricketer included in Forbes' list of \"World's 100 Highest-Paid Athletes\". He was ranked 100th on the list, with earnings estimated at $25 million, with $21 million being procured through endorsements, and the remainder from salary and tournament winnings. Furthermore, in March 2019, Kohli was named the brand ambassador of the mobile esports platform, Mobile Premier League . Kohli's earning potential continued to climb, and in 2020, he attained the 66th spot in Forbes compilation of the top 100 highest-paid athletes in the world for the year 2020 , with estimated earnings exceeding $26 million. In April 2021, Vivo appointed Kohli as their brand ambassador ahead of the Indian Premier League.",
    "In 2012, Kohli was recognized as one of the best-dressed men by the fashion magazine GQ , appearing on their annual list. Six years later, in 2018, a documentary highlighting Kohli's cricketing career was released on National Geographic channel. The following year, on the eve of the 2019 Cricket World Cup Madame Tussauds unveiled an waxwork of Kohli in London. In 2019, on the eleventh anniversary of his international debut, Kohli was honoured with a stand named after him at the Feroz Shah Kotla Stadium in Delhi, making him the youngest cricketer to receive such a recognition. In November of the same year, an Indian animated superhero television series entitled Super V premiered, featuring a fictionalized portrayal of Kohli's teenage years and his discovery of superpowers.",
    "Kohli invested in Indian Super League club FC Goa , which he co-owned as of 2024. Beyond the realm of cricket, this venture served as a future business opportunity for him, as he sought to diversify his portfolio after retirement from the sport. In 2014, Kohli partnered with Anjana Reddy's Universal Sportsbiz to launch the fashion brand WROGN . The brand specialized in men's casual wear clothing and entered into collaborations with retail outlets such as Myntra and Shopper's Stop . Additionally, in late 2014, Kohli became a shareholder and brand ambassador for the London-based social networking venture Sport Convo. His involvement aimed to promote and raise awareness of the platform, which was focused on providing a space for sports fans to connect and engage with one another.",
    "In 2015, Kohli invested a sum of ₹ 90 crore (US$11 million) towards the establishment of a chain of health clubs and fitness centers throughout India. Dubbed as \" Chisel \", the network of gyms was established through a joint venture between Kohli, Chisel India, and Cornerstone Sport and Entertainment, the organization responsible for managing Kohli's commercial pursuits. In Sep that year, Kohli expanded his portfolio of sports-related investments by becoming a co-owner of the International Premier Tennis League franchise, UAE Royals . He became a co-owner of the JSW -owned Bengaluru Yodhas franchise in the Pro Wrestling League .",
    "In the year 2016, Kohli joined forces with Stepathlon Lifestyle to launch Stepathlon Kids. The initiative aimed to encourage young individuals to adopt healthy lifestyle habits and inculcate the love for physical activity .",
    "In 2017, Kohli partnered with the German sportswear brand, Puma , to launch his athletic lifestyle brand, One8 . This brand offers a range of sport-related apparel, footwear, and accessories. That same year, Kohli also established Nueva, a fine dining establishment located in New Delhi. The restaurant features a South American-inspired decor accentuated with Native American artwork, providing a distinctive culinary setting. Kohli also established One8 Commune , a chain of restaurant bars. This marked his inaugural foray into the food and beverage industry. The first outlet of this restaurant was launched in 2017.",
    "In 2022, Kohli and his spouse made an investment of ₹ 2.5 crore (equivalent to ₹ 2.9 crore or US$350,000 in 2023) in Digit , an insurance-based startup. Additionally, they also extended their support to Blue Tribe , a startup that specializes in the production and distribution of plant-based meat products. Driven by his own inclination towards a plant-based diet, Kohli aims to raise awareness and encourage individuals to adopt more sustainable and environmentally conscious practices. In May 2025, Virat Kohli joined sports athleisure brand Agilitas as an investor, ending his eight-year contract with Puma , he also joined the World Bowling League (WBL) as a Strategic Investor.",
    "In 2013, Kohli founded the \"Virat Kohli Foundation\" with a philanthropic objective to support underprivileged children. The foundation collaborates with a selected group of NGOs to increase awareness and gather support for various causes that are instrumental in advancing their mission of promoting the welfare and well-being of these children. In 2014, the foundation participated in a charity auction organized by eBay and Save the Children India, the proceeds of which were directed towards the education and healthcare of underprivileged children.",
    "Kohli's foundation has organized several charity events to raise funds for its causes, including football matches featuring Indian cricketers and Bollywood actors. The first such event was a celebrity football match in collaboration with Abhishek Bachchan 's charity foundation, which drew media attention and was raised funds. In this match, Kohli captained the All Hearts FC against the All Stars FC, led by Abhishek Bachchan. Another charity football match, dubbed the \"Celebrity Clasico\", was held in June 2016 in Mumbai, with Kohli again leading the All Hearts FC against the All Stars FC, captained by Ranbir Kapoor .",
    "In 2016, the Virat Kohli Foundation entered into a partnership with Smile Foundation to promote the empowerment of underprivileged children and young people. To kickstart this initiative, Kohli organized a philanthropic dinner at Grand Hyatt, Mumbai , with cricket players such as MS Dhoni, Shikhar Dhawan, Yuvraj Singh, Ajinkya Rahane, and KL Rahul to support the cause of child and youth empowerment. To advance the goals of the Swachh Bharat Mission (SBM), which aims at creating a cleaner India, Kohli and the Indian cricket team, in collaboration with Anurag Thakur , undertook a cleaning initiative at the Eden Gardens on the occasion of Gandhi Jayanti of 2016.",
    "Prior to a match against Sri Lanka in the 2017 Champions Trophy , Kohli hosted a benevolent gala event in London in support of the Justice and Care organization. The ball was arranged with the objective of increasing both funds and awareness for the humanitarian cause championed by Justice and Care. The organization endeavors to combat human trafficking and contemporary slavery. In 2017, Kohli established the Athlete Development Programme (ADP) as a platform for nurturing and supporting aspiring young athletes. This initiative provides guidance to young athletes in areas such as coaching, training, fitness, competition, and nutrition. The program has been used by young sports persons, including tennis player Swastika Ghosh and golfer Aadil Bedi .",
    "In response to the COVID-19 pandemic of 2020, Kohli and his wife Anushka Sharma pledged donations to the PM CARES Fund and the Maharashtra CM Relief Fund. Through his support of Awaaz , Kohli seeks to provide comprehensive medical services, shelter, and sustenance to stray animals.",
    "Kohli is the only cricketer to have been named the Player of the Tournament in the T20 World Cup on two separate occasions, in 2014 and 2016 . In terms of ODI centuries, he ranks first with 51. He surpassed Sachin Tendulkar's tally of 49 ODI tons and achieved this feat on 15 November 2023 in the semifinal of the 2023 ODI World Cup , while also becoming the first player to score more than 700 runs in a single edition of the tournament. Furthermore, in international cricket, Kohli has amassed 82 centuries, second only to Sachin Tendulkar's 100 centuries. In 2018, Kohli set a record, becoming the first player to score 1,000 ODI runs in 11 innings in a calendar year. In 2022, he achieved another milestone by scoring 1,000 runs in the T20 World Cup , becoming the second player to reach this feat after Mahela Jayawardene. During the match against Bangladesh, he became the top-scorer in the history of T20 World Cup .",
    "Kohli has 82 centuries in international cricket. This includes 30 centuries including 7 double centuries in Tests , 51 centuries in ODIs , and 1 century in T20Is . He has the most ODI centuries and the second most centuries in international cricket , as a result."
  ],
  "scraped_at": "2025-06-11 06:39:21 UTC"
}